podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#ifndef __O
#define __O volatile
#endif


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */



/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif
/**
* @addtogroup Peripheral_access_layer_GROUP Device Peripheral Access Layer
* @brief C structs allowing access to peripheral registers
* @{
*/
/**
* @addtogroup ADC_Peripheral_access_layer_GROUP ADC Peripheral Access Layer
* @brief C Struct for ADC
* @{
*/

/* ================================================================================ */
/* ================           ADC0 (file:ADC0_MKV)                 ================ */
/* ================================================================================ */

/**
 * @brief Analog to digital converter
 */
/**
* @addtogroup ADC_structs_GROUP ADC struct
* @brief Struct for ADC
* @{
*/
typedef struct {                                /*       ADC0 Structure                                               */
   __IO uint16_t  CTRL1;                        /**< 0000: ADC Control Register 1                                       */
   __IO uint16_t  CTRL2;                        /**< 0002: ADC Control Register 2                                       */
   __IO uint16_t  ZXCTRL1;                      /**< 0004: ADC Zero Crossing Control 1 Register                         */
   __IO uint16_t  ZXCTRL2;                      /**< 0006: ADC Zero Crossing Control 2 Register                         */
   __IO uint16_t  CLIST1;                       /**< 0008: ADC Channel List Register 1                                  */
   __IO uint16_t  CLIST2;                       /**< 000A: ADC Channel List Register 2                                  */
   __IO uint16_t  CLIST3;                       /**< 000C: ADC Channel List Register 3                                  */
   __IO uint16_t  CLIST4;                       /**< 000E: ADC Channel List Register 4                                  */
   __IO uint16_t  SDIS;                         /**< 0010: ADC Sample Disable Register                                  */
   __IO uint16_t  STAT;                         /**< 0012: ADC Status Register                                          */
   __I  uint16_t  RDY;                          /**< 0014: ADC Ready Register                                           */
   __IO uint16_t  LOLIMSTAT;                    /**< 0016: ADC Low Limit Status Register                                */
   __IO uint16_t  HILIMSTAT;                    /**< 0018: ADC High Limit Status Register                               */
   __IO uint16_t  ZXSTAT;                       /**< 001A: ADC Zero Crossing Status Register                            */
   __IO uint16_t  RSLT[16];                     /**< 001C: ADC Result Registers with sign extension                     */
   __IO uint16_t  LOLIM[16];                    /**< 003C: ADC Low Limit                                                */
   __IO uint16_t  HILIM[16];                    /**< 005C: ADC High Limit                                               */
   __IO uint16_t  OFFST[16];                    /**< 007C: ADC Offset                                                   */
   __IO uint16_t  PWR;                          /**< 009C: ADC Power Control Register                                   */
   __IO uint16_t  CAL;                          /**< 009E: ADC Calibration Register                                     */
   __IO uint16_t  GC1;                          /**< 00A0: Gain Control 1 Register                                      */
   __IO uint16_t  GC2;                          /**< 00A2: Gain Control 2 Register                                      */
   __IO uint16_t  SCTRL;                        /**< 00A4: ADC Scan Control Register                                    */
   __IO uint16_t  PWR2;                         /**< 00A6: ADC Power Control Register                                   */
   __IO uint16_t  CTRL3;                        /**< 00A8: ADC Control Register 3                                       */
   __IO uint16_t  SCHLTEN;                      /**< 00AA: ADC Scan Interrupt Enable Register                           */
} ADC_Type;

/**
 * @} */ /* End group ADC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ADC0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup ADC_Register_Masks_GROUP ADC Register Masks
* @brief Register Masks for ADC
* @{
*/
/* ------- CTRL1 Bit Fields                         ------ */
#define ADC_CTRL1_SMODE_MASK                     (0x07UL << ADC_CTRL1_SMODE_SHIFT)                   /*!< ADC0_CTRL1: SMODE Mask                  */
#define ADC_CTRL1_SMODE_SHIFT                    0                                                   /*!< ADC0_CTRL1: SMODE Position              */
#define ADC_CTRL1_SMODE(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_SMODE_SHIFT))&ADC_CTRL1_SMODE_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_CHNCFG_L_MASK                  (0x0FUL << ADC_CTRL1_CHNCFG_L_SHIFT)                /*!< ADC0_CTRL1: CHNCFG_L Mask               */
#define ADC_CTRL1_CHNCFG_L_SHIFT                 4                                                   /*!< ADC0_CTRL1: CHNCFG_L Position           */
#define ADC_CTRL1_CHNCFG_L(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_CHNCFG_L_SHIFT))&ADC_CTRL1_CHNCFG_L_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_HLMTIE_MASK                    (0x01UL << ADC_CTRL1_HLMTIE_SHIFT)                  /*!< ADC0_CTRL1: HLMTIE Mask                 */
#define ADC_CTRL1_HLMTIE_SHIFT                   8                                                   /*!< ADC0_CTRL1: HLMTIE Position             */
#define ADC_CTRL1_HLMTIE(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_HLMTIE_SHIFT))&ADC_CTRL1_HLMTIE_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_LLMTIE_MASK                    (0x01UL << ADC_CTRL1_LLMTIE_SHIFT)                  /*!< ADC0_CTRL1: LLMTIE Mask                 */
#define ADC_CTRL1_LLMTIE_SHIFT                   9                                                   /*!< ADC0_CTRL1: LLMTIE Position             */
#define ADC_CTRL1_LLMTIE(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_LLMTIE_SHIFT))&ADC_CTRL1_LLMTIE_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_ZCIE_MASK                      (0x01UL << ADC_CTRL1_ZCIE_SHIFT)                    /*!< ADC0_CTRL1: ZCIE Mask                   */
#define ADC_CTRL1_ZCIE_SHIFT                     10                                                  /*!< ADC0_CTRL1: ZCIE Position               */
#define ADC_CTRL1_ZCIE(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_ZCIE_SHIFT))&ADC_CTRL1_ZCIE_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_EOSIE0_MASK                    (0x01UL << ADC_CTRL1_EOSIE0_SHIFT)                  /*!< ADC0_CTRL1: EOSIE0 Mask                 */
#define ADC_CTRL1_EOSIE0_SHIFT                   11                                                  /*!< ADC0_CTRL1: EOSIE0 Position             */
#define ADC_CTRL1_EOSIE0(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_EOSIE0_SHIFT))&ADC_CTRL1_EOSIE0_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_SYNC0_MASK                     (0x01UL << ADC_CTRL1_SYNC0_SHIFT)                   /*!< ADC0_CTRL1: SYNC0 Mask                  */
#define ADC_CTRL1_SYNC0_SHIFT                    12                                                  /*!< ADC0_CTRL1: SYNC0 Position              */
#define ADC_CTRL1_SYNC0(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_SYNC0_SHIFT))&ADC_CTRL1_SYNC0_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_START0_MASK                    (0x01UL << ADC_CTRL1_START0_SHIFT)                  /*!< ADC0_CTRL1: START0 Mask                 */
#define ADC_CTRL1_START0_SHIFT                   13                                                  /*!< ADC0_CTRL1: START0 Position             */
#define ADC_CTRL1_START0(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_START0_SHIFT))&ADC_CTRL1_START0_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_STOP0_MASK                     (0x01UL << ADC_CTRL1_STOP0_SHIFT)                   /*!< ADC0_CTRL1: STOP0 Mask                  */
#define ADC_CTRL1_STOP0_SHIFT                    14                                                  /*!< ADC0_CTRL1: STOP0 Position              */
#define ADC_CTRL1_STOP0(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_STOP0_SHIFT))&ADC_CTRL1_STOP0_MASK) /*!< ADC0_CTRL1                              */
#define ADC_CTRL1_DMAEN0_MASK                    (0x01UL << ADC_CTRL1_DMAEN0_SHIFT)                  /*!< ADC0_CTRL1: DMAEN0 Mask                 */
#define ADC_CTRL1_DMAEN0_SHIFT                   15                                                  /*!< ADC0_CTRL1: DMAEN0 Position             */
#define ADC_CTRL1_DMAEN0(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL1_DMAEN0_SHIFT))&ADC_CTRL1_DMAEN0_MASK) /*!< ADC0_CTRL1                              */
/* ------- CTRL2 Bit Fields                         ------ */
#define ADC_CTRL2_DIV0_MASK                      (0x3FUL << ADC_CTRL2_DIV0_SHIFT)                    /*!< ADC0_CTRL2: DIV0 Mask                   */
#define ADC_CTRL2_DIV0_SHIFT                     0                                                   /*!< ADC0_CTRL2: DIV0 Position               */
#define ADC_CTRL2_DIV0(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_DIV0_SHIFT))&ADC_CTRL2_DIV0_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_SIMULT_MASK                    (0x01UL << ADC_CTRL2_SIMULT_SHIFT)                  /*!< ADC0_CTRL2: SIMULT Mask                 */
#define ADC_CTRL2_SIMULT_SHIFT                   6                                                   /*!< ADC0_CTRL2: SIMULT Position             */
#define ADC_CTRL2_SIMULT(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_SIMULT_SHIFT))&ADC_CTRL2_SIMULT_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_CHNCFG_H_MASK                  (0x0FUL << ADC_CTRL2_CHNCFG_H_SHIFT)                /*!< ADC0_CTRL2: CHNCFG_H Mask               */
#define ADC_CTRL2_CHNCFG_H_SHIFT                 7                                                   /*!< ADC0_CTRL2: CHNCFG_H Position           */
#define ADC_CTRL2_CHNCFG_H(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_CHNCFG_H_SHIFT))&ADC_CTRL2_CHNCFG_H_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_EOSIE1_MASK                    (0x01UL << ADC_CTRL2_EOSIE1_SHIFT)                  /*!< ADC0_CTRL2: EOSIE1 Mask                 */
#define ADC_CTRL2_EOSIE1_SHIFT                   11                                                  /*!< ADC0_CTRL2: EOSIE1 Position             */
#define ADC_CTRL2_EOSIE1(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_EOSIE1_SHIFT))&ADC_CTRL2_EOSIE1_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_SYNC1_MASK                     (0x01UL << ADC_CTRL2_SYNC1_SHIFT)                   /*!< ADC0_CTRL2: SYNC1 Mask                  */
#define ADC_CTRL2_SYNC1_SHIFT                    12                                                  /*!< ADC0_CTRL2: SYNC1 Position              */
#define ADC_CTRL2_SYNC1(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_SYNC1_SHIFT))&ADC_CTRL2_SYNC1_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_START1_MASK                    (0x01UL << ADC_CTRL2_START1_SHIFT)                  /*!< ADC0_CTRL2: START1 Mask                 */
#define ADC_CTRL2_START1_SHIFT                   13                                                  /*!< ADC0_CTRL2: START1 Position             */
#define ADC_CTRL2_START1(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_START1_SHIFT))&ADC_CTRL2_START1_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_STOP1_MASK                     (0x01UL << ADC_CTRL2_STOP1_SHIFT)                   /*!< ADC0_CTRL2: STOP1 Mask                  */
#define ADC_CTRL2_STOP1_SHIFT                    14                                                  /*!< ADC0_CTRL2: STOP1 Position              */
#define ADC_CTRL2_STOP1(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_STOP1_SHIFT))&ADC_CTRL2_STOP1_MASK) /*!< ADC0_CTRL2                              */
#define ADC_CTRL2_DMAEN1_MASK                    (0x01UL << ADC_CTRL2_DMAEN1_SHIFT)                  /*!< ADC0_CTRL2: DMAEN1 Mask                 */
#define ADC_CTRL2_DMAEN1_SHIFT                   15                                                  /*!< ADC0_CTRL2: DMAEN1 Position             */
#define ADC_CTRL2_DMAEN1(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL2_DMAEN1_SHIFT))&ADC_CTRL2_DMAEN1_MASK) /*!< ADC0_CTRL2                              */
/* ------- ZXCTRL1 Bit Fields                       ------ */
#define ADC_ZXCTRL1_ZCE0_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE0_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE0 Mask                 */
#define ADC_ZXCTRL1_ZCE0_SHIFT                   0                                                   /*!< ADC0_ZXCTRL1: ZCE0 Position             */
#define ADC_ZXCTRL1_ZCE0(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE0_SHIFT))&ADC_ZXCTRL1_ZCE0_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE1_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE1_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE1 Mask                 */
#define ADC_ZXCTRL1_ZCE1_SHIFT                   2                                                   /*!< ADC0_ZXCTRL1: ZCE1 Position             */
#define ADC_ZXCTRL1_ZCE1(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE1_SHIFT))&ADC_ZXCTRL1_ZCE1_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE2_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE2_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE2 Mask                 */
#define ADC_ZXCTRL1_ZCE2_SHIFT                   4                                                   /*!< ADC0_ZXCTRL1: ZCE2 Position             */
#define ADC_ZXCTRL1_ZCE2(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE2_SHIFT))&ADC_ZXCTRL1_ZCE2_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE3_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE3_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE3 Mask                 */
#define ADC_ZXCTRL1_ZCE3_SHIFT                   6                                                   /*!< ADC0_ZXCTRL1: ZCE3 Position             */
#define ADC_ZXCTRL1_ZCE3(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE3_SHIFT))&ADC_ZXCTRL1_ZCE3_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE4_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE4_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE4 Mask                 */
#define ADC_ZXCTRL1_ZCE4_SHIFT                   8                                                   /*!< ADC0_ZXCTRL1: ZCE4 Position             */
#define ADC_ZXCTRL1_ZCE4(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE4_SHIFT))&ADC_ZXCTRL1_ZCE4_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE5_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE5_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE5 Mask                 */
#define ADC_ZXCTRL1_ZCE5_SHIFT                   10                                                  /*!< ADC0_ZXCTRL1: ZCE5 Position             */
#define ADC_ZXCTRL1_ZCE5(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE5_SHIFT))&ADC_ZXCTRL1_ZCE5_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE6_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE6_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE6 Mask                 */
#define ADC_ZXCTRL1_ZCE6_SHIFT                   12                                                  /*!< ADC0_ZXCTRL1: ZCE6 Position             */
#define ADC_ZXCTRL1_ZCE6(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE6_SHIFT))&ADC_ZXCTRL1_ZCE6_MASK) /*!< ADC0_ZXCTRL1                            */
#define ADC_ZXCTRL1_ZCE7_MASK                    (0x03UL << ADC_ZXCTRL1_ZCE7_SHIFT)                  /*!< ADC0_ZXCTRL1: ZCE7 Mask                 */
#define ADC_ZXCTRL1_ZCE7_SHIFT                   14                                                  /*!< ADC0_ZXCTRL1: ZCE7 Position             */
#define ADC_ZXCTRL1_ZCE7(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL1_ZCE7_SHIFT))&ADC_ZXCTRL1_ZCE7_MASK) /*!< ADC0_ZXCTRL1                            */
/* ------- ZXCTRL2 Bit Fields                       ------ */
#define ADC_ZXCTRL2_ZCE8_MASK                    (0x03UL << ADC_ZXCTRL2_ZCE8_SHIFT)                  /*!< ADC0_ZXCTRL2: ZCE8 Mask                 */
#define ADC_ZXCTRL2_ZCE8_SHIFT                   0                                                   /*!< ADC0_ZXCTRL2: ZCE8 Position             */
#define ADC_ZXCTRL2_ZCE8(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE8_SHIFT))&ADC_ZXCTRL2_ZCE8_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE9_MASK                    (0x03UL << ADC_ZXCTRL2_ZCE9_SHIFT)                  /*!< ADC0_ZXCTRL2: ZCE9 Mask                 */
#define ADC_ZXCTRL2_ZCE9_SHIFT                   2                                                   /*!< ADC0_ZXCTRL2: ZCE9 Position             */
#define ADC_ZXCTRL2_ZCE9(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE9_SHIFT))&ADC_ZXCTRL2_ZCE9_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE10_MASK                   (0x03UL << ADC_ZXCTRL2_ZCE10_SHIFT)                 /*!< ADC0_ZXCTRL2: ZCE10 Mask                */
#define ADC_ZXCTRL2_ZCE10_SHIFT                  4                                                   /*!< ADC0_ZXCTRL2: ZCE10 Position            */
#define ADC_ZXCTRL2_ZCE10(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE10_SHIFT))&ADC_ZXCTRL2_ZCE10_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE11_MASK                   (0x03UL << ADC_ZXCTRL2_ZCE11_SHIFT)                 /*!< ADC0_ZXCTRL2: ZCE11 Mask                */
#define ADC_ZXCTRL2_ZCE11_SHIFT                  6                                                   /*!< ADC0_ZXCTRL2: ZCE11 Position            */
#define ADC_ZXCTRL2_ZCE11(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE11_SHIFT))&ADC_ZXCTRL2_ZCE11_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE12_MASK                   (0x03UL << ADC_ZXCTRL2_ZCE12_SHIFT)                 /*!< ADC0_ZXCTRL2: ZCE12 Mask                */
#define ADC_ZXCTRL2_ZCE12_SHIFT                  8                                                   /*!< ADC0_ZXCTRL2: ZCE12 Position            */
#define ADC_ZXCTRL2_ZCE12(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE12_SHIFT))&ADC_ZXCTRL2_ZCE12_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE13_MASK                   (0x03UL << ADC_ZXCTRL2_ZCE13_SHIFT)                 /*!< ADC0_ZXCTRL2: ZCE13 Mask                */
#define ADC_ZXCTRL2_ZCE13_SHIFT                  10                                                  /*!< ADC0_ZXCTRL2: ZCE13 Position            */
#define ADC_ZXCTRL2_ZCE13(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE13_SHIFT))&ADC_ZXCTRL2_ZCE13_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE14_MASK                   (0x03UL << ADC_ZXCTRL2_ZCE14_SHIFT)                 /*!< ADC0_ZXCTRL2: ZCE14 Mask                */
#define ADC_ZXCTRL2_ZCE14_SHIFT                  12                                                  /*!< ADC0_ZXCTRL2: ZCE14 Position            */
#define ADC_ZXCTRL2_ZCE14(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE14_SHIFT))&ADC_ZXCTRL2_ZCE14_MASK) /*!< ADC0_ZXCTRL2                            */
#define ADC_ZXCTRL2_ZCE15_MASK                   (0x03UL << ADC_ZXCTRL2_ZCE15_SHIFT)                 /*!< ADC0_ZXCTRL2: ZCE15 Mask                */
#define ADC_ZXCTRL2_ZCE15_SHIFT                  14                                                  /*!< ADC0_ZXCTRL2: ZCE15 Position            */
#define ADC_ZXCTRL2_ZCE15(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_ZXCTRL2_ZCE15_SHIFT))&ADC_ZXCTRL2_ZCE15_MASK) /*!< ADC0_ZXCTRL2                            */
/* ------- CLIST1 Bit Fields                        ------ */
#define ADC_CLIST1_SAMPLE0_MASK                  (0x0FUL << ADC_CLIST1_SAMPLE0_SHIFT)                /*!< ADC0_CLIST1: SAMPLE0 Mask               */
#define ADC_CLIST1_SAMPLE0_SHIFT                 0                                                   /*!< ADC0_CLIST1: SAMPLE0 Position           */
#define ADC_CLIST1_SAMPLE0(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST1_SAMPLE0_SHIFT))&ADC_CLIST1_SAMPLE0_MASK) /*!< ADC0_CLIST1                             */
#define ADC_CLIST1_SAMPLE1_MASK                  (0x0FUL << ADC_CLIST1_SAMPLE1_SHIFT)                /*!< ADC0_CLIST1: SAMPLE1 Mask               */
#define ADC_CLIST1_SAMPLE1_SHIFT                 4                                                   /*!< ADC0_CLIST1: SAMPLE1 Position           */
#define ADC_CLIST1_SAMPLE1(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST1_SAMPLE1_SHIFT))&ADC_CLIST1_SAMPLE1_MASK) /*!< ADC0_CLIST1                             */
#define ADC_CLIST1_SAMPLE2_MASK                  (0x0FUL << ADC_CLIST1_SAMPLE2_SHIFT)                /*!< ADC0_CLIST1: SAMPLE2 Mask               */
#define ADC_CLIST1_SAMPLE2_SHIFT                 8                                                   /*!< ADC0_CLIST1: SAMPLE2 Position           */
#define ADC_CLIST1_SAMPLE2(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST1_SAMPLE2_SHIFT))&ADC_CLIST1_SAMPLE2_MASK) /*!< ADC0_CLIST1                             */
#define ADC_CLIST1_SAMPLE3_MASK                  (0x0FUL << ADC_CLIST1_SAMPLE3_SHIFT)                /*!< ADC0_CLIST1: SAMPLE3 Mask               */
#define ADC_CLIST1_SAMPLE3_SHIFT                 12                                                  /*!< ADC0_CLIST1: SAMPLE3 Position           */
#define ADC_CLIST1_SAMPLE3(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST1_SAMPLE3_SHIFT))&ADC_CLIST1_SAMPLE3_MASK) /*!< ADC0_CLIST1                             */
/* ------- CLIST2 Bit Fields                        ------ */
#define ADC_CLIST2_SAMPLE4_MASK                  (0x0FUL << ADC_CLIST2_SAMPLE4_SHIFT)                /*!< ADC0_CLIST2: SAMPLE4 Mask               */
#define ADC_CLIST2_SAMPLE4_SHIFT                 0                                                   /*!< ADC0_CLIST2: SAMPLE4 Position           */
#define ADC_CLIST2_SAMPLE4(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST2_SAMPLE4_SHIFT))&ADC_CLIST2_SAMPLE4_MASK) /*!< ADC0_CLIST2                             */
