podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define ADC_CLIST2_SAMPLE5_MASK                  (0x0FUL << ADC_CLIST2_SAMPLE5_SHIFT)                /*!< ADC0_CLIST2: SAMPLE5 Mask               */
#define ADC_CLIST2_SAMPLE5_SHIFT                 4                                                   /*!< ADC0_CLIST2: SAMPLE5 Position           */
#define ADC_CLIST2_SAMPLE5(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST2_SAMPLE5_SHIFT))&ADC_CLIST2_SAMPLE5_MASK) /*!< ADC0_CLIST2                             */
#define ADC_CLIST2_SAMPLE6_MASK                  (0x0FUL << ADC_CLIST2_SAMPLE6_SHIFT)                /*!< ADC0_CLIST2: SAMPLE6 Mask               */
#define ADC_CLIST2_SAMPLE6_SHIFT                 8                                                   /*!< ADC0_CLIST2: SAMPLE6 Position           */
#define ADC_CLIST2_SAMPLE6(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST2_SAMPLE6_SHIFT))&ADC_CLIST2_SAMPLE6_MASK) /*!< ADC0_CLIST2                             */
#define ADC_CLIST2_SAMPLE7_MASK                  (0x0FUL << ADC_CLIST2_SAMPLE7_SHIFT)                /*!< ADC0_CLIST2: SAMPLE7 Mask               */
#define ADC_CLIST2_SAMPLE7_SHIFT                 12                                                  /*!< ADC0_CLIST2: SAMPLE7 Position           */
#define ADC_CLIST2_SAMPLE7(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST2_SAMPLE7_SHIFT))&ADC_CLIST2_SAMPLE7_MASK) /*!< ADC0_CLIST2                             */
/* ------- CLIST3 Bit Fields                        ------ */
#define ADC_CLIST3_SAMPLE8_MASK                  (0x0FUL << ADC_CLIST3_SAMPLE8_SHIFT)                /*!< ADC0_CLIST3: SAMPLE8 Mask               */
#define ADC_CLIST3_SAMPLE8_SHIFT                 0                                                   /*!< ADC0_CLIST3: SAMPLE8 Position           */
#define ADC_CLIST3_SAMPLE8(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST3_SAMPLE8_SHIFT))&ADC_CLIST3_SAMPLE8_MASK) /*!< ADC0_CLIST3                             */
#define ADC_CLIST3_SAMPLE9_MASK                  (0x0FUL << ADC_CLIST3_SAMPLE9_SHIFT)                /*!< ADC0_CLIST3: SAMPLE9 Mask               */
#define ADC_CLIST3_SAMPLE9_SHIFT                 4                                                   /*!< ADC0_CLIST3: SAMPLE9 Position           */
#define ADC_CLIST3_SAMPLE9(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_CLIST3_SAMPLE9_SHIFT))&ADC_CLIST3_SAMPLE9_MASK) /*!< ADC0_CLIST3                             */
#define ADC_CLIST3_SAMPLE10_MASK                 (0x0FUL << ADC_CLIST3_SAMPLE10_SHIFT)               /*!< ADC0_CLIST3: SAMPLE10 Mask              */
#define ADC_CLIST3_SAMPLE10_SHIFT                8                                                   /*!< ADC0_CLIST3: SAMPLE10 Position          */
#define ADC_CLIST3_SAMPLE10(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CLIST3_SAMPLE10_SHIFT))&ADC_CLIST3_SAMPLE10_MASK) /*!< ADC0_CLIST3                             */
#define ADC_CLIST3_SAMPLE11_MASK                 (0x0FUL << ADC_CLIST3_SAMPLE11_SHIFT)               /*!< ADC0_CLIST3: SAMPLE11 Mask              */
#define ADC_CLIST3_SAMPLE11_SHIFT                12                                                  /*!< ADC0_CLIST3: SAMPLE11 Position          */
#define ADC_CLIST3_SAMPLE11(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CLIST3_SAMPLE11_SHIFT))&ADC_CLIST3_SAMPLE11_MASK) /*!< ADC0_CLIST3                             */
/* ------- CLIST4 Bit Fields                        ------ */
#define ADC_CLIST4_SAMPLE12_MASK                 (0x0FUL << ADC_CLIST4_SAMPLE12_SHIFT)               /*!< ADC0_CLIST4: SAMPLE12 Mask              */
#define ADC_CLIST4_SAMPLE12_SHIFT                0                                                   /*!< ADC0_CLIST4: SAMPLE12 Position          */
#define ADC_CLIST4_SAMPLE12(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CLIST4_SAMPLE12_SHIFT))&ADC_CLIST4_SAMPLE12_MASK) /*!< ADC0_CLIST4                             */
#define ADC_CLIST4_SAMPLE13_MASK                 (0x0FUL << ADC_CLIST4_SAMPLE13_SHIFT)               /*!< ADC0_CLIST4: SAMPLE13 Mask              */
#define ADC_CLIST4_SAMPLE13_SHIFT                4                                                   /*!< ADC0_CLIST4: SAMPLE13 Position          */
#define ADC_CLIST4_SAMPLE13(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CLIST4_SAMPLE13_SHIFT))&ADC_CLIST4_SAMPLE13_MASK) /*!< ADC0_CLIST4                             */
#define ADC_CLIST4_SAMPLE14_MASK                 (0x0FUL << ADC_CLIST4_SAMPLE14_SHIFT)               /*!< ADC0_CLIST4: SAMPLE14 Mask              */
#define ADC_CLIST4_SAMPLE14_SHIFT                8                                                   /*!< ADC0_CLIST4: SAMPLE14 Position          */
#define ADC_CLIST4_SAMPLE14(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CLIST4_SAMPLE14_SHIFT))&ADC_CLIST4_SAMPLE14_MASK) /*!< ADC0_CLIST4                             */
#define ADC_CLIST4_SAMPLE15_MASK                 (0x0FUL << ADC_CLIST4_SAMPLE15_SHIFT)               /*!< ADC0_CLIST4: SAMPLE15 Mask              */
#define ADC_CLIST4_SAMPLE15_SHIFT                12                                                  /*!< ADC0_CLIST4: SAMPLE15 Position          */
#define ADC_CLIST4_SAMPLE15(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CLIST4_SAMPLE15_SHIFT))&ADC_CLIST4_SAMPLE15_MASK) /*!< ADC0_CLIST4                             */
/* ------- SDIS Bit Fields                          ------ */
#define ADC_SDIS_DS_MASK                         (0xFFFFUL << ADC_SDIS_DS_SHIFT)                     /*!< ADC0_SDIS: DS Mask                      */
#define ADC_SDIS_DS_SHIFT                        0                                                   /*!< ADC0_SDIS: DS Position                  */
#define ADC_SDIS_DS(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_SDIS_DS_SHIFT))&ADC_SDIS_DS_MASK) /*!< ADC0_SDIS                               */
/* ------- STAT Bit Fields                          ------ */
#define ADC_STAT_UNDEFINED_MASK                  (0xFFUL << ADC_STAT_UNDEFINED_SHIFT)                /*!< ADC0_STAT: UNDEFINED Mask               */
#define ADC_STAT_UNDEFINED_SHIFT                 0                                                   /*!< ADC0_STAT: UNDEFINED Position           */
#define ADC_STAT_UNDEFINED(x)                    (((uint16_t)(((uint16_t)(x))<<ADC_STAT_UNDEFINED_SHIFT))&ADC_STAT_UNDEFINED_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_HLMTI_MASK                      (0x01UL << ADC_STAT_HLMTI_SHIFT)                    /*!< ADC0_STAT: HLMTI Mask                   */
#define ADC_STAT_HLMTI_SHIFT                     8                                                   /*!< ADC0_STAT: HLMTI Position               */
#define ADC_STAT_HLMTI(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_STAT_HLMTI_SHIFT))&ADC_STAT_HLMTI_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_LLMTI_MASK                      (0x01UL << ADC_STAT_LLMTI_SHIFT)                    /*!< ADC0_STAT: LLMTI Mask                   */
#define ADC_STAT_LLMTI_SHIFT                     9                                                   /*!< ADC0_STAT: LLMTI Position               */
#define ADC_STAT_LLMTI(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_STAT_LLMTI_SHIFT))&ADC_STAT_LLMTI_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_ZCI_MASK                        (0x01UL << ADC_STAT_ZCI_SHIFT)                      /*!< ADC0_STAT: ZCI Mask                     */
#define ADC_STAT_ZCI_SHIFT                       10                                                  /*!< ADC0_STAT: ZCI Position                 */
#define ADC_STAT_ZCI(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_STAT_ZCI_SHIFT))&ADC_STAT_ZCI_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_EOSI0_MASK                      (0x01UL << ADC_STAT_EOSI0_SHIFT)                    /*!< ADC0_STAT: EOSI0 Mask                   */
#define ADC_STAT_EOSI0_SHIFT                     11                                                  /*!< ADC0_STAT: EOSI0 Position               */
#define ADC_STAT_EOSI0(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_STAT_EOSI0_SHIFT))&ADC_STAT_EOSI0_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_EOSI1_MASK                      (0x01UL << ADC_STAT_EOSI1_SHIFT)                    /*!< ADC0_STAT: EOSI1 Mask                   */
#define ADC_STAT_EOSI1_SHIFT                     12                                                  /*!< ADC0_STAT: EOSI1 Position               */
#define ADC_STAT_EOSI1(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_STAT_EOSI1_SHIFT))&ADC_STAT_EOSI1_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_CIP1_MASK                       (0x01UL << ADC_STAT_CIP1_SHIFT)                     /*!< ADC0_STAT: CIP1 Mask                    */
#define ADC_STAT_CIP1_SHIFT                      14                                                  /*!< ADC0_STAT: CIP1 Position                */
#define ADC_STAT_CIP1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_STAT_CIP1_SHIFT))&ADC_STAT_CIP1_MASK) /*!< ADC0_STAT                               */
#define ADC_STAT_CIP0_MASK                       (0x01UL << ADC_STAT_CIP0_SHIFT)                     /*!< ADC0_STAT: CIP0 Mask                    */
#define ADC_STAT_CIP0_SHIFT                      15                                                  /*!< ADC0_STAT: CIP0 Position                */
#define ADC_STAT_CIP0(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_STAT_CIP0_SHIFT))&ADC_STAT_CIP0_MASK) /*!< ADC0_STAT                               */
/* ------- RDY Bit Fields                           ------ */
#define ADC_RDY_RDY_MASK                         (0xFFFFUL << ADC_RDY_RDY_SHIFT)                     /*!< ADC0_RDY: RDY Mask                      */
#define ADC_RDY_RDY_SHIFT                        0                                                   /*!< ADC0_RDY: RDY Position                  */
#define ADC_RDY_RDY(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_RDY_RDY_SHIFT))&ADC_RDY_RDY_MASK) /*!< ADC0_RDY                                */
/* ------- LOLIMSTAT Bit Fields                     ------ */
#define ADC_LOLIMSTAT_LLS_MASK                   (0xFFFFUL << ADC_LOLIMSTAT_LLS_SHIFT)               /*!< ADC0_LOLIMSTAT: LLS Mask                */
#define ADC_LOLIMSTAT_LLS_SHIFT                  0                                                   /*!< ADC0_LOLIMSTAT: LLS Position            */
#define ADC_LOLIMSTAT_LLS(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_LOLIMSTAT_LLS_SHIFT))&ADC_LOLIMSTAT_LLS_MASK) /*!< ADC0_LOLIMSTAT                          */
/* ------- HILIMSTAT Bit Fields                     ------ */
#define ADC_HILIMSTAT_HLS_MASK                   (0xFFFFUL << ADC_HILIMSTAT_HLS_SHIFT)               /*!< ADC0_HILIMSTAT: HLS Mask                */
#define ADC_HILIMSTAT_HLS_SHIFT                  0                                                   /*!< ADC0_HILIMSTAT: HLS Position            */
#define ADC_HILIMSTAT_HLS(x)                     (((uint16_t)(((uint16_t)(x))<<ADC_HILIMSTAT_HLS_SHIFT))&ADC_HILIMSTAT_HLS_MASK) /*!< ADC0_HILIMSTAT                          */
/* ------- ZXSTAT Bit Fields                        ------ */
#define ADC_ZXSTAT_ZCS_MASK                      (0xFFFFUL << ADC_ZXSTAT_ZCS_SHIFT)                  /*!< ADC0_ZXSTAT: ZCS Mask                   */
#define ADC_ZXSTAT_ZCS_SHIFT                     0                                                   /*!< ADC0_ZXSTAT: ZCS Position               */
#define ADC_ZXSTAT_ZCS(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_ZXSTAT_ZCS_SHIFT))&ADC_ZXSTAT_ZCS_MASK) /*!< ADC0_ZXSTAT                             */
/* ------- RSLT Bit Fields                          ------ */
#define ADC_RSLT_RSLT_MASK                       (0xFFFUL << ADC_RSLT_RSLT_SHIFT)                    /*!< ADC0_RSLT: RSLT Mask                    */
#define ADC_RSLT_RSLT_SHIFT                      3                                                   /*!< ADC0_RSLT: RSLT Position                */
#define ADC_RSLT_RSLT(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_RSLT_RSLT_SHIFT))&ADC_RSLT_RSLT_MASK) /*!< ADC0_RSLT                               */
#define ADC_RSLT_SEXT_MASK                       (0x01UL << ADC_RSLT_SEXT_SHIFT)                     /*!< ADC0_RSLT: SEXT Mask                    */
#define ADC_RSLT_SEXT_SHIFT                      15                                                  /*!< ADC0_RSLT: SEXT Position                */
#define ADC_RSLT_SEXT(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_RSLT_SEXT_SHIFT))&ADC_RSLT_SEXT_MASK) /*!< ADC0_RSLT                               */
/* ------- LOLIM Bit Fields                         ------ */
#define ADC_LOLIM_LLMT_MASK                      (0xFFFUL << ADC_LOLIM_LLMT_SHIFT)                   /*!< ADC0_LOLIM: LLMT Mask                   */
#define ADC_LOLIM_LLMT_SHIFT                     3                                                   /*!< ADC0_LOLIM: LLMT Position               */
#define ADC_LOLIM_LLMT(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_LOLIM_LLMT_SHIFT))&ADC_LOLIM_LLMT_MASK) /*!< ADC0_LOLIM                              */
/* ------- HILIM Bit Fields                         ------ */
#define ADC_HILIM_HLMT_MASK                      (0xFFFUL << ADC_HILIM_HLMT_SHIFT)                   /*!< ADC0_HILIM: HLMT Mask                   */
#define ADC_HILIM_HLMT_SHIFT                     3                                                   /*!< ADC0_HILIM: HLMT Position               */
#define ADC_HILIM_HLMT(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_HILIM_HLMT_SHIFT))&ADC_HILIM_HLMT_MASK) /*!< ADC0_HILIM                              */
/* ------- OFFST Bit Fields                         ------ */
#define ADC_OFFST_OFFSET_MASK                    (0xFFFUL << ADC_OFFST_OFFSET_SHIFT)                 /*!< ADC0_OFFST: OFFSET Mask                 */
#define ADC_OFFST_OFFSET_SHIFT                   3                                                   /*!< ADC0_OFFST: OFFSET Position             */
#define ADC_OFFST_OFFSET(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_OFFST_OFFSET_SHIFT))&ADC_OFFST_OFFSET_MASK) /*!< ADC0_OFFST                              */
/* ------- PWR Bit Fields                           ------ */
#define ADC_PWR_PD0_MASK                         (0x01UL << ADC_PWR_PD0_SHIFT)                       /*!< ADC0_PWR: PD0 Mask                      */
#define ADC_PWR_PD0_SHIFT                        0                                                   /*!< ADC0_PWR: PD0 Position                  */
#define ADC_PWR_PD0(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_PWR_PD0_SHIFT))&ADC_PWR_PD0_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_PD1_MASK                         (0x01UL << ADC_PWR_PD1_SHIFT)                       /*!< ADC0_PWR: PD1 Mask                      */
#define ADC_PWR_PD1_SHIFT                        1                                                   /*!< ADC0_PWR: PD1 Position                  */
#define ADC_PWR_PD1(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_PWR_PD1_SHIFT))&ADC_PWR_PD1_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_APD_MASK                         (0x01UL << ADC_PWR_APD_SHIFT)                       /*!< ADC0_PWR: APD Mask                      */
#define ADC_PWR_APD_SHIFT                        3                                                   /*!< ADC0_PWR: APD Position                  */
#define ADC_PWR_APD(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_PWR_APD_SHIFT))&ADC_PWR_APD_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_PUDELAY_MASK                     (0x3FUL << ADC_PWR_PUDELAY_SHIFT)                   /*!< ADC0_PWR: PUDELAY Mask                  */
#define ADC_PWR_PUDELAY_SHIFT                    4                                                   /*!< ADC0_PWR: PUDELAY Position              */
#define ADC_PWR_PUDELAY(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR_PUDELAY_SHIFT))&ADC_PWR_PUDELAY_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_PSTS0_MASK                       (0x01UL << ADC_PWR_PSTS0_SHIFT)                     /*!< ADC0_PWR: PSTS0 Mask                    */
#define ADC_PWR_PSTS0_SHIFT                      10                                                  /*!< ADC0_PWR: PSTS0 Position                */
#define ADC_PWR_PSTS0(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_PWR_PSTS0_SHIFT))&ADC_PWR_PSTS0_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_PSTS1_MASK                       (0x01UL << ADC_PWR_PSTS1_SHIFT)                     /*!< ADC0_PWR: PSTS1 Mask                    */
#define ADC_PWR_PSTS1_SHIFT                      11                                                  /*!< ADC0_PWR: PSTS1 Position                */
#define ADC_PWR_PSTS1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_PWR_PSTS1_SHIFT))&ADC_PWR_PSTS1_MASK) /*!< ADC0_PWR                                */
#define ADC_PWR_ASB_MASK                         (0x01UL << ADC_PWR_ASB_SHIFT)                       /*!< ADC0_PWR: ASB Mask                      */
#define ADC_PWR_ASB_SHIFT                        15                                                  /*!< ADC0_PWR: ASB Position                  */
#define ADC_PWR_ASB(x)                           (((uint16_t)(((uint16_t)(x))<<ADC_PWR_ASB_SHIFT))&ADC_PWR_ASB_MASK) /*!< ADC0_PWR                                */
/* ------- CAL Bit Fields                           ------ */
#define ADC_CAL_SEL_VREFLO_A_MASK                (0x01UL << ADC_CAL_SEL_VREFLO_A_SHIFT)              /*!< ADC0_CAL: SEL_VREFLO_A Mask             */
#define ADC_CAL_SEL_VREFLO_A_SHIFT               12                                                  /*!< ADC0_CAL: SEL_VREFLO_A Position         */
#define ADC_CAL_SEL_VREFLO_A(x)                  (((uint16_t)(((uint16_t)(x))<<ADC_CAL_SEL_VREFLO_A_SHIFT))&ADC_CAL_SEL_VREFLO_A_MASK) /*!< ADC0_CAL                                */
#define ADC_CAL_SEL_VREFH_A_MASK                 (0x01UL << ADC_CAL_SEL_VREFH_A_SHIFT)               /*!< ADC0_CAL: SEL_VREFH_A Mask              */
#define ADC_CAL_SEL_VREFH_A_SHIFT                13                                                  /*!< ADC0_CAL: SEL_VREFH_A Position          */
#define ADC_CAL_SEL_VREFH_A(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CAL_SEL_VREFH_A_SHIFT))&ADC_CAL_SEL_VREFH_A_MASK) /*!< ADC0_CAL                                */
#define ADC_CAL_SEL_VREFLO_B_MASK                (0x01UL << ADC_CAL_SEL_VREFLO_B_SHIFT)              /*!< ADC0_CAL: SEL_VREFLO_B Mask             */
#define ADC_CAL_SEL_VREFLO_B_SHIFT               14                                                  /*!< ADC0_CAL: SEL_VREFLO_B Position         */
#define ADC_CAL_SEL_VREFLO_B(x)                  (((uint16_t)(((uint16_t)(x))<<ADC_CAL_SEL_VREFLO_B_SHIFT))&ADC_CAL_SEL_VREFLO_B_MASK) /*!< ADC0_CAL                                */
#define ADC_CAL_SEL_VREFH_B_MASK                 (0x01UL << ADC_CAL_SEL_VREFH_B_SHIFT)               /*!< ADC0_CAL: SEL_VREFH_B Mask              */
#define ADC_CAL_SEL_VREFH_B_SHIFT                15                                                  /*!< ADC0_CAL: SEL_VREFH_B Position          */
#define ADC_CAL_SEL_VREFH_B(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_CAL_SEL_VREFH_B_SHIFT))&ADC_CAL_SEL_VREFH_B_MASK) /*!< ADC0_CAL                                */
/* ------- GC1 Bit Fields                           ------ */
#define ADC_GC1_GAIN0_MASK                       (0x03UL << ADC_GC1_GAIN0_SHIFT)                     /*!< ADC0_GC1: GAIN0 Mask                    */
#define ADC_GC1_GAIN0_SHIFT                      0                                                   /*!< ADC0_GC1: GAIN0 Position                */
#define ADC_GC1_GAIN0(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN0_SHIFT))&ADC_GC1_GAIN0_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN1_MASK                       (0x03UL << ADC_GC1_GAIN1_SHIFT)                     /*!< ADC0_GC1: GAIN1 Mask                    */
#define ADC_GC1_GAIN1_SHIFT                      2                                                   /*!< ADC0_GC1: GAIN1 Position                */
#define ADC_GC1_GAIN1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN1_SHIFT))&ADC_GC1_GAIN1_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN2_MASK                       (0x03UL << ADC_GC1_GAIN2_SHIFT)                     /*!< ADC0_GC1: GAIN2 Mask                    */
#define ADC_GC1_GAIN2_SHIFT                      4                                                   /*!< ADC0_GC1: GAIN2 Position                */
#define ADC_GC1_GAIN2(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN2_SHIFT))&ADC_GC1_GAIN2_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN3_MASK                       (0x03UL << ADC_GC1_GAIN3_SHIFT)                     /*!< ADC0_GC1: GAIN3 Mask                    */
#define ADC_GC1_GAIN3_SHIFT                      6                                                   /*!< ADC0_GC1: GAIN3 Position                */
#define ADC_GC1_GAIN3(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN3_SHIFT))&ADC_GC1_GAIN3_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN4_MASK                       (0x03UL << ADC_GC1_GAIN4_SHIFT)                     /*!< ADC0_GC1: GAIN4 Mask                    */
#define ADC_GC1_GAIN4_SHIFT                      8                                                   /*!< ADC0_GC1: GAIN4 Position                */
#define ADC_GC1_GAIN4(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN4_SHIFT))&ADC_GC1_GAIN4_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN5_MASK                       (0x03UL << ADC_GC1_GAIN5_SHIFT)                     /*!< ADC0_GC1: GAIN5 Mask                    */
#define ADC_GC1_GAIN5_SHIFT                      10                                                  /*!< ADC0_GC1: GAIN5 Position                */
#define ADC_GC1_GAIN5(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN5_SHIFT))&ADC_GC1_GAIN5_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN6_MASK                       (0x03UL << ADC_GC1_GAIN6_SHIFT)                     /*!< ADC0_GC1: GAIN6 Mask                    */
#define ADC_GC1_GAIN6_SHIFT                      12                                                  /*!< ADC0_GC1: GAIN6 Position                */
#define ADC_GC1_GAIN6(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN6_SHIFT))&ADC_GC1_GAIN6_MASK) /*!< ADC0_GC1                                */
#define ADC_GC1_GAIN7_MASK                       (0x03UL << ADC_GC1_GAIN7_SHIFT)                     /*!< ADC0_GC1: GAIN7 Mask                    */
#define ADC_GC1_GAIN7_SHIFT                      14                                                  /*!< ADC0_GC1: GAIN7 Position                */
#define ADC_GC1_GAIN7(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC1_GAIN7_SHIFT))&ADC_GC1_GAIN7_MASK) /*!< ADC0_GC1                                */
/* ------- GC2 Bit Fields                           ------ */
#define ADC_GC2_GAIN8_MASK                       (0x03UL << ADC_GC2_GAIN8_SHIFT)                     /*!< ADC0_GC2: GAIN8 Mask                    */
#define ADC_GC2_GAIN8_SHIFT                      0                                                   /*!< ADC0_GC2: GAIN8 Position                */
