podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define ADC_GC2_GAIN8(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN8_SHIFT))&ADC_GC2_GAIN8_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN9_MASK                       (0x03UL << ADC_GC2_GAIN9_SHIFT)                     /*!< ADC0_GC2: GAIN9 Mask                    */
#define ADC_GC2_GAIN9_SHIFT                      2                                                   /*!< ADC0_GC2: GAIN9 Position                */
#define ADC_GC2_GAIN9(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN9_SHIFT))&ADC_GC2_GAIN9_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN10_MASK                      (0x03UL << ADC_GC2_GAIN10_SHIFT)                    /*!< ADC0_GC2: GAIN10 Mask                   */
#define ADC_GC2_GAIN10_SHIFT                     4                                                   /*!< ADC0_GC2: GAIN10 Position               */
#define ADC_GC2_GAIN10(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN10_SHIFT))&ADC_GC2_GAIN10_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN11_MASK                      (0x03UL << ADC_GC2_GAIN11_SHIFT)                    /*!< ADC0_GC2: GAIN11 Mask                   */
#define ADC_GC2_GAIN11_SHIFT                     6                                                   /*!< ADC0_GC2: GAIN11 Position               */
#define ADC_GC2_GAIN11(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN11_SHIFT))&ADC_GC2_GAIN11_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN12_MASK                      (0x03UL << ADC_GC2_GAIN12_SHIFT)                    /*!< ADC0_GC2: GAIN12 Mask                   */
#define ADC_GC2_GAIN12_SHIFT                     8                                                   /*!< ADC0_GC2: GAIN12 Position               */
#define ADC_GC2_GAIN12(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN12_SHIFT))&ADC_GC2_GAIN12_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN13_MASK                      (0x03UL << ADC_GC2_GAIN13_SHIFT)                    /*!< ADC0_GC2: GAIN13 Mask                   */
#define ADC_GC2_GAIN13_SHIFT                     10                                                  /*!< ADC0_GC2: GAIN13 Position               */
#define ADC_GC2_GAIN13(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN13_SHIFT))&ADC_GC2_GAIN13_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN14_MASK                      (0x03UL << ADC_GC2_GAIN14_SHIFT)                    /*!< ADC0_GC2: GAIN14 Mask                   */
#define ADC_GC2_GAIN14_SHIFT                     12                                                  /*!< ADC0_GC2: GAIN14 Position               */
#define ADC_GC2_GAIN14(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN14_SHIFT))&ADC_GC2_GAIN14_MASK) /*!< ADC0_GC2                                */
#define ADC_GC2_GAIN15_MASK                      (0x03UL << ADC_GC2_GAIN15_SHIFT)                    /*!< ADC0_GC2: GAIN15 Mask                   */
#define ADC_GC2_GAIN15_SHIFT                     14                                                  /*!< ADC0_GC2: GAIN15 Position               */
#define ADC_GC2_GAIN15(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN15_SHIFT))&ADC_GC2_GAIN15_MASK) /*!< ADC0_GC2                                */
/* ------- SCTRL Bit Fields                         ------ */
#define ADC_SCTRL_SC_MASK                        (0xFFFFUL << ADC_SCTRL_SC_SHIFT)                    /*!< ADC0_SCTRL: SC Mask                     */
#define ADC_SCTRL_SC_SHIFT                       0                                                   /*!< ADC0_SCTRL: SC Position                 */
#define ADC_SCTRL_SC(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_SCTRL_SC_SHIFT))&ADC_SCTRL_SC_MASK) /*!< ADC0_SCTRL                              */
/* ------- PWR2 Bit Fields                          ------ */
#define ADC_PWR2_SPEEDA_MASK                     (0x03UL << ADC_PWR2_SPEEDA_SHIFT)                   /*!< ADC0_PWR2: SPEEDA Mask                  */
#define ADC_PWR2_SPEEDA_SHIFT                    0                                                   /*!< ADC0_PWR2: SPEEDA Position              */
#define ADC_PWR2_SPEEDA(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_SPEEDA_SHIFT))&ADC_PWR2_SPEEDA_MASK) /*!< ADC0_PWR2                               */
#define ADC_PWR2_SPEEDB_MASK                     (0x03UL << ADC_PWR2_SPEEDB_SHIFT)                   /*!< ADC0_PWR2: SPEEDB Mask                  */
#define ADC_PWR2_SPEEDB_SHIFT                    2                                                   /*!< ADC0_PWR2: SPEEDB Position              */
#define ADC_PWR2_SPEEDB(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_SPEEDB_SHIFT))&ADC_PWR2_SPEEDB_MASK) /*!< ADC0_PWR2                               */
#define ADC_PWR2_DIV1_MASK                       (0x3FUL << ADC_PWR2_DIV1_SHIFT)                     /*!< ADC0_PWR2: DIV1 Mask                    */
#define ADC_PWR2_DIV1_SHIFT                      8                                                   /*!< ADC0_PWR2: DIV1 Position                */
#define ADC_PWR2_DIV1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_DIV1_SHIFT))&ADC_PWR2_DIV1_MASK) /*!< ADC0_PWR2                               */
/* ------- CTRL3 Bit Fields                         ------ */
#define ADC_CTRL3_SCNT0_MASK                     (0x07UL << ADC_CTRL3_SCNT0_SHIFT)                   /*!< ADC0_CTRL3: SCNT0 Mask                  */
#define ADC_CTRL3_SCNT0_SHIFT                    0                                                   /*!< ADC0_CTRL3: SCNT0 Position              */
#define ADC_CTRL3_SCNT0(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT0_SHIFT))&ADC_CTRL3_SCNT0_MASK) /*!< ADC0_CTRL3                              */
#define ADC_CTRL3_SCNT1_MASK                     (0x07UL << ADC_CTRL3_SCNT1_SHIFT)                   /*!< ADC0_CTRL3: SCNT1 Mask                  */
#define ADC_CTRL3_SCNT1_SHIFT                    3                                                   /*!< ADC0_CTRL3: SCNT1 Position              */
#define ADC_CTRL3_SCNT1(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT1_SHIFT))&ADC_CTRL3_SCNT1_MASK) /*!< ADC0_CTRL3                              */
#define ADC_CTRL3_DMASRC_MASK                    (0x01UL << ADC_CTRL3_DMASRC_SHIFT)                  /*!< ADC0_CTRL3: DMASRC Mask                 */
#define ADC_CTRL3_DMASRC_SHIFT                   6                                                   /*!< ADC0_CTRL3: DMASRC Position             */
#define ADC_CTRL3_DMASRC(x)                      (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_DMASRC_SHIFT))&ADC_CTRL3_DMASRC_MASK) /*!< ADC0_CTRL3                              */
/* ------- SCHLTEN Bit Fields                       ------ */
#define ADC_SCHLTEN_SCHLTEN_MASK                 (0xFFFFUL << ADC_SCHLTEN_SCHLTEN_SHIFT)             /*!< ADC0_SCHLTEN: SCHLTEN Mask              */
#define ADC_SCHLTEN_SCHLTEN_SHIFT                0                                                   /*!< ADC0_SCHLTEN: SCHLTEN Position          */
#define ADC_SCHLTEN_SCHLTEN(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_SCHLTEN_SCHLTEN_SHIFT))&ADC_SCHLTEN_SCHLTEN_MASK) /*!< ADC0_SCHLTEN                            */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

