podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define LLWU_PF2_WUF9_MASK                       (0x01UL << LLWU_PF2_WUF9_SHIFT)                     /*!< LLWU_PF2: WUF9 Mask                     */
#define LLWU_PF2_WUF9_SHIFT                      1                                                   /*!< LLWU_PF2: WUF9 Position                 */
#define LLWU_PF2_WUF9(x)                         (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF9_SHIFT))&LLWU_PF2_WUF9_MASK) /*!< LLWU_PF2                                */
#define LLWU_PF2_WUF10_MASK                      (0x01UL << LLWU_PF2_WUF10_SHIFT)                    /*!< LLWU_PF2: WUF10 Mask                    */
#define LLWU_PF2_WUF10_SHIFT                     2                                                   /*!< LLWU_PF2: WUF10 Position                */
#define LLWU_PF2_WUF10(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF10_SHIFT))&LLWU_PF2_WUF10_MASK) /*!< LLWU_PF2                                */
#define LLWU_PF2_WUF11_MASK                      (0x01UL << LLWU_PF2_WUF11_SHIFT)                    /*!< LLWU_PF2: WUF11 Mask                    */
#define LLWU_PF2_WUF11_SHIFT                     3                                                   /*!< LLWU_PF2: WUF11 Position                */
#define LLWU_PF2_WUF11(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF11_SHIFT))&LLWU_PF2_WUF11_MASK) /*!< LLWU_PF2                                */
#define LLWU_PF2_WUF12_MASK                      (0x01UL << LLWU_PF2_WUF12_SHIFT)                    /*!< LLWU_PF2: WUF12 Mask                    */
#define LLWU_PF2_WUF12_SHIFT                     4                                                   /*!< LLWU_PF2: WUF12 Position                */
#define LLWU_PF2_WUF12(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF12_SHIFT))&LLWU_PF2_WUF12_MASK) /*!< LLWU_PF2                                */
#define LLWU_PF2_WUF13_MASK                      (0x01UL << LLWU_PF2_WUF13_SHIFT)                    /*!< LLWU_PF2: WUF13 Mask                    */
#define LLWU_PF2_WUF13_SHIFT                     5                                                   /*!< LLWU_PF2: WUF13 Position                */
#define LLWU_PF2_WUF13(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF13_SHIFT))&LLWU_PF2_WUF13_MASK) /*!< LLWU_PF2                                */
#define LLWU_PF2_WUF14_MASK                      (0x01UL << LLWU_PF2_WUF14_SHIFT)                    /*!< LLWU_PF2: WUF14 Mask                    */
#define LLWU_PF2_WUF14_SHIFT                     6                                                   /*!< LLWU_PF2: WUF14 Position                */
#define LLWU_PF2_WUF14(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF14_SHIFT))&LLWU_PF2_WUF14_MASK) /*!< LLWU_PF2                                */
#define LLWU_PF2_WUF15_MASK                      (0x01UL << LLWU_PF2_WUF15_SHIFT)                    /*!< LLWU_PF2: WUF15 Mask                    */
#define LLWU_PF2_WUF15_SHIFT                     7                                                   /*!< LLWU_PF2: WUF15 Position                */
#define LLWU_PF2_WUF15(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF2_WUF15_SHIFT))&LLWU_PF2_WUF15_MASK) /*!< LLWU_PF2                                */
/* ------- PF3 Bit Fields                           ------ */
#define LLWU_PF3_WUF16_MASK                      (0x01UL << LLWU_PF3_WUF16_SHIFT)                    /*!< LLWU_PF3: WUF16 Mask                    */
#define LLWU_PF3_WUF16_SHIFT                     0                                                   /*!< LLWU_PF3: WUF16 Position                */
#define LLWU_PF3_WUF16(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF16_SHIFT))&LLWU_PF3_WUF16_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF17_MASK                      (0x01UL << LLWU_PF3_WUF17_SHIFT)                    /*!< LLWU_PF3: WUF17 Mask                    */
#define LLWU_PF3_WUF17_SHIFT                     1                                                   /*!< LLWU_PF3: WUF17 Position                */
#define LLWU_PF3_WUF17(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF17_SHIFT))&LLWU_PF3_WUF17_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF18_MASK                      (0x01UL << LLWU_PF3_WUF18_SHIFT)                    /*!< LLWU_PF3: WUF18 Mask                    */
#define LLWU_PF3_WUF18_SHIFT                     2                                                   /*!< LLWU_PF3: WUF18 Position                */
#define LLWU_PF3_WUF18(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF18_SHIFT))&LLWU_PF3_WUF18_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF19_MASK                      (0x01UL << LLWU_PF3_WUF19_SHIFT)                    /*!< LLWU_PF3: WUF19 Mask                    */
#define LLWU_PF3_WUF19_SHIFT                     3                                                   /*!< LLWU_PF3: WUF19 Position                */
#define LLWU_PF3_WUF19(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF19_SHIFT))&LLWU_PF3_WUF19_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF20_MASK                      (0x01UL << LLWU_PF3_WUF20_SHIFT)                    /*!< LLWU_PF3: WUF20 Mask                    */
#define LLWU_PF3_WUF20_SHIFT                     4                                                   /*!< LLWU_PF3: WUF20 Position                */
#define LLWU_PF3_WUF20(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF20_SHIFT))&LLWU_PF3_WUF20_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF21_MASK                      (0x01UL << LLWU_PF3_WUF21_SHIFT)                    /*!< LLWU_PF3: WUF21 Mask                    */
#define LLWU_PF3_WUF21_SHIFT                     5                                                   /*!< LLWU_PF3: WUF21 Position                */
#define LLWU_PF3_WUF21(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF21_SHIFT))&LLWU_PF3_WUF21_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF22_MASK                      (0x01UL << LLWU_PF3_WUF22_SHIFT)                    /*!< LLWU_PF3: WUF22 Mask                    */
#define LLWU_PF3_WUF22_SHIFT                     6                                                   /*!< LLWU_PF3: WUF22 Position                */
#define LLWU_PF3_WUF22(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF22_SHIFT))&LLWU_PF3_WUF22_MASK) /*!< LLWU_PF3                                */
#define LLWU_PF3_WUF23_MASK                      (0x01UL << LLWU_PF3_WUF23_SHIFT)                    /*!< LLWU_PF3: WUF23 Mask                    */
#define LLWU_PF3_WUF23_SHIFT                     7                                                   /*!< LLWU_PF3: WUF23 Position                */
#define LLWU_PF3_WUF23(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF3_WUF23_SHIFT))&LLWU_PF3_WUF23_MASK) /*!< LLWU_PF3                                */
/* ------- PF4 Bit Fields                           ------ */
#define LLWU_PF4_WUF24_MASK                      (0x01UL << LLWU_PF4_WUF24_SHIFT)                    /*!< LLWU_PF4: WUF24 Mask                    */
#define LLWU_PF4_WUF24_SHIFT                     0                                                   /*!< LLWU_PF4: WUF24 Position                */
#define LLWU_PF4_WUF24(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF24_SHIFT))&LLWU_PF4_WUF24_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF25_MASK                      (0x01UL << LLWU_PF4_WUF25_SHIFT)                    /*!< LLWU_PF4: WUF25 Mask                    */
#define LLWU_PF4_WUF25_SHIFT                     1                                                   /*!< LLWU_PF4: WUF25 Position                */
#define LLWU_PF4_WUF25(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF25_SHIFT))&LLWU_PF4_WUF25_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF26_MASK                      (0x01UL << LLWU_PF4_WUF26_SHIFT)                    /*!< LLWU_PF4: WUF26 Mask                    */
#define LLWU_PF4_WUF26_SHIFT                     2                                                   /*!< LLWU_PF4: WUF26 Position                */
#define LLWU_PF4_WUF26(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF26_SHIFT))&LLWU_PF4_WUF26_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF27_MASK                      (0x01UL << LLWU_PF4_WUF27_SHIFT)                    /*!< LLWU_PF4: WUF27 Mask                    */
#define LLWU_PF4_WUF27_SHIFT                     3                                                   /*!< LLWU_PF4: WUF27 Position                */
#define LLWU_PF4_WUF27(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF27_SHIFT))&LLWU_PF4_WUF27_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF28_MASK                      (0x01UL << LLWU_PF4_WUF28_SHIFT)                    /*!< LLWU_PF4: WUF28 Mask                    */
#define LLWU_PF4_WUF28_SHIFT                     4                                                   /*!< LLWU_PF4: WUF28 Position                */
#define LLWU_PF4_WUF28(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF28_SHIFT))&LLWU_PF4_WUF28_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF29_MASK                      (0x01UL << LLWU_PF4_WUF29_SHIFT)                    /*!< LLWU_PF4: WUF29 Mask                    */
#define LLWU_PF4_WUF29_SHIFT                     5                                                   /*!< LLWU_PF4: WUF29 Position                */
#define LLWU_PF4_WUF29(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF29_SHIFT))&LLWU_PF4_WUF29_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF30_MASK                      (0x01UL << LLWU_PF4_WUF30_SHIFT)                    /*!< LLWU_PF4: WUF30 Mask                    */
#define LLWU_PF4_WUF30_SHIFT                     6                                                   /*!< LLWU_PF4: WUF30 Position                */
#define LLWU_PF4_WUF30(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF30_SHIFT))&LLWU_PF4_WUF30_MASK) /*!< LLWU_PF4                                */
#define LLWU_PF4_WUF31_MASK                      (0x01UL << LLWU_PF4_WUF31_SHIFT)                    /*!< LLWU_PF4: WUF31 Mask                    */
#define LLWU_PF4_WUF31_SHIFT                     7                                                   /*!< LLWU_PF4: WUF31 Position                */
#define LLWU_PF4_WUF31(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_PF4_WUF31_SHIFT))&LLWU_PF4_WUF31_MASK) /*!< LLWU_PF4                                */
/* ------- MF5 Bit Fields                           ------ */
#define LLWU_MF5_MWUF0_MASK                      (0x01UL << LLWU_MF5_MWUF0_SHIFT)                    /*!< LLWU_MF5: MWUF0 Mask                    */
#define LLWU_MF5_MWUF0_SHIFT                     0                                                   /*!< LLWU_MF5: MWUF0 Position                */
#define LLWU_MF5_MWUF0(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF0_SHIFT))&LLWU_MF5_MWUF0_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF1_MASK                      (0x01UL << LLWU_MF5_MWUF1_SHIFT)                    /*!< LLWU_MF5: MWUF1 Mask                    */
#define LLWU_MF5_MWUF1_SHIFT                     1                                                   /*!< LLWU_MF5: MWUF1 Position                */
#define LLWU_MF5_MWUF1(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF1_SHIFT))&LLWU_MF5_MWUF1_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF2_MASK                      (0x01UL << LLWU_MF5_MWUF2_SHIFT)                    /*!< LLWU_MF5: MWUF2 Mask                    */
#define LLWU_MF5_MWUF2_SHIFT                     2                                                   /*!< LLWU_MF5: MWUF2 Position                */
#define LLWU_MF5_MWUF2(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF2_SHIFT))&LLWU_MF5_MWUF2_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF3_MASK                      (0x01UL << LLWU_MF5_MWUF3_SHIFT)                    /*!< LLWU_MF5: MWUF3 Mask                    */
#define LLWU_MF5_MWUF3_SHIFT                     3                                                   /*!< LLWU_MF5: MWUF3 Position                */
#define LLWU_MF5_MWUF3(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF3_SHIFT))&LLWU_MF5_MWUF3_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF4_MASK                      (0x01UL << LLWU_MF5_MWUF4_SHIFT)                    /*!< LLWU_MF5: MWUF4 Mask                    */
#define LLWU_MF5_MWUF4_SHIFT                     4                                                   /*!< LLWU_MF5: MWUF4 Position                */
#define LLWU_MF5_MWUF4(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF4_SHIFT))&LLWU_MF5_MWUF4_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF5_MASK                      (0x01UL << LLWU_MF5_MWUF5_SHIFT)                    /*!< LLWU_MF5: MWUF5 Mask                    */
#define LLWU_MF5_MWUF5_SHIFT                     5                                                   /*!< LLWU_MF5: MWUF5 Position                */
#define LLWU_MF5_MWUF5(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF5_SHIFT))&LLWU_MF5_MWUF5_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF6_MASK                      (0x01UL << LLWU_MF5_MWUF6_SHIFT)                    /*!< LLWU_MF5: MWUF6 Mask                    */
#define LLWU_MF5_MWUF6_SHIFT                     6                                                   /*!< LLWU_MF5: MWUF6 Position                */
#define LLWU_MF5_MWUF6(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF6_SHIFT))&LLWU_MF5_MWUF6_MASK) /*!< LLWU_MF5                                */
#define LLWU_MF5_MWUF7_MASK                      (0x01UL << LLWU_MF5_MWUF7_SHIFT)                    /*!< LLWU_MF5: MWUF7 Mask                    */
#define LLWU_MF5_MWUF7_SHIFT                     7                                                   /*!< LLWU_MF5: MWUF7 Position                */
#define LLWU_MF5_MWUF7(x)                        (((uint8_t)(((uint8_t)(x))<<LLWU_MF5_MWUF7_SHIFT))&LLWU_MF5_MWUF7_MASK) /*!< LLWU_MF5                                */
/* ------- FILT Bit Fields                          ------ */
#define LLWU_FILT_FILTSEL_MASK                   (0x1FUL << LLWU_FILT_FILTSEL_SHIFT)                 /*!< LLWU_FILT: FILTSEL Mask                 */
#define LLWU_FILT_FILTSEL_SHIFT                  0                                                   /*!< LLWU_FILT: FILTSEL Position             */
#define LLWU_FILT_FILTSEL(x)                     (((uint8_t)(((uint8_t)(x))<<LLWU_FILT_FILTSEL_SHIFT))&LLWU_FILT_FILTSEL_MASK) /*!< LLWU_FILT                               */
#define LLWU_FILT_FILTE_MASK                     (0x03UL << LLWU_FILT_FILTE_SHIFT)                   /*!< LLWU_FILT: FILTE Mask                   */
#define LLWU_FILT_FILTE_SHIFT                    5                                                   /*!< LLWU_FILT: FILTE Position               */
#define LLWU_FILT_FILTE(x)                       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT_FILTE_SHIFT))&LLWU_FILT_FILTE_MASK) /*!< LLWU_FILT                               */
#define LLWU_FILT_FILTF_MASK                     (0x01UL << LLWU_FILT_FILTF_SHIFT)                   /*!< LLWU_FILT: FILTF Mask                   */
#define LLWU_FILT_FILTF_SHIFT                    7                                                   /*!< LLWU_FILT: FILTF Position               */
#define LLWU_FILT_FILTF(x)                       (((uint8_t)(((uint8_t)(x))<<LLWU_FILT_FILTF_SHIFT))&LLWU_FILT_FILTF_MASK) /*!< LLWU_FILT                               */
/**
 * @} */ /* End group LLWU_Register_Masks_GROUP 
 */

/* LLWU - Peripheral instance base addresses */
#define LLWU_BasePtr                   0x4007C000UL //!< Peripheral base address
#define LLWU                           ((LLWU_Type *) LLWU_BasePtr) //!< Freescale base pointer
#define LLWU_BASE_PTR                  (LLWU) //!< Freescale style base pointer
/**
 * @} */ /* End group LLWU_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup LPTMR_Peripheral_access_layer_GROUP LPTMR Peripheral Access Layer
* @brief C Struct for LPTMR
* @{
*/

/* ================================================================================ */
/* ================           LPTMR0 (file:LPTMR0_0)               ================ */
/* ================================================================================ */

/**
 * @brief Low Power Timer
 */
/**
* @addtogroup LPTMR_structs_GROUP LPTMR struct
* @brief Struct for LPTMR
* @{
*/
typedef struct {                                /*       LPTMR0 Structure                                             */
   __IO uint32_t  CSR;                          /**< 0000: Control Status Register                                      */
   __IO uint32_t  PSR;                          /**< 0004: Prescale Register                                            */
   __IO uint32_t  CMR;                          /**< 0008: Compare Register                                             */
   __IO uint32_t  CNR;                          /**< 000C: Counter Register                                             */
} LPTMR_Type;

/**
 * @} */ /* End group LPTMR_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'LPTMR0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

