podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
/**
* @addtogroup PWMA_Register_Masks_GROUP PWMA Register Masks
* @brief Register Masks for PWMA
* @{
*/
/* ------- SM0CNT Bit Fields                        ------ */
#define PWMA_SM0CNT_CNT_MASK                     (0xFFFFUL << PWMA_SM0CNT_CNT_SHIFT)                 /*!< PWMA_SM0CNT: CNT Mask                   */
#define PWMA_SM0CNT_CNT_SHIFT                    0                                                   /*!< PWMA_SM0CNT: CNT Position               */
#define PWMA_SM0CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CNT_CNT_SHIFT))&PWMA_SM0CNT_CNT_MASK) /*!< PWMA_SM0CNT                             */
/* ------- SM0INIT Bit Fields                       ------ */
#define PWMA_SM0INIT_INIT_MASK                   (0xFFFFUL << PWMA_SM0INIT_INIT_SHIFT)               /*!< PWMA_SM0INIT: INIT Mask                 */
#define PWMA_SM0INIT_INIT_SHIFT                  0                                                   /*!< PWMA_SM0INIT: INIT Position             */
#define PWMA_SM0INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INIT_INIT_SHIFT))&PWMA_SM0INIT_INIT_MASK) /*!< PWMA_SM0INIT                            */
/* ------- SM0CTRL2 Bit Fields                      ------ */
#define PWMA_SM0CTRL2_CLK_SEL_MASK               (0x03UL << PWMA_SM0CTRL2_CLK_SEL_SHIFT)             /*!< PWMA_SM0CTRL2: CLK_SEL Mask             */
#define PWMA_SM0CTRL2_CLK_SEL_SHIFT              0                                                   /*!< PWMA_SM0CTRL2: CLK_SEL Position         */
#define PWMA_SM0CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_CLK_SEL_SHIFT))&PWMA_SM0CTRL2_CLK_SEL_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_RELOAD_SEL_MASK            (0x01UL << PWMA_SM0CTRL2_RELOAD_SEL_SHIFT)          /*!< PWMA_SM0CTRL2: RELOAD_SEL Mask          */
#define PWMA_SM0CTRL2_RELOAD_SEL_SHIFT           2                                                   /*!< PWMA_SM0CTRL2: RELOAD_SEL Position      */
#define PWMA_SM0CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_RELOAD_SEL_SHIFT))&PWMA_SM0CTRL2_RELOAD_SEL_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_FORCE_SEL_MASK             (0x07UL << PWMA_SM0CTRL2_FORCE_SEL_SHIFT)           /*!< PWMA_SM0CTRL2: FORCE_SEL Mask           */
#define PWMA_SM0CTRL2_FORCE_SEL_SHIFT            3                                                   /*!< PWMA_SM0CTRL2: FORCE_SEL Position       */
#define PWMA_SM0CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_FORCE_SEL_SHIFT))&PWMA_SM0CTRL2_FORCE_SEL_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_FORCE_MASK                 (0x01UL << PWMA_SM0CTRL2_FORCE_SHIFT)               /*!< PWMA_SM0CTRL2: FORCE Mask               */
#define PWMA_SM0CTRL2_FORCE_SHIFT                6                                                   /*!< PWMA_SM0CTRL2: FORCE Position           */
#define PWMA_SM0CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_FORCE_SHIFT))&PWMA_SM0CTRL2_FORCE_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_FRCEN_MASK                 (0x01UL << PWMA_SM0CTRL2_FRCEN_SHIFT)               /*!< PWMA_SM0CTRL2: FRCEN Mask               */
#define PWMA_SM0CTRL2_FRCEN_SHIFT                7                                                   /*!< PWMA_SM0CTRL2: FRCEN Position           */
#define PWMA_SM0CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_FRCEN_SHIFT))&PWMA_SM0CTRL2_FRCEN_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_INIT_SEL_MASK              (0x03UL << PWMA_SM0CTRL2_INIT_SEL_SHIFT)            /*!< PWMA_SM0CTRL2: INIT_SEL Mask            */
#define PWMA_SM0CTRL2_INIT_SEL_SHIFT             8                                                   /*!< PWMA_SM0CTRL2: INIT_SEL Position        */
#define PWMA_SM0CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_INIT_SEL_SHIFT))&PWMA_SM0CTRL2_INIT_SEL_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_PWMX_INIT_MASK             (0x01UL << PWMA_SM0CTRL2_PWMX_INIT_SHIFT)           /*!< PWMA_SM0CTRL2: PWMX_INIT Mask           */
#define PWMA_SM0CTRL2_PWMX_INIT_SHIFT            10                                                  /*!< PWMA_SM0CTRL2: PWMX_INIT Position       */
#define PWMA_SM0CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_PWMX_INIT_SHIFT))&PWMA_SM0CTRL2_PWMX_INIT_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_PWM45_INIT_MASK            (0x01UL << PWMA_SM0CTRL2_PWM45_INIT_SHIFT)          /*!< PWMA_SM0CTRL2: PWM45_INIT Mask          */
#define PWMA_SM0CTRL2_PWM45_INIT_SHIFT           11                                                  /*!< PWMA_SM0CTRL2: PWM45_INIT Position      */
#define PWMA_SM0CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_PWM45_INIT_SHIFT))&PWMA_SM0CTRL2_PWM45_INIT_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_PWM23_INIT_MASK            (0x01UL << PWMA_SM0CTRL2_PWM23_INIT_SHIFT)          /*!< PWMA_SM0CTRL2: PWM23_INIT Mask          */
#define PWMA_SM0CTRL2_PWM23_INIT_SHIFT           12                                                  /*!< PWMA_SM0CTRL2: PWM23_INIT Position      */
#define PWMA_SM0CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_PWM23_INIT_SHIFT))&PWMA_SM0CTRL2_PWM23_INIT_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_INDEP_MASK                 (0x01UL << PWMA_SM0CTRL2_INDEP_SHIFT)               /*!< PWMA_SM0CTRL2: INDEP Mask               */
#define PWMA_SM0CTRL2_INDEP_SHIFT                13                                                  /*!< PWMA_SM0CTRL2: INDEP Position           */
#define PWMA_SM0CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_INDEP_SHIFT))&PWMA_SM0CTRL2_INDEP_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_WAITEN_MASK                (0x01UL << PWMA_SM0CTRL2_WAITEN_SHIFT)              /*!< PWMA_SM0CTRL2: WAITEN Mask              */
#define PWMA_SM0CTRL2_WAITEN_SHIFT               14                                                  /*!< PWMA_SM0CTRL2: WAITEN Position          */
#define PWMA_SM0CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_WAITEN_SHIFT))&PWMA_SM0CTRL2_WAITEN_MASK) /*!< PWMA_SM0CTRL2                           */
#define PWMA_SM0CTRL2_DBGEN_MASK                 (0x01UL << PWMA_SM0CTRL2_DBGEN_SHIFT)               /*!< PWMA_SM0CTRL2: DBGEN Mask               */
#define PWMA_SM0CTRL2_DBGEN_SHIFT                15                                                  /*!< PWMA_SM0CTRL2: DBGEN Position           */
#define PWMA_SM0CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL2_DBGEN_SHIFT))&PWMA_SM0CTRL2_DBGEN_MASK) /*!< PWMA_SM0CTRL2                           */
/* ------- SM0CTRL Bit Fields                       ------ */
#define PWMA_SM0CTRL_DBLEN_MASK                  (0x01UL << PWMA_SM0CTRL_DBLEN_SHIFT)                /*!< PWMA_SM0CTRL: DBLEN Mask                */
#define PWMA_SM0CTRL_DBLEN_SHIFT                 0                                                   /*!< PWMA_SM0CTRL: DBLEN Position            */
#define PWMA_SM0CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_DBLEN_SHIFT))&PWMA_SM0CTRL_DBLEN_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_DBLX_MASK                   (0x01UL << PWMA_SM0CTRL_DBLX_SHIFT)                 /*!< PWMA_SM0CTRL: DBLX Mask                 */
#define PWMA_SM0CTRL_DBLX_SHIFT                  1                                                   /*!< PWMA_SM0CTRL: DBLX Position             */
#define PWMA_SM0CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_DBLX_SHIFT))&PWMA_SM0CTRL_DBLX_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_LDMOD_MASK                  (0x01UL << PWMA_SM0CTRL_LDMOD_SHIFT)                /*!< PWMA_SM0CTRL: LDMOD Mask                */
#define PWMA_SM0CTRL_LDMOD_SHIFT                 2                                                   /*!< PWMA_SM0CTRL: LDMOD Position            */
#define PWMA_SM0CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_LDMOD_SHIFT))&PWMA_SM0CTRL_LDMOD_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_PRSC_MASK                   (0x07UL << PWMA_SM0CTRL_PRSC_SHIFT)                 /*!< PWMA_SM0CTRL: PRSC Mask                 */
#define PWMA_SM0CTRL_PRSC_SHIFT                  4                                                   /*!< PWMA_SM0CTRL: PRSC Position             */
#define PWMA_SM0CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_PRSC_SHIFT))&PWMA_SM0CTRL_PRSC_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_DT_MASK                     (0x03UL << PWMA_SM0CTRL_DT_SHIFT)                   /*!< PWMA_SM0CTRL: DT Mask                   */
#define PWMA_SM0CTRL_DT_SHIFT                    8                                                   /*!< PWMA_SM0CTRL: DT Position               */
#define PWMA_SM0CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_DT_SHIFT))&PWMA_SM0CTRL_DT_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_FULL_MASK                   (0x01UL << PWMA_SM0CTRL_FULL_SHIFT)                 /*!< PWMA_SM0CTRL: FULL Mask                 */
#define PWMA_SM0CTRL_FULL_SHIFT                  10                                                  /*!< PWMA_SM0CTRL: FULL Position             */
#define PWMA_SM0CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_FULL_SHIFT))&PWMA_SM0CTRL_FULL_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_HALF_MASK                   (0x01UL << PWMA_SM0CTRL_HALF_SHIFT)                 /*!< PWMA_SM0CTRL: HALF Mask                 */
#define PWMA_SM0CTRL_HALF_SHIFT                  11                                                  /*!< PWMA_SM0CTRL: HALF Position             */
#define PWMA_SM0CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_HALF_SHIFT))&PWMA_SM0CTRL_HALF_MASK) /*!< PWMA_SM0CTRL                            */
#define PWMA_SM0CTRL_LDFQ_MASK                   (0x0FUL << PWMA_SM0CTRL_LDFQ_SHIFT)                 /*!< PWMA_SM0CTRL: LDFQ Mask                 */
#define PWMA_SM0CTRL_LDFQ_SHIFT                  12                                                  /*!< PWMA_SM0CTRL: LDFQ Position             */
#define PWMA_SM0CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CTRL_LDFQ_SHIFT))&PWMA_SM0CTRL_LDFQ_MASK) /*!< PWMA_SM0CTRL                            */
/* ------- SM0VAL0 Bit Fields                       ------ */
#define PWMA_SM0VAL0_VAL0_MASK                   (0xFFFFUL << PWMA_SM0VAL0_VAL0_SHIFT)               /*!< PWMA_SM0VAL0: VAL0 Mask                 */
#define PWMA_SM0VAL0_VAL0_SHIFT                  0                                                   /*!< PWMA_SM0VAL0: VAL0 Position             */
#define PWMA_SM0VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0VAL0_VAL0_SHIFT))&PWMA_SM0VAL0_VAL0_MASK) /*!< PWMA_SM0VAL0                            */
/* ------- SM0FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL1_FRACVAL1_MASK           (0x1FUL << PWMA_SM0FRACVAL1_FRACVAL1_SHIFT)         /*!< PWMA_SM0FRACVAL1: FRACVAL1 Mask         */
#define PWMA_SM0FRACVAL1_FRACVAL1_SHIFT          11                                                  /*!< PWMA_SM0FRACVAL1: FRACVAL1 Position     */
#define PWMA_SM0FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRACVAL1_FRACVAL1_SHIFT))&PWMA_SM0FRACVAL1_FRACVAL1_MASK) /*!< PWMA_SM0FRACVAL1                        */
/* ------- SM0VAL1 Bit Fields                       ------ */
#define PWMA_SM0VAL1_VAL1_MASK                   (0xFFFFUL << PWMA_SM0VAL1_VAL1_SHIFT)               /*!< PWMA_SM0VAL1: VAL1 Mask                 */
#define PWMA_SM0VAL1_VAL1_SHIFT                  0                                                   /*!< PWMA_SM0VAL1: VAL1 Position             */
#define PWMA_SM0VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0VAL1_VAL1_SHIFT))&PWMA_SM0VAL1_VAL1_MASK) /*!< PWMA_SM0VAL1                            */
/* ------- SM0FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL2_FRACVAL2_MASK           (0x1FUL << PWMA_SM0FRACVAL2_FRACVAL2_SHIFT)         /*!< PWMA_SM0FRACVAL2: FRACVAL2 Mask         */
#define PWMA_SM0FRACVAL2_FRACVAL2_SHIFT          11                                                  /*!< PWMA_SM0FRACVAL2: FRACVAL2 Position     */
#define PWMA_SM0FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRACVAL2_FRACVAL2_SHIFT))&PWMA_SM0FRACVAL2_FRACVAL2_MASK) /*!< PWMA_SM0FRACVAL2                        */
/* ------- SM0VAL2 Bit Fields                       ------ */
#define PWMA_SM0VAL2_VAL2_MASK                   (0xFFFFUL << PWMA_SM0VAL2_VAL2_SHIFT)               /*!< PWMA_SM0VAL2: VAL2 Mask                 */
#define PWMA_SM0VAL2_VAL2_SHIFT                  0                                                   /*!< PWMA_SM0VAL2: VAL2 Position             */
#define PWMA_SM0VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0VAL2_VAL2_SHIFT))&PWMA_SM0VAL2_VAL2_MASK) /*!< PWMA_SM0VAL2                            */
/* ------- SM0FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL3_FRACVAL3_MASK           (0x1FUL << PWMA_SM0FRACVAL3_FRACVAL3_SHIFT)         /*!< PWMA_SM0FRACVAL3: FRACVAL3 Mask         */
#define PWMA_SM0FRACVAL3_FRACVAL3_SHIFT          11                                                  /*!< PWMA_SM0FRACVAL3: FRACVAL3 Position     */
#define PWMA_SM0FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRACVAL3_FRACVAL3_SHIFT))&PWMA_SM0FRACVAL3_FRACVAL3_MASK) /*!< PWMA_SM0FRACVAL3                        */
/* ------- SM0VAL3 Bit Fields                       ------ */
#define PWMA_SM0VAL3_VAL3_MASK                   (0xFFFFUL << PWMA_SM0VAL3_VAL3_SHIFT)               /*!< PWMA_SM0VAL3: VAL3 Mask                 */
#define PWMA_SM0VAL3_VAL3_SHIFT                  0                                                   /*!< PWMA_SM0VAL3: VAL3 Position             */
#define PWMA_SM0VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0VAL3_VAL3_SHIFT))&PWMA_SM0VAL3_VAL3_MASK) /*!< PWMA_SM0VAL3                            */
/* ------- SM0FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL4_FRACVAL4_MASK           (0x1FUL << PWMA_SM0FRACVAL4_FRACVAL4_SHIFT)         /*!< PWMA_SM0FRACVAL4: FRACVAL4 Mask         */
#define PWMA_SM0FRACVAL4_FRACVAL4_SHIFT          11                                                  /*!< PWMA_SM0FRACVAL4: FRACVAL4 Position     */
#define PWMA_SM0FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRACVAL4_FRACVAL4_SHIFT))&PWMA_SM0FRACVAL4_FRACVAL4_MASK) /*!< PWMA_SM0FRACVAL4                        */
/* ------- SM0VAL4 Bit Fields                       ------ */
#define PWMA_SM0VAL4_VAL4_MASK                   (0xFFFFUL << PWMA_SM0VAL4_VAL4_SHIFT)               /*!< PWMA_SM0VAL4: VAL4 Mask                 */
#define PWMA_SM0VAL4_VAL4_SHIFT                  0                                                   /*!< PWMA_SM0VAL4: VAL4 Position             */
#define PWMA_SM0VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0VAL4_VAL4_SHIFT))&PWMA_SM0VAL4_VAL4_MASK) /*!< PWMA_SM0VAL4                            */
/* ------- SM0FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM0FRACVAL5_FRACVAL5_MASK           (0x1FUL << PWMA_SM0FRACVAL5_FRACVAL5_SHIFT)         /*!< PWMA_SM0FRACVAL5: FRACVAL5 Mask         */
#define PWMA_SM0FRACVAL5_FRACVAL5_SHIFT          11                                                  /*!< PWMA_SM0FRACVAL5: FRACVAL5 Position     */
#define PWMA_SM0FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRACVAL5_FRACVAL5_SHIFT))&PWMA_SM0FRACVAL5_FRACVAL5_MASK) /*!< PWMA_SM0FRACVAL5                        */
/* ------- SM0VAL5 Bit Fields                       ------ */
#define PWMA_SM0VAL5_VAL5_MASK                   (0xFFFFUL << PWMA_SM0VAL5_VAL5_SHIFT)               /*!< PWMA_SM0VAL5: VAL5 Mask                 */
#define PWMA_SM0VAL5_VAL5_SHIFT                  0                                                   /*!< PWMA_SM0VAL5: VAL5 Position             */
#define PWMA_SM0VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0VAL5_VAL5_SHIFT))&PWMA_SM0VAL5_VAL5_MASK) /*!< PWMA_SM0VAL5                            */
/* ------- SM0FRCTRL Bit Fields                     ------ */
#define PWMA_SM0FRCTRL_FRAC1_EN_MASK             (0x01UL << PWMA_SM0FRCTRL_FRAC1_EN_SHIFT)           /*!< PWMA_SM0FRCTRL: FRAC1_EN Mask           */
#define PWMA_SM0FRCTRL_FRAC1_EN_SHIFT            1                                                   /*!< PWMA_SM0FRCTRL: FRAC1_EN Position       */
#define PWMA_SM0FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRCTRL_FRAC1_EN_SHIFT))&PWMA_SM0FRCTRL_FRAC1_EN_MASK) /*!< PWMA_SM0FRCTRL                          */
#define PWMA_SM0FRCTRL_FRAC23_EN_MASK            (0x01UL << PWMA_SM0FRCTRL_FRAC23_EN_SHIFT)          /*!< PWMA_SM0FRCTRL: FRAC23_EN Mask          */
#define PWMA_SM0FRCTRL_FRAC23_EN_SHIFT           2                                                   /*!< PWMA_SM0FRCTRL: FRAC23_EN Position      */
#define PWMA_SM0FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRCTRL_FRAC23_EN_SHIFT))&PWMA_SM0FRCTRL_FRAC23_EN_MASK) /*!< PWMA_SM0FRCTRL                          */
#define PWMA_SM0FRCTRL_FRAC45_EN_MASK            (0x01UL << PWMA_SM0FRCTRL_FRAC45_EN_SHIFT)          /*!< PWMA_SM0FRCTRL: FRAC45_EN Mask          */
#define PWMA_SM0FRCTRL_FRAC45_EN_SHIFT           4                                                   /*!< PWMA_SM0FRCTRL: FRAC45_EN Position      */
#define PWMA_SM0FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRCTRL_FRAC45_EN_SHIFT))&PWMA_SM0FRCTRL_FRAC45_EN_MASK) /*!< PWMA_SM0FRCTRL                          */
#define PWMA_SM0FRCTRL_FRAC_PU_MASK              (0x01UL << PWMA_SM0FRCTRL_FRAC_PU_SHIFT)            /*!< PWMA_SM0FRCTRL: FRAC_PU Mask            */
#define PWMA_SM0FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM0FRCTRL: FRAC_PU Position        */
#define PWMA_SM0FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRCTRL_FRAC_PU_SHIFT))&PWMA_SM0FRCTRL_FRAC_PU_MASK) /*!< PWMA_SM0FRCTRL                          */
#define PWMA_SM0FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM0FRCTRL_TEST_SHIFT)               /*!< PWMA_SM0FRCTRL: TEST Mask               */
#define PWMA_SM0FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM0FRCTRL: TEST Position           */
#define PWMA_SM0FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0FRCTRL_TEST_SHIFT))&PWMA_SM0FRCTRL_TEST_MASK) /*!< PWMA_SM0FRCTRL                          */
/* ------- SM0OCTRL Bit Fields                      ------ */
#define PWMA_SM0OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM0OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM0OCTRL: PWMXFS Mask              */
#define PWMA_SM0OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM0OCTRL: PWMXFS Position          */
#define PWMA_SM0OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_PWMXFS_SHIFT))&PWMA_SM0OCTRL_PWMXFS_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM0OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM0OCTRL: PWMBFS Mask              */
#define PWMA_SM0OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM0OCTRL: PWMBFS Position          */
#define PWMA_SM0OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_PWMBFS_SHIFT))&PWMA_SM0OCTRL_PWMBFS_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM0OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM0OCTRL: PWMAFS Mask              */
#define PWMA_SM0OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM0OCTRL: PWMAFS Position          */
#define PWMA_SM0OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_PWMAFS_SHIFT))&PWMA_SM0OCTRL_PWMAFS_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_POLX_MASK                  (0x01UL << PWMA_SM0OCTRL_POLX_SHIFT)                /*!< PWMA_SM0OCTRL: POLX Mask                */
#define PWMA_SM0OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM0OCTRL: POLX Position            */
#define PWMA_SM0OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_POLX_SHIFT))&PWMA_SM0OCTRL_POLX_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_POLB_MASK                  (0x01UL << PWMA_SM0OCTRL_POLB_SHIFT)                /*!< PWMA_SM0OCTRL: POLB Mask                */
#define PWMA_SM0OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM0OCTRL: POLB Position            */
#define PWMA_SM0OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_POLB_SHIFT))&PWMA_SM0OCTRL_POLB_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_POLA_MASK                  (0x01UL << PWMA_SM0OCTRL_POLA_SHIFT)                /*!< PWMA_SM0OCTRL: POLA Mask                */
#define PWMA_SM0OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM0OCTRL: POLA Position            */
#define PWMA_SM0OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_POLA_SHIFT))&PWMA_SM0OCTRL_POLA_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM0OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM0OCTRL: PWMX_IN Mask             */
#define PWMA_SM0OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM0OCTRL: PWMX_IN Position         */
#define PWMA_SM0OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_PWMX_IN_SHIFT))&PWMA_SM0OCTRL_PWMX_IN_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM0OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM0OCTRL: PWMB_IN Mask             */
#define PWMA_SM0OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM0OCTRL: PWMB_IN Position         */
#define PWMA_SM0OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_PWMB_IN_SHIFT))&PWMA_SM0OCTRL_PWMB_IN_MASK) /*!< PWMA_SM0OCTRL                           */
#define PWMA_SM0OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM0OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM0OCTRL: PWMA_IN Mask             */
#define PWMA_SM0OCTRL_PWMA_IN_SHIFT              15                                                  /*!< PWMA_SM0OCTRL: PWMA_IN Position         */
#define PWMA_SM0OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0OCTRL_PWMA_IN_SHIFT))&PWMA_SM0OCTRL_PWMA_IN_MASK) /*!< PWMA_SM0OCTRL                           */
/* ------- SM0STS Bit Fields                        ------ */
#define PWMA_SM0STS_CMPF_MASK                    (0x3FUL << PWMA_SM0STS_CMPF_SHIFT)                  /*!< PWMA_SM0STS: CMPF Mask                  */
