podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define PWMA_SM0STS_CMPF_SHIFT                   0                                                   /*!< PWMA_SM0STS: CMPF Position              */
#define PWMA_SM0STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CMPF_SHIFT))&PWMA_SM0STS_CMPF_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_CFX0_MASK                    (0x01UL << PWMA_SM0STS_CFX0_SHIFT)                  /*!< PWMA_SM0STS: CFX0 Mask                  */
#define PWMA_SM0STS_CFX0_SHIFT                   6                                                   /*!< PWMA_SM0STS: CFX0 Position              */
#define PWMA_SM0STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CFX0_SHIFT))&PWMA_SM0STS_CFX0_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_CFX1_MASK                    (0x01UL << PWMA_SM0STS_CFX1_SHIFT)                  /*!< PWMA_SM0STS: CFX1 Mask                  */
#define PWMA_SM0STS_CFX1_SHIFT                   7                                                   /*!< PWMA_SM0STS: CFX1 Position              */
#define PWMA_SM0STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CFX1_SHIFT))&PWMA_SM0STS_CFX1_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_CFB0_MASK                    (0x01UL << PWMA_SM0STS_CFB0_SHIFT)                  /*!< PWMA_SM0STS: CFB0 Mask                  */
#define PWMA_SM0STS_CFB0_SHIFT                   8                                                   /*!< PWMA_SM0STS: CFB0 Position              */
#define PWMA_SM0STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CFB0_SHIFT))&PWMA_SM0STS_CFB0_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_CFB1_MASK                    (0x01UL << PWMA_SM0STS_CFB1_SHIFT)                  /*!< PWMA_SM0STS: CFB1 Mask                  */
#define PWMA_SM0STS_CFB1_SHIFT                   9                                                   /*!< PWMA_SM0STS: CFB1 Position              */
#define PWMA_SM0STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CFB1_SHIFT))&PWMA_SM0STS_CFB1_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_CFA0_MASK                    (0x01UL << PWMA_SM0STS_CFA0_SHIFT)                  /*!< PWMA_SM0STS: CFA0 Mask                  */
#define PWMA_SM0STS_CFA0_SHIFT                   10                                                  /*!< PWMA_SM0STS: CFA0 Position              */
#define PWMA_SM0STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CFA0_SHIFT))&PWMA_SM0STS_CFA0_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_CFA1_MASK                    (0x01UL << PWMA_SM0STS_CFA1_SHIFT)                  /*!< PWMA_SM0STS: CFA1 Mask                  */
#define PWMA_SM0STS_CFA1_SHIFT                   11                                                  /*!< PWMA_SM0STS: CFA1 Position              */
#define PWMA_SM0STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_CFA1_SHIFT))&PWMA_SM0STS_CFA1_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_RF_MASK                      (0x01UL << PWMA_SM0STS_RF_SHIFT)                    /*!< PWMA_SM0STS: RF Mask                    */
#define PWMA_SM0STS_RF_SHIFT                     12                                                  /*!< PWMA_SM0STS: RF Position                */
#define PWMA_SM0STS_RF(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_RF_SHIFT))&PWMA_SM0STS_RF_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_REF_MASK                     (0x01UL << PWMA_SM0STS_REF_SHIFT)                   /*!< PWMA_SM0STS: REF Mask                   */
#define PWMA_SM0STS_REF_SHIFT                    13                                                  /*!< PWMA_SM0STS: REF Position               */
#define PWMA_SM0STS_REF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_REF_SHIFT))&PWMA_SM0STS_REF_MASK) /*!< PWMA_SM0STS                             */
#define PWMA_SM0STS_RUF_MASK                     (0x01UL << PWMA_SM0STS_RUF_SHIFT)                   /*!< PWMA_SM0STS: RUF Mask                   */
#define PWMA_SM0STS_RUF_SHIFT                    14                                                  /*!< PWMA_SM0STS: RUF Position               */
#define PWMA_SM0STS_RUF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM0STS_RUF_SHIFT))&PWMA_SM0STS_RUF_MASK) /*!< PWMA_SM0STS                             */
/* ------- SM0INTEN Bit Fields                      ------ */
#define PWMA_SM0INTEN_CMPIE_MASK                 (0x3FUL << PWMA_SM0INTEN_CMPIE_SHIFT)               /*!< PWMA_SM0INTEN: CMPIE Mask               */
#define PWMA_SM0INTEN_CMPIE_SHIFT                0                                                   /*!< PWMA_SM0INTEN: CMPIE Position           */
#define PWMA_SM0INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CMPIE_SHIFT))&PWMA_SM0INTEN_CMPIE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_CX0IE_MASK                 (0x01UL << PWMA_SM0INTEN_CX0IE_SHIFT)               /*!< PWMA_SM0INTEN: CX0IE Mask               */
#define PWMA_SM0INTEN_CX0IE_SHIFT                6                                                   /*!< PWMA_SM0INTEN: CX0IE Position           */
#define PWMA_SM0INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CX0IE_SHIFT))&PWMA_SM0INTEN_CX0IE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_CX1IE_MASK                 (0x01UL << PWMA_SM0INTEN_CX1IE_SHIFT)               /*!< PWMA_SM0INTEN: CX1IE Mask               */
#define PWMA_SM0INTEN_CX1IE_SHIFT                7                                                   /*!< PWMA_SM0INTEN: CX1IE Position           */
#define PWMA_SM0INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CX1IE_SHIFT))&PWMA_SM0INTEN_CX1IE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_CB0IE_MASK                 (0x01UL << PWMA_SM0INTEN_CB0IE_SHIFT)               /*!< PWMA_SM0INTEN: CB0IE Mask               */
#define PWMA_SM0INTEN_CB0IE_SHIFT                8                                                   /*!< PWMA_SM0INTEN: CB0IE Position           */
#define PWMA_SM0INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CB0IE_SHIFT))&PWMA_SM0INTEN_CB0IE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_CB1IE_MASK                 (0x01UL << PWMA_SM0INTEN_CB1IE_SHIFT)               /*!< PWMA_SM0INTEN: CB1IE Mask               */
#define PWMA_SM0INTEN_CB1IE_SHIFT                9                                                   /*!< PWMA_SM0INTEN: CB1IE Position           */
#define PWMA_SM0INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CB1IE_SHIFT))&PWMA_SM0INTEN_CB1IE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_CA0IE_MASK                 (0x01UL << PWMA_SM0INTEN_CA0IE_SHIFT)               /*!< PWMA_SM0INTEN: CA0IE Mask               */
#define PWMA_SM0INTEN_CA0IE_SHIFT                10                                                  /*!< PWMA_SM0INTEN: CA0IE Position           */
#define PWMA_SM0INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CA0IE_SHIFT))&PWMA_SM0INTEN_CA0IE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_CA1IE_MASK                 (0x01UL << PWMA_SM0INTEN_CA1IE_SHIFT)               /*!< PWMA_SM0INTEN: CA1IE Mask               */
#define PWMA_SM0INTEN_CA1IE_SHIFT                11                                                  /*!< PWMA_SM0INTEN: CA1IE Position           */
#define PWMA_SM0INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_CA1IE_SHIFT))&PWMA_SM0INTEN_CA1IE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_RIE_MASK                   (0x01UL << PWMA_SM0INTEN_RIE_SHIFT)                 /*!< PWMA_SM0INTEN: RIE Mask                 */
#define PWMA_SM0INTEN_RIE_SHIFT                  12                                                  /*!< PWMA_SM0INTEN: RIE Position             */
#define PWMA_SM0INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_RIE_SHIFT))&PWMA_SM0INTEN_RIE_MASK) /*!< PWMA_SM0INTEN                           */
#define PWMA_SM0INTEN_REIE_MASK                  (0x01UL << PWMA_SM0INTEN_REIE_SHIFT)                /*!< PWMA_SM0INTEN: REIE Mask                */
#define PWMA_SM0INTEN_REIE_SHIFT                 13                                                  /*!< PWMA_SM0INTEN: REIE Position            */
#define PWMA_SM0INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0INTEN_REIE_SHIFT))&PWMA_SM0INTEN_REIE_MASK) /*!< PWMA_SM0INTEN                           */
/* ------- SM0DMAEN Bit Fields                      ------ */
#define PWMA_SM0DMAEN_CX0DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CX0DE_SHIFT)               /*!< PWMA_SM0DMAEN: CX0DE Mask               */
#define PWMA_SM0DMAEN_CX0DE_SHIFT                0                                                   /*!< PWMA_SM0DMAEN: CX0DE Position           */
#define PWMA_SM0DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CX0DE_SHIFT))&PWMA_SM0DMAEN_CX0DE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_CX1DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CX1DE_SHIFT)               /*!< PWMA_SM0DMAEN: CX1DE Mask               */
#define PWMA_SM0DMAEN_CX1DE_SHIFT                1                                                   /*!< PWMA_SM0DMAEN: CX1DE Position           */
#define PWMA_SM0DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CX1DE_SHIFT))&PWMA_SM0DMAEN_CX1DE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_CB0DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CB0DE_SHIFT)               /*!< PWMA_SM0DMAEN: CB0DE Mask               */
#define PWMA_SM0DMAEN_CB0DE_SHIFT                2                                                   /*!< PWMA_SM0DMAEN: CB0DE Position           */
#define PWMA_SM0DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CB0DE_SHIFT))&PWMA_SM0DMAEN_CB0DE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_CB1DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CB1DE_SHIFT)               /*!< PWMA_SM0DMAEN: CB1DE Mask               */
#define PWMA_SM0DMAEN_CB1DE_SHIFT                3                                                   /*!< PWMA_SM0DMAEN: CB1DE Position           */
#define PWMA_SM0DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CB1DE_SHIFT))&PWMA_SM0DMAEN_CB1DE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_CA0DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CA0DE_SHIFT)               /*!< PWMA_SM0DMAEN: CA0DE Mask               */
#define PWMA_SM0DMAEN_CA0DE_SHIFT                4                                                   /*!< PWMA_SM0DMAEN: CA0DE Position           */
#define PWMA_SM0DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CA0DE_SHIFT))&PWMA_SM0DMAEN_CA0DE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_CA1DE_MASK                 (0x01UL << PWMA_SM0DMAEN_CA1DE_SHIFT)               /*!< PWMA_SM0DMAEN: CA1DE Mask               */
#define PWMA_SM0DMAEN_CA1DE_SHIFT                5                                                   /*!< PWMA_SM0DMAEN: CA1DE Position           */
#define PWMA_SM0DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CA1DE_SHIFT))&PWMA_SM0DMAEN_CA1DE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_CAPTDE_MASK                (0x03UL << PWMA_SM0DMAEN_CAPTDE_SHIFT)              /*!< PWMA_SM0DMAEN: CAPTDE Mask              */
#define PWMA_SM0DMAEN_CAPTDE_SHIFT               6                                                   /*!< PWMA_SM0DMAEN: CAPTDE Position          */
#define PWMA_SM0DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_CAPTDE_SHIFT))&PWMA_SM0DMAEN_CAPTDE_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_FAND_MASK                  (0x01UL << PWMA_SM0DMAEN_FAND_SHIFT)                /*!< PWMA_SM0DMAEN: FAND Mask                */
#define PWMA_SM0DMAEN_FAND_SHIFT                 8                                                   /*!< PWMA_SM0DMAEN: FAND Position            */
#define PWMA_SM0DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_FAND_SHIFT))&PWMA_SM0DMAEN_FAND_MASK) /*!< PWMA_SM0DMAEN                           */
#define PWMA_SM0DMAEN_VALDE_MASK                 (0x01UL << PWMA_SM0DMAEN_VALDE_SHIFT)               /*!< PWMA_SM0DMAEN: VALDE Mask               */
#define PWMA_SM0DMAEN_VALDE_SHIFT                9                                                   /*!< PWMA_SM0DMAEN: VALDE Position           */
#define PWMA_SM0DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DMAEN_VALDE_SHIFT))&PWMA_SM0DMAEN_VALDE_MASK) /*!< PWMA_SM0DMAEN                           */
/* ------- SM0TCTRL Bit Fields                      ------ */
#define PWMA_SM0TCTRL_OUT_TRIG_EN_MASK           (0x3FUL << PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT)         /*!< PWMA_SM0TCTRL: OUT_TRIG_EN Mask         */
#define PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT          0                                                   /*!< PWMA_SM0TCTRL: OUT_TRIG_EN Position     */
#define PWMA_SM0TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_SM0TCTRL_OUT_TRIG_EN_MASK) /*!< PWMA_SM0TCTRL                           */
#define PWMA_SM0TCTRL_PWBOT1_MASK                (0x01UL << PWMA_SM0TCTRL_PWBOT1_SHIFT)              /*!< PWMA_SM0TCTRL: PWBOT1 Mask              */
#define PWMA_SM0TCTRL_PWBOT1_SHIFT               14                                                  /*!< PWMA_SM0TCTRL: PWBOT1 Position          */
#define PWMA_SM0TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0TCTRL_PWBOT1_SHIFT))&PWMA_SM0TCTRL_PWBOT1_MASK) /*!< PWMA_SM0TCTRL                           */
#define PWMA_SM0TCTRL_PWAOT0_MASK                (0x01UL << PWMA_SM0TCTRL_PWAOT0_SHIFT)              /*!< PWMA_SM0TCTRL: PWAOT0 Mask              */
#define PWMA_SM0TCTRL_PWAOT0_SHIFT               15                                                  /*!< PWMA_SM0TCTRL: PWAOT0 Position          */
#define PWMA_SM0TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0TCTRL_PWAOT0_SHIFT))&PWMA_SM0TCTRL_PWAOT0_MASK) /*!< PWMA_SM0TCTRL                           */
/* ------- SM0DISMAP0 Bit Fields                    ------ */
#define PWMA_SM0DISMAP0_DIS0A_MASK               (0x0FUL << PWMA_SM0DISMAP0_DIS0A_SHIFT)             /*!< PWMA_SM0DISMAP0: DIS0A Mask             */
#define PWMA_SM0DISMAP0_DIS0A_SHIFT              0                                                   /*!< PWMA_SM0DISMAP0: DIS0A Position         */
#define PWMA_SM0DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DISMAP0_DIS0A_SHIFT))&PWMA_SM0DISMAP0_DIS0A_MASK) /*!< PWMA_SM0DISMAP0                         */
#define PWMA_SM0DISMAP0_DIS0B_MASK               (0x0FUL << PWMA_SM0DISMAP0_DIS0B_SHIFT)             /*!< PWMA_SM0DISMAP0: DIS0B Mask             */
#define PWMA_SM0DISMAP0_DIS0B_SHIFT              4                                                   /*!< PWMA_SM0DISMAP0: DIS0B Position         */
#define PWMA_SM0DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DISMAP0_DIS0B_SHIFT))&PWMA_SM0DISMAP0_DIS0B_MASK) /*!< PWMA_SM0DISMAP0                         */
#define PWMA_SM0DISMAP0_DIS0X_MASK               (0x0FUL << PWMA_SM0DISMAP0_DIS0X_SHIFT)             /*!< PWMA_SM0DISMAP0: DIS0X Mask             */
#define PWMA_SM0DISMAP0_DIS0X_SHIFT              8                                                   /*!< PWMA_SM0DISMAP0: DIS0X Position         */
#define PWMA_SM0DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DISMAP0_DIS0X_SHIFT))&PWMA_SM0DISMAP0_DIS0X_MASK) /*!< PWMA_SM0DISMAP0                         */
/* ------- SM0DTCNT Bit Fields                      ------ */
#define PWMA_SM0DTCNT_DTCNT0_MASK                (0x7FFUL << PWMA_SM0DTCNT_DTCNT0_SHIFT)             /*!< PWMA_SM0DTCNT: DTCNT0 Mask              */
#define PWMA_SM0DTCNT_DTCNT0_SHIFT               0                                                   /*!< PWMA_SM0DTCNT: DTCNT0 Position          */
#define PWMA_SM0DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM0DTCNT_DTCNT0_SHIFT))&PWMA_SM0DTCNT_DTCNT0_MASK) /*!< PWMA_SM0DTCNT                           */
/* ------- SM0CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLA_ARMA_MASK              (0x01UL << PWMA_SM0CAPTCTRLA_ARMA_SHIFT)            /*!< PWMA_SM0CAPTCTRLA: ARMA Mask            */
#define PWMA_SM0CAPTCTRLA_ARMA_SHIFT             0                                                   /*!< PWMA_SM0CAPTCTRLA: ARMA Position        */
#define PWMA_SM0CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_ARMA_SHIFT))&PWMA_SM0CAPTCTRLA_ARMA_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_ONESHOTA_MASK          (0x01UL << PWMA_SM0CAPTCTRLA_ONESHOTA_SHIFT)        /*!< PWMA_SM0CAPTCTRLA: ONESHOTA Mask        */
#define PWMA_SM0CAPTCTRLA_ONESHOTA_SHIFT         1                                                   /*!< PWMA_SM0CAPTCTRLA: ONESHOTA Position    */
#define PWMA_SM0CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_ONESHOTA_SHIFT))&PWMA_SM0CAPTCTRLA_ONESHOTA_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_EDGA0_MASK             (0x03UL << PWMA_SM0CAPTCTRLA_EDGA0_SHIFT)           /*!< PWMA_SM0CAPTCTRLA: EDGA0 Mask           */
#define PWMA_SM0CAPTCTRLA_EDGA0_SHIFT            2                                                   /*!< PWMA_SM0CAPTCTRLA: EDGA0 Position       */
#define PWMA_SM0CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_EDGA0_SHIFT))&PWMA_SM0CAPTCTRLA_EDGA0_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_EDGA1_MASK             (0x03UL << PWMA_SM0CAPTCTRLA_EDGA1_SHIFT)           /*!< PWMA_SM0CAPTCTRLA: EDGA1 Mask           */
#define PWMA_SM0CAPTCTRLA_EDGA1_SHIFT            4                                                   /*!< PWMA_SM0CAPTCTRLA: EDGA1 Position       */
#define PWMA_SM0CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_EDGA1_SHIFT))&PWMA_SM0CAPTCTRLA_EDGA1_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_INP_SELA_MASK          (0x01UL << PWMA_SM0CAPTCTRLA_INP_SELA_SHIFT)        /*!< PWMA_SM0CAPTCTRLA: INP_SELA Mask        */
#define PWMA_SM0CAPTCTRLA_INP_SELA_SHIFT         6                                                   /*!< PWMA_SM0CAPTCTRLA: INP_SELA Position    */
#define PWMA_SM0CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_INP_SELA_SHIFT))&PWMA_SM0CAPTCTRLA_INP_SELA_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN_MASK        (0x01UL << PWMA_SM0CAPTCTRLA_EDGCNTA_EN_SHIFT)      /*!< PWMA_SM0CAPTCTRLA: EDGCNTA_EN Mask      */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN_SHIFT       7                                                   /*!< PWMA_SM0CAPTCTRLA: EDGCNTA_EN Position  */
#define PWMA_SM0CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_EDGCNTA_EN_SHIFT))&PWMA_SM0CAPTCTRLA_EDGCNTA_EN_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_CFAWM_MASK             (0x03UL << PWMA_SM0CAPTCTRLA_CFAWM_SHIFT)           /*!< PWMA_SM0CAPTCTRLA: CFAWM Mask           */
#define PWMA_SM0CAPTCTRLA_CFAWM_SHIFT            8                                                   /*!< PWMA_SM0CAPTCTRLA: CFAWM Position       */
#define PWMA_SM0CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_CFAWM_SHIFT))&PWMA_SM0CAPTCTRLA_CFAWM_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_CA0CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLA: CA0CNT Mask          */
#define PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT           10                                                  /*!< PWMA_SM0CAPTCTRLA: CA0CNT Position      */
#define PWMA_SM0CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_CA0CNT_SHIFT))&PWMA_SM0CAPTCTRLA_CA0CNT_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
#define PWMA_SM0CAPTCTRLA_CA1CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLA: CA1CNT Mask          */
#define PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT           13                                                  /*!< PWMA_SM0CAPTCTRLA: CA1CNT Position      */
#define PWMA_SM0CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLA_CA1CNT_SHIFT))&PWMA_SM0CAPTCTRLA_CA1CNT_MASK) /*!< PWMA_SM0CAPTCTRLA                       */
/* ------- SM0CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPA_EDGCMPA_MASK           (0xFFUL << PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT)         /*!< PWMA_SM0CAPTCOMPA: EDGCMPA Mask         */
#define PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT          0                                                   /*!< PWMA_SM0CAPTCOMPA: EDGCMPA Position     */
#define PWMA_SM0CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPA_EDGCMPA_SHIFT))&PWMA_SM0CAPTCOMPA_EDGCMPA_MASK) /*!< PWMA_SM0CAPTCOMPA                       */
#define PWMA_SM0CAPTCOMPA_EDGCNTA_MASK           (0xFFUL << PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT)         /*!< PWMA_SM0CAPTCOMPA: EDGCNTA Mask         */
#define PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT          8                                                   /*!< PWMA_SM0CAPTCOMPA: EDGCNTA Position     */
#define PWMA_SM0CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPA_EDGCNTA_SHIFT))&PWMA_SM0CAPTCOMPA_EDGCNTA_MASK) /*!< PWMA_SM0CAPTCOMPA                       */
/* ------- SM0CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLB_ARMB_MASK              (0x01UL << PWMA_SM0CAPTCTRLB_ARMB_SHIFT)            /*!< PWMA_SM0CAPTCTRLB: ARMB Mask            */
#define PWMA_SM0CAPTCTRLB_ARMB_SHIFT             0                                                   /*!< PWMA_SM0CAPTCTRLB: ARMB Position        */
#define PWMA_SM0CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_ARMB_SHIFT))&PWMA_SM0CAPTCTRLB_ARMB_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_ONESHOTB_MASK          (0x01UL << PWMA_SM0CAPTCTRLB_ONESHOTB_SHIFT)        /*!< PWMA_SM0CAPTCTRLB: ONESHOTB Mask        */
#define PWMA_SM0CAPTCTRLB_ONESHOTB_SHIFT         1                                                   /*!< PWMA_SM0CAPTCTRLB: ONESHOTB Position    */
#define PWMA_SM0CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_ONESHOTB_SHIFT))&PWMA_SM0CAPTCTRLB_ONESHOTB_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_EDGB0_MASK             (0x03UL << PWMA_SM0CAPTCTRLB_EDGB0_SHIFT)           /*!< PWMA_SM0CAPTCTRLB: EDGB0 Mask           */
#define PWMA_SM0CAPTCTRLB_EDGB0_SHIFT            2                                                   /*!< PWMA_SM0CAPTCTRLB: EDGB0 Position       */
#define PWMA_SM0CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_EDGB0_SHIFT))&PWMA_SM0CAPTCTRLB_EDGB0_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
