podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define PWMA_SM0CAPTCTRLB_EDGB1_MASK             (0x03UL << PWMA_SM0CAPTCTRLB_EDGB1_SHIFT)           /*!< PWMA_SM0CAPTCTRLB: EDGB1 Mask           */
#define PWMA_SM0CAPTCTRLB_EDGB1_SHIFT            4                                                   /*!< PWMA_SM0CAPTCTRLB: EDGB1 Position       */
#define PWMA_SM0CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_EDGB1_SHIFT))&PWMA_SM0CAPTCTRLB_EDGB1_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_INP_SELB_MASK          (0x01UL << PWMA_SM0CAPTCTRLB_INP_SELB_SHIFT)        /*!< PWMA_SM0CAPTCTRLB: INP_SELB Mask        */
#define PWMA_SM0CAPTCTRLB_INP_SELB_SHIFT         6                                                   /*!< PWMA_SM0CAPTCTRLB: INP_SELB Position    */
#define PWMA_SM0CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_INP_SELB_SHIFT))&PWMA_SM0CAPTCTRLB_INP_SELB_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN_MASK        (0x01UL << PWMA_SM0CAPTCTRLB_EDGCNTB_EN_SHIFT)      /*!< PWMA_SM0CAPTCTRLB: EDGCNTB_EN Mask      */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN_SHIFT       7                                                   /*!< PWMA_SM0CAPTCTRLB: EDGCNTB_EN Position  */
#define PWMA_SM0CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_EDGCNTB_EN_SHIFT))&PWMA_SM0CAPTCTRLB_EDGCNTB_EN_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_CFBWM_MASK             (0x03UL << PWMA_SM0CAPTCTRLB_CFBWM_SHIFT)           /*!< PWMA_SM0CAPTCTRLB: CFBWM Mask           */
#define PWMA_SM0CAPTCTRLB_CFBWM_SHIFT            8                                                   /*!< PWMA_SM0CAPTCTRLB: CFBWM Position       */
#define PWMA_SM0CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_CFBWM_SHIFT))&PWMA_SM0CAPTCTRLB_CFBWM_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_CB0CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLB: CB0CNT Mask          */
#define PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT           10                                                  /*!< PWMA_SM0CAPTCTRLB: CB0CNT Position      */
#define PWMA_SM0CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_CB0CNT_SHIFT))&PWMA_SM0CAPTCTRLB_CB0CNT_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
#define PWMA_SM0CAPTCTRLB_CB1CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLB: CB1CNT Mask          */
#define PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT           13                                                  /*!< PWMA_SM0CAPTCTRLB: CB1CNT Position      */
#define PWMA_SM0CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLB_CB1CNT_SHIFT))&PWMA_SM0CAPTCTRLB_CB1CNT_MASK) /*!< PWMA_SM0CAPTCTRLB                       */
/* ------- SM0CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPB_EDGCMPB_MASK           (0xFFUL << PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT)         /*!< PWMA_SM0CAPTCOMPB: EDGCMPB Mask         */
#define PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT          0                                                   /*!< PWMA_SM0CAPTCOMPB: EDGCMPB Position     */
#define PWMA_SM0CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_SM0CAPTCOMPB_EDGCMPB_MASK) /*!< PWMA_SM0CAPTCOMPB                       */
#define PWMA_SM0CAPTCOMPB_EDGCNTB_MASK           (0xFFUL << PWMA_SM0CAPTCOMPB_EDGCNTB_SHIFT)         /*!< PWMA_SM0CAPTCOMPB: EDGCNTB Mask         */
#define PWMA_SM0CAPTCOMPB_EDGCNTB_SHIFT          8                                                   /*!< PWMA_SM0CAPTCOMPB: EDGCNTB Position     */
#define PWMA_SM0CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_SM0CAPTCOMPB_EDGCNTB_MASK) /*!< PWMA_SM0CAPTCOMPB                       */
/* ------- SM0CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM0CAPTCTRLX_ARMX_MASK              (0x01UL << PWMA_SM0CAPTCTRLX_ARMX_SHIFT)            /*!< PWMA_SM0CAPTCTRLX: ARMX Mask            */
#define PWMA_SM0CAPTCTRLX_ARMX_SHIFT             0                                                   /*!< PWMA_SM0CAPTCTRLX: ARMX Position        */
#define PWMA_SM0CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_ARMX_SHIFT))&PWMA_SM0CAPTCTRLX_ARMX_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_ONESHOTX_MASK          (0x01UL << PWMA_SM0CAPTCTRLX_ONESHOTX_SHIFT)        /*!< PWMA_SM0CAPTCTRLX: ONESHOTX Mask        */
#define PWMA_SM0CAPTCTRLX_ONESHOTX_SHIFT         1                                                   /*!< PWMA_SM0CAPTCTRLX: ONESHOTX Position    */
#define PWMA_SM0CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_ONESHOTX_SHIFT))&PWMA_SM0CAPTCTRLX_ONESHOTX_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_EDGX0_MASK             (0x03UL << PWMA_SM0CAPTCTRLX_EDGX0_SHIFT)           /*!< PWMA_SM0CAPTCTRLX: EDGX0 Mask           */
#define PWMA_SM0CAPTCTRLX_EDGX0_SHIFT            2                                                   /*!< PWMA_SM0CAPTCTRLX: EDGX0 Position       */
#define PWMA_SM0CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_EDGX0_SHIFT))&PWMA_SM0CAPTCTRLX_EDGX0_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_EDGX1_MASK             (0x03UL << PWMA_SM0CAPTCTRLX_EDGX1_SHIFT)           /*!< PWMA_SM0CAPTCTRLX: EDGX1 Mask           */
#define PWMA_SM0CAPTCTRLX_EDGX1_SHIFT            4                                                   /*!< PWMA_SM0CAPTCTRLX: EDGX1 Position       */
#define PWMA_SM0CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_EDGX1_SHIFT))&PWMA_SM0CAPTCTRLX_EDGX1_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_INP_SELX_MASK          (0x01UL << PWMA_SM0CAPTCTRLX_INP_SELX_SHIFT)        /*!< PWMA_SM0CAPTCTRLX: INP_SELX Mask        */
#define PWMA_SM0CAPTCTRLX_INP_SELX_SHIFT         6                                                   /*!< PWMA_SM0CAPTCTRLX: INP_SELX Position    */
#define PWMA_SM0CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_INP_SELX_SHIFT))&PWMA_SM0CAPTCTRLX_INP_SELX_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_EDGCNTX_EN_MASK        (0x01UL << PWMA_SM0CAPTCTRLX_EDGCNTX_EN_SHIFT)      /*!< PWMA_SM0CAPTCTRLX: EDGCNTX_EN Mask      */
#define PWMA_SM0CAPTCTRLX_EDGCNTX_EN_SHIFT       7                                                   /*!< PWMA_SM0CAPTCTRLX: EDGCNTX_EN Position  */
#define PWMA_SM0CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_EDGCNTX_EN_SHIFT))&PWMA_SM0CAPTCTRLX_EDGCNTX_EN_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_CFXWM_MASK             (0x03UL << PWMA_SM0CAPTCTRLX_CFXWM_SHIFT)           /*!< PWMA_SM0CAPTCTRLX: CFXWM Mask           */
#define PWMA_SM0CAPTCTRLX_CFXWM_SHIFT            8                                                   /*!< PWMA_SM0CAPTCTRLX: CFXWM Position       */
#define PWMA_SM0CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_CFXWM_SHIFT))&PWMA_SM0CAPTCTRLX_CFXWM_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_CX0CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLX_CX0CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLX: CX0CNT Mask          */
#define PWMA_SM0CAPTCTRLX_CX0CNT_SHIFT           10                                                  /*!< PWMA_SM0CAPTCTRLX: CX0CNT Position      */
#define PWMA_SM0CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_CX0CNT_SHIFT))&PWMA_SM0CAPTCTRLX_CX0CNT_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
#define PWMA_SM0CAPTCTRLX_CX1CNT_MASK            (0x07UL << PWMA_SM0CAPTCTRLX_CX1CNT_SHIFT)          /*!< PWMA_SM0CAPTCTRLX: CX1CNT Mask          */
#define PWMA_SM0CAPTCTRLX_CX1CNT_SHIFT           13                                                  /*!< PWMA_SM0CAPTCTRLX: CX1CNT Position      */
#define PWMA_SM0CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCTRLX_CX1CNT_SHIFT))&PWMA_SM0CAPTCTRLX_CX1CNT_MASK) /*!< PWMA_SM0CAPTCTRLX                       */
/* ------- SM0CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM0CAPTCOMPX_EDGCMPX_MASK           (0xFFUL << PWMA_SM0CAPTCOMPX_EDGCMPX_SHIFT)         /*!< PWMA_SM0CAPTCOMPX: EDGCMPX Mask         */
#define PWMA_SM0CAPTCOMPX_EDGCMPX_SHIFT          0                                                   /*!< PWMA_SM0CAPTCOMPX: EDGCMPX Position     */
#define PWMA_SM0CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_SM0CAPTCOMPX_EDGCMPX_MASK) /*!< PWMA_SM0CAPTCOMPX                       */
#define PWMA_SM0CAPTCOMPX_EDGCNTX_MASK           (0xFFUL << PWMA_SM0CAPTCOMPX_EDGCNTX_SHIFT)         /*!< PWMA_SM0CAPTCOMPX: EDGCNTX Mask         */
#define PWMA_SM0CAPTCOMPX_EDGCNTX_SHIFT          8                                                   /*!< PWMA_SM0CAPTCOMPX: EDGCNTX Position     */
#define PWMA_SM0CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_SM0CAPTCOMPX_EDGCNTX_MASK) /*!< PWMA_SM0CAPTCOMPX                       */
/* ------- SM0CVAL0 Bit Fields                      ------ */
#define PWMA_SM0CVAL0_CAPTVAL0_MASK              (0xFFFFUL << PWMA_SM0CVAL0_CAPTVAL0_SHIFT)          /*!< PWMA_SM0CVAL0: CAPTVAL0 Mask            */
#define PWMA_SM0CVAL0_CAPTVAL0_SHIFT             0                                                   /*!< PWMA_SM0CVAL0: CAPTVAL0 Position        */
#define PWMA_SM0CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL0_CAPTVAL0_SHIFT))&PWMA_SM0CVAL0_CAPTVAL0_MASK) /*!< PWMA_SM0CVAL0                           */
/* ------- SM0CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL0CYC_CVAL0CYC_MASK           (0x0FUL << PWMA_SM0CVAL0CYC_CVAL0CYC_SHIFT)         /*!< PWMA_SM0CVAL0CYC: CVAL0CYC Mask         */
#define PWMA_SM0CVAL0CYC_CVAL0CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL0CYC: CVAL0CYC Position     */
#define PWMA_SM0CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_SM0CVAL0CYC_CVAL0CYC_MASK) /*!< PWMA_SM0CVAL0CYC                        */
/* ------- SM0CVAL1 Bit Fields                      ------ */
#define PWMA_SM0CVAL1_CAPTVAL1_MASK              (0xFFFFUL << PWMA_SM0CVAL1_CAPTVAL1_SHIFT)          /*!< PWMA_SM0CVAL1: CAPTVAL1 Mask            */
#define PWMA_SM0CVAL1_CAPTVAL1_SHIFT             0                                                   /*!< PWMA_SM0CVAL1: CAPTVAL1 Position        */
#define PWMA_SM0CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL1_CAPTVAL1_SHIFT))&PWMA_SM0CVAL1_CAPTVAL1_MASK) /*!< PWMA_SM0CVAL1                           */
/* ------- SM0CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL1CYC_CVAL1CYC_MASK           (0x0FUL << PWMA_SM0CVAL1CYC_CVAL1CYC_SHIFT)         /*!< PWMA_SM0CVAL1CYC: CVAL1CYC Mask         */
#define PWMA_SM0CVAL1CYC_CVAL1CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL1CYC: CVAL1CYC Position     */
#define PWMA_SM0CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_SM0CVAL1CYC_CVAL1CYC_MASK) /*!< PWMA_SM0CVAL1CYC                        */
/* ------- SM0CVAL2 Bit Fields                      ------ */
#define PWMA_SM0CVAL2_CAPTVAL2_MASK              (0xFFFFUL << PWMA_SM0CVAL2_CAPTVAL2_SHIFT)          /*!< PWMA_SM0CVAL2: CAPTVAL2 Mask            */
#define PWMA_SM0CVAL2_CAPTVAL2_SHIFT             0                                                   /*!< PWMA_SM0CVAL2: CAPTVAL2 Position        */
#define PWMA_SM0CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL2_CAPTVAL2_SHIFT))&PWMA_SM0CVAL2_CAPTVAL2_MASK) /*!< PWMA_SM0CVAL2                           */
/* ------- SM0CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL2CYC_CVAL2CYC_MASK           (0x0FUL << PWMA_SM0CVAL2CYC_CVAL2CYC_SHIFT)         /*!< PWMA_SM0CVAL2CYC: CVAL2CYC Mask         */
#define PWMA_SM0CVAL2CYC_CVAL2CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL2CYC: CVAL2CYC Position     */
#define PWMA_SM0CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_SM0CVAL2CYC_CVAL2CYC_MASK) /*!< PWMA_SM0CVAL2CYC                        */
/* ------- SM0CVAL3 Bit Fields                      ------ */
#define PWMA_SM0CVAL3_CAPTVAL3_MASK              (0xFFFFUL << PWMA_SM0CVAL3_CAPTVAL3_SHIFT)          /*!< PWMA_SM0CVAL3: CAPTVAL3 Mask            */
#define PWMA_SM0CVAL3_CAPTVAL3_SHIFT             0                                                   /*!< PWMA_SM0CVAL3: CAPTVAL3 Position        */
#define PWMA_SM0CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL3_CAPTVAL3_SHIFT))&PWMA_SM0CVAL3_CAPTVAL3_MASK) /*!< PWMA_SM0CVAL3                           */
/* ------- SM0CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL3CYC_CVAL3CYC_MASK           (0x0FUL << PWMA_SM0CVAL3CYC_CVAL3CYC_SHIFT)         /*!< PWMA_SM0CVAL3CYC: CVAL3CYC Mask         */
#define PWMA_SM0CVAL3CYC_CVAL3CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL3CYC: CVAL3CYC Position     */
#define PWMA_SM0CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_SM0CVAL3CYC_CVAL3CYC_MASK) /*!< PWMA_SM0CVAL3CYC                        */
/* ------- SM0CVAL4 Bit Fields                      ------ */
#define PWMA_SM0CVAL4_CAPTVAL4_MASK              (0xFFFFUL << PWMA_SM0CVAL4_CAPTVAL4_SHIFT)          /*!< PWMA_SM0CVAL4: CAPTVAL4 Mask            */
#define PWMA_SM0CVAL4_CAPTVAL4_SHIFT             0                                                   /*!< PWMA_SM0CVAL4: CAPTVAL4 Position        */
#define PWMA_SM0CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL4_CAPTVAL4_SHIFT))&PWMA_SM0CVAL4_CAPTVAL4_MASK) /*!< PWMA_SM0CVAL4                           */
/* ------- SM0CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL4CYC_CVAL4CYC_MASK           (0x0FUL << PWMA_SM0CVAL4CYC_CVAL4CYC_SHIFT)         /*!< PWMA_SM0CVAL4CYC: CVAL4CYC Mask         */
#define PWMA_SM0CVAL4CYC_CVAL4CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL4CYC: CVAL4CYC Position     */
#define PWMA_SM0CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_SM0CVAL4CYC_CVAL4CYC_MASK) /*!< PWMA_SM0CVAL4CYC                        */
/* ------- SM0CVAL5 Bit Fields                      ------ */
#define PWMA_SM0CVAL5_CAPTVAL5_MASK              (0xFFFFUL << PWMA_SM0CVAL5_CAPTVAL5_SHIFT)          /*!< PWMA_SM0CVAL5: CAPTVAL5 Mask            */
#define PWMA_SM0CVAL5_CAPTVAL5_SHIFT             0                                                   /*!< PWMA_SM0CVAL5: CAPTVAL5 Position        */
#define PWMA_SM0CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL5_CAPTVAL5_SHIFT))&PWMA_SM0CVAL5_CAPTVAL5_MASK) /*!< PWMA_SM0CVAL5                           */
/* ------- SM0CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM0CVAL5CYC_CVAL5CYC_MASK           (0x0FUL << PWMA_SM0CVAL5CYC_CVAL5CYC_SHIFT)         /*!< PWMA_SM0CVAL5CYC: CVAL5CYC Mask         */
#define PWMA_SM0CVAL5CYC_CVAL5CYC_SHIFT          0                                                   /*!< PWMA_SM0CVAL5CYC: CVAL5CYC Position     */
#define PWMA_SM0CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM0CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_SM0CVAL5CYC_CVAL5CYC_MASK) /*!< PWMA_SM0CVAL5CYC                        */
/* ------- SM1CNT Bit Fields                        ------ */
#define PWMA_SM1CNT_CNT_MASK                     (0xFFFFUL << PWMA_SM1CNT_CNT_SHIFT)                 /*!< PWMA_SM1CNT: CNT Mask                   */
#define PWMA_SM1CNT_CNT_SHIFT                    0                                                   /*!< PWMA_SM1CNT: CNT Position               */
#define PWMA_SM1CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CNT_CNT_SHIFT))&PWMA_SM1CNT_CNT_MASK) /*!< PWMA_SM1CNT                             */
/* ------- SM1INIT Bit Fields                       ------ */
#define PWMA_SM1INIT_INIT_MASK                   (0xFFFFUL << PWMA_SM1INIT_INIT_SHIFT)               /*!< PWMA_SM1INIT: INIT Mask                 */
#define PWMA_SM1INIT_INIT_SHIFT                  0                                                   /*!< PWMA_SM1INIT: INIT Position             */
#define PWMA_SM1INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INIT_INIT_SHIFT))&PWMA_SM1INIT_INIT_MASK) /*!< PWMA_SM1INIT                            */
/* ------- SM1CTRL2 Bit Fields                      ------ */
#define PWMA_SM1CTRL2_CLK_SEL_MASK               (0x03UL << PWMA_SM1CTRL2_CLK_SEL_SHIFT)             /*!< PWMA_SM1CTRL2: CLK_SEL Mask             */
#define PWMA_SM1CTRL2_CLK_SEL_SHIFT              0                                                   /*!< PWMA_SM1CTRL2: CLK_SEL Position         */
#define PWMA_SM1CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_CLK_SEL_SHIFT))&PWMA_SM1CTRL2_CLK_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_RELOAD_SEL_MASK            (0x01UL << PWMA_SM1CTRL2_RELOAD_SEL_SHIFT)          /*!< PWMA_SM1CTRL2: RELOAD_SEL Mask          */
#define PWMA_SM1CTRL2_RELOAD_SEL_SHIFT           2                                                   /*!< PWMA_SM1CTRL2: RELOAD_SEL Position      */
#define PWMA_SM1CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_RELOAD_SEL_SHIFT))&PWMA_SM1CTRL2_RELOAD_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_FORCE_SEL_MASK             (0x07UL << PWMA_SM1CTRL2_FORCE_SEL_SHIFT)           /*!< PWMA_SM1CTRL2: FORCE_SEL Mask           */
#define PWMA_SM1CTRL2_FORCE_SEL_SHIFT            3                                                   /*!< PWMA_SM1CTRL2: FORCE_SEL Position       */
#define PWMA_SM1CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_FORCE_SEL_SHIFT))&PWMA_SM1CTRL2_FORCE_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_FORCE_MASK                 (0x01UL << PWMA_SM1CTRL2_FORCE_SHIFT)               /*!< PWMA_SM1CTRL2: FORCE Mask               */
#define PWMA_SM1CTRL2_FORCE_SHIFT                6                                                   /*!< PWMA_SM1CTRL2: FORCE Position           */
#define PWMA_SM1CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_FORCE_SHIFT))&PWMA_SM1CTRL2_FORCE_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_FRCEN_MASK                 (0x01UL << PWMA_SM1CTRL2_FRCEN_SHIFT)               /*!< PWMA_SM1CTRL2: FRCEN Mask               */
#define PWMA_SM1CTRL2_FRCEN_SHIFT                7                                                   /*!< PWMA_SM1CTRL2: FRCEN Position           */
#define PWMA_SM1CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_FRCEN_SHIFT))&PWMA_SM1CTRL2_FRCEN_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_INIT_SEL_MASK              (0x03UL << PWMA_SM1CTRL2_INIT_SEL_SHIFT)            /*!< PWMA_SM1CTRL2: INIT_SEL Mask            */
#define PWMA_SM1CTRL2_INIT_SEL_SHIFT             8                                                   /*!< PWMA_SM1CTRL2: INIT_SEL Position        */
#define PWMA_SM1CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_INIT_SEL_SHIFT))&PWMA_SM1CTRL2_INIT_SEL_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_PWMX_INIT_MASK             (0x01UL << PWMA_SM1CTRL2_PWMX_INIT_SHIFT)           /*!< PWMA_SM1CTRL2: PWMX_INIT Mask           */
#define PWMA_SM1CTRL2_PWMX_INIT_SHIFT            10                                                  /*!< PWMA_SM1CTRL2: PWMX_INIT Position       */
#define PWMA_SM1CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_PWMX_INIT_SHIFT))&PWMA_SM1CTRL2_PWMX_INIT_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_PWM45_INIT_MASK            (0x01UL << PWMA_SM1CTRL2_PWM45_INIT_SHIFT)          /*!< PWMA_SM1CTRL2: PWM45_INIT Mask          */
#define PWMA_SM1CTRL2_PWM45_INIT_SHIFT           11                                                  /*!< PWMA_SM1CTRL2: PWM45_INIT Position      */
#define PWMA_SM1CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_PWM45_INIT_SHIFT))&PWMA_SM1CTRL2_PWM45_INIT_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_PWM23_INIT_MASK            (0x01UL << PWMA_SM1CTRL2_PWM23_INIT_SHIFT)          /*!< PWMA_SM1CTRL2: PWM23_INIT Mask          */
#define PWMA_SM1CTRL2_PWM23_INIT_SHIFT           12                                                  /*!< PWMA_SM1CTRL2: PWM23_INIT Position      */
#define PWMA_SM1CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_PWM23_INIT_SHIFT))&PWMA_SM1CTRL2_PWM23_INIT_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_INDEP_MASK                 (0x01UL << PWMA_SM1CTRL2_INDEP_SHIFT)               /*!< PWMA_SM1CTRL2: INDEP Mask               */
#define PWMA_SM1CTRL2_INDEP_SHIFT                13                                                  /*!< PWMA_SM1CTRL2: INDEP Position           */
#define PWMA_SM1CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_INDEP_SHIFT))&PWMA_SM1CTRL2_INDEP_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_WAITEN_MASK                (0x01UL << PWMA_SM1CTRL2_WAITEN_SHIFT)              /*!< PWMA_SM1CTRL2: WAITEN Mask              */
#define PWMA_SM1CTRL2_WAITEN_SHIFT               14                                                  /*!< PWMA_SM1CTRL2: WAITEN Position          */
#define PWMA_SM1CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_WAITEN_SHIFT))&PWMA_SM1CTRL2_WAITEN_MASK) /*!< PWMA_SM1CTRL2                           */
#define PWMA_SM1CTRL2_DBGEN_MASK                 (0x01UL << PWMA_SM1CTRL2_DBGEN_SHIFT)               /*!< PWMA_SM1CTRL2: DBGEN Mask               */
#define PWMA_SM1CTRL2_DBGEN_SHIFT                15                                                  /*!< PWMA_SM1CTRL2: DBGEN Position           */
#define PWMA_SM1CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL2_DBGEN_SHIFT))&PWMA_SM1CTRL2_DBGEN_MASK) /*!< PWMA_SM1CTRL2                           */
/* ------- SM1CTRL Bit Fields                       ------ */
#define PWMA_SM1CTRL_DBLEN_MASK                  (0x01UL << PWMA_SM1CTRL_DBLEN_SHIFT)                /*!< PWMA_SM1CTRL: DBLEN Mask                */
#define PWMA_SM1CTRL_DBLEN_SHIFT                 0                                                   /*!< PWMA_SM1CTRL: DBLEN Position            */
#define PWMA_SM1CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_DBLEN_SHIFT))&PWMA_SM1CTRL_DBLEN_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_DBLX_MASK                   (0x01UL << PWMA_SM1CTRL_DBLX_SHIFT)                 /*!< PWMA_SM1CTRL: DBLX Mask                 */
#define PWMA_SM1CTRL_DBLX_SHIFT                  1                                                   /*!< PWMA_SM1CTRL: DBLX Position             */
