podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define PWMA_SM1INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CA1IE_SHIFT))&PWMA_SM1INTEN_CA1IE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_RIE_MASK                   (0x01UL << PWMA_SM1INTEN_RIE_SHIFT)                 /*!< PWMA_SM1INTEN: RIE Mask                 */
#define PWMA_SM1INTEN_RIE_SHIFT                  12                                                  /*!< PWMA_SM1INTEN: RIE Position             */
#define PWMA_SM1INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_RIE_SHIFT))&PWMA_SM1INTEN_RIE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_REIE_MASK                  (0x01UL << PWMA_SM1INTEN_REIE_SHIFT)                /*!< PWMA_SM1INTEN: REIE Mask                */
#define PWMA_SM1INTEN_REIE_SHIFT                 13                                                  /*!< PWMA_SM1INTEN: REIE Position            */
#define PWMA_SM1INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_REIE_SHIFT))&PWMA_SM1INTEN_REIE_MASK) /*!< PWMA_SM1INTEN                           */
/* ------- SM1DMAEN Bit Fields                      ------ */
#define PWMA_SM1DMAEN_CX0DE_MASK                 (0x01UL << PWMA_SM1DMAEN_CX0DE_SHIFT)               /*!< PWMA_SM1DMAEN: CX0DE Mask               */
#define PWMA_SM1DMAEN_CX0DE_SHIFT                0                                                   /*!< PWMA_SM1DMAEN: CX0DE Position           */
#define PWMA_SM1DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CX0DE_SHIFT))&PWMA_SM1DMAEN_CX0DE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_CX1DE_MASK                 (0x01UL << PWMA_SM1DMAEN_CX1DE_SHIFT)               /*!< PWMA_SM1DMAEN: CX1DE Mask               */
#define PWMA_SM1DMAEN_CX1DE_SHIFT                1                                                   /*!< PWMA_SM1DMAEN: CX1DE Position           */
#define PWMA_SM1DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CX1DE_SHIFT))&PWMA_SM1DMAEN_CX1DE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_CB0DE_MASK                 (0x01UL << PWMA_SM1DMAEN_CB0DE_SHIFT)               /*!< PWMA_SM1DMAEN: CB0DE Mask               */
#define PWMA_SM1DMAEN_CB0DE_SHIFT                2                                                   /*!< PWMA_SM1DMAEN: CB0DE Position           */
#define PWMA_SM1DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CB0DE_SHIFT))&PWMA_SM1DMAEN_CB0DE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_CB1DE_MASK                 (0x01UL << PWMA_SM1DMAEN_CB1DE_SHIFT)               /*!< PWMA_SM1DMAEN: CB1DE Mask               */
#define PWMA_SM1DMAEN_CB1DE_SHIFT                3                                                   /*!< PWMA_SM1DMAEN: CB1DE Position           */
#define PWMA_SM1DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CB1DE_SHIFT))&PWMA_SM1DMAEN_CB1DE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_CA0DE_MASK                 (0x01UL << PWMA_SM1DMAEN_CA0DE_SHIFT)               /*!< PWMA_SM1DMAEN: CA0DE Mask               */
#define PWMA_SM1DMAEN_CA0DE_SHIFT                4                                                   /*!< PWMA_SM1DMAEN: CA0DE Position           */
#define PWMA_SM1DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CA0DE_SHIFT))&PWMA_SM1DMAEN_CA0DE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_CA1DE_MASK                 (0x01UL << PWMA_SM1DMAEN_CA1DE_SHIFT)               /*!< PWMA_SM1DMAEN: CA1DE Mask               */
#define PWMA_SM1DMAEN_CA1DE_SHIFT                5                                                   /*!< PWMA_SM1DMAEN: CA1DE Position           */
#define PWMA_SM1DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CA1DE_SHIFT))&PWMA_SM1DMAEN_CA1DE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_CAPTDE_MASK                (0x03UL << PWMA_SM1DMAEN_CAPTDE_SHIFT)              /*!< PWMA_SM1DMAEN: CAPTDE Mask              */
#define PWMA_SM1DMAEN_CAPTDE_SHIFT               6                                                   /*!< PWMA_SM1DMAEN: CAPTDE Position          */
#define PWMA_SM1DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_CAPTDE_SHIFT))&PWMA_SM1DMAEN_CAPTDE_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_FAND_MASK                  (0x01UL << PWMA_SM1DMAEN_FAND_SHIFT)                /*!< PWMA_SM1DMAEN: FAND Mask                */
#define PWMA_SM1DMAEN_FAND_SHIFT                 8                                                   /*!< PWMA_SM1DMAEN: FAND Position            */
#define PWMA_SM1DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_FAND_SHIFT))&PWMA_SM1DMAEN_FAND_MASK) /*!< PWMA_SM1DMAEN                           */
#define PWMA_SM1DMAEN_VALDE_MASK                 (0x01UL << PWMA_SM1DMAEN_VALDE_SHIFT)               /*!< PWMA_SM1DMAEN: VALDE Mask               */
#define PWMA_SM1DMAEN_VALDE_SHIFT                9                                                   /*!< PWMA_SM1DMAEN: VALDE Position           */
#define PWMA_SM1DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DMAEN_VALDE_SHIFT))&PWMA_SM1DMAEN_VALDE_MASK) /*!< PWMA_SM1DMAEN                           */
/* ------- SM1TCTRL Bit Fields                      ------ */
#define PWMA_SM1TCTRL_OUT_TRIG_EN_MASK           (0x3FUL << PWMA_SM1TCTRL_OUT_TRIG_EN_SHIFT)         /*!< PWMA_SM1TCTRL: OUT_TRIG_EN Mask         */
#define PWMA_SM1TCTRL_OUT_TRIG_EN_SHIFT          0                                                   /*!< PWMA_SM1TCTRL: OUT_TRIG_EN Position     */
#define PWMA_SM1TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_SM1TCTRL_OUT_TRIG_EN_MASK) /*!< PWMA_SM1TCTRL                           */
#define PWMA_SM1TCTRL_PWBOT1_MASK                (0x01UL << PWMA_SM1TCTRL_PWBOT1_SHIFT)              /*!< PWMA_SM1TCTRL: PWBOT1 Mask              */
#define PWMA_SM1TCTRL_PWBOT1_SHIFT               14                                                  /*!< PWMA_SM1TCTRL: PWBOT1 Position          */
#define PWMA_SM1TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1TCTRL_PWBOT1_SHIFT))&PWMA_SM1TCTRL_PWBOT1_MASK) /*!< PWMA_SM1TCTRL                           */
#define PWMA_SM1TCTRL_PWAOT0_MASK                (0x01UL << PWMA_SM1TCTRL_PWAOT0_SHIFT)              /*!< PWMA_SM1TCTRL: PWAOT0 Mask              */
#define PWMA_SM1TCTRL_PWAOT0_SHIFT               15                                                  /*!< PWMA_SM1TCTRL: PWAOT0 Position          */
#define PWMA_SM1TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1TCTRL_PWAOT0_SHIFT))&PWMA_SM1TCTRL_PWAOT0_MASK) /*!< PWMA_SM1TCTRL                           */
/* ------- SM1DISMAP0 Bit Fields                    ------ */
#define PWMA_SM1DISMAP0_DIS0A_MASK               (0x0FUL << PWMA_SM1DISMAP0_DIS0A_SHIFT)             /*!< PWMA_SM1DISMAP0: DIS0A Mask             */
#define PWMA_SM1DISMAP0_DIS0A_SHIFT              0                                                   /*!< PWMA_SM1DISMAP0: DIS0A Position         */
#define PWMA_SM1DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DISMAP0_DIS0A_SHIFT))&PWMA_SM1DISMAP0_DIS0A_MASK) /*!< PWMA_SM1DISMAP0                         */
#define PWMA_SM1DISMAP0_DIS0B_MASK               (0x0FUL << PWMA_SM1DISMAP0_DIS0B_SHIFT)             /*!< PWMA_SM1DISMAP0: DIS0B Mask             */
#define PWMA_SM1DISMAP0_DIS0B_SHIFT              4                                                   /*!< PWMA_SM1DISMAP0: DIS0B Position         */
#define PWMA_SM1DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DISMAP0_DIS0B_SHIFT))&PWMA_SM1DISMAP0_DIS0B_MASK) /*!< PWMA_SM1DISMAP0                         */
#define PWMA_SM1DISMAP0_DIS0X_MASK               (0x0FUL << PWMA_SM1DISMAP0_DIS0X_SHIFT)             /*!< PWMA_SM1DISMAP0: DIS0X Mask             */
#define PWMA_SM1DISMAP0_DIS0X_SHIFT              8                                                   /*!< PWMA_SM1DISMAP0: DIS0X Position         */
#define PWMA_SM1DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DISMAP0_DIS0X_SHIFT))&PWMA_SM1DISMAP0_DIS0X_MASK) /*!< PWMA_SM1DISMAP0                         */
/* ------- SM1DTCNT Bit Fields                      ------ */
#define PWMA_SM1DTCNT_DTCNT0_MASK                (0x7FFUL << PWMA_SM1DTCNT_DTCNT0_SHIFT)             /*!< PWMA_SM1DTCNT: DTCNT0 Mask              */
#define PWMA_SM1DTCNT_DTCNT0_SHIFT               0                                                   /*!< PWMA_SM1DTCNT: DTCNT0 Position          */
#define PWMA_SM1DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1DTCNT_DTCNT0_SHIFT))&PWMA_SM1DTCNT_DTCNT0_MASK) /*!< PWMA_SM1DTCNT                           */
/* ------- SM1CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM1CAPTCTRLA_ARMA_MASK              (0x01UL << PWMA_SM1CAPTCTRLA_ARMA_SHIFT)            /*!< PWMA_SM1CAPTCTRLA: ARMA Mask            */
#define PWMA_SM1CAPTCTRLA_ARMA_SHIFT             0                                                   /*!< PWMA_SM1CAPTCTRLA: ARMA Position        */
#define PWMA_SM1CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_ARMA_SHIFT))&PWMA_SM1CAPTCTRLA_ARMA_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_ONESHOTA_MASK          (0x01UL << PWMA_SM1CAPTCTRLA_ONESHOTA_SHIFT)        /*!< PWMA_SM1CAPTCTRLA: ONESHOTA Mask        */
#define PWMA_SM1CAPTCTRLA_ONESHOTA_SHIFT         1                                                   /*!< PWMA_SM1CAPTCTRLA: ONESHOTA Position    */
#define PWMA_SM1CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_ONESHOTA_SHIFT))&PWMA_SM1CAPTCTRLA_ONESHOTA_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_EDGA0_MASK             (0x03UL << PWMA_SM1CAPTCTRLA_EDGA0_SHIFT)           /*!< PWMA_SM1CAPTCTRLA: EDGA0 Mask           */
#define PWMA_SM1CAPTCTRLA_EDGA0_SHIFT            2                                                   /*!< PWMA_SM1CAPTCTRLA: EDGA0 Position       */
#define PWMA_SM1CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_EDGA0_SHIFT))&PWMA_SM1CAPTCTRLA_EDGA0_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_EDGA1_MASK             (0x03UL << PWMA_SM1CAPTCTRLA_EDGA1_SHIFT)           /*!< PWMA_SM1CAPTCTRLA: EDGA1 Mask           */
#define PWMA_SM1CAPTCTRLA_EDGA1_SHIFT            4                                                   /*!< PWMA_SM1CAPTCTRLA: EDGA1 Position       */
#define PWMA_SM1CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_EDGA1_SHIFT))&PWMA_SM1CAPTCTRLA_EDGA1_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_INP_SELA_MASK          (0x01UL << PWMA_SM1CAPTCTRLA_INP_SELA_SHIFT)        /*!< PWMA_SM1CAPTCTRLA: INP_SELA Mask        */
#define PWMA_SM1CAPTCTRLA_INP_SELA_SHIFT         6                                                   /*!< PWMA_SM1CAPTCTRLA: INP_SELA Position    */
#define PWMA_SM1CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_INP_SELA_SHIFT))&PWMA_SM1CAPTCTRLA_INP_SELA_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_EDGCNTA_EN_MASK        (0x01UL << PWMA_SM1CAPTCTRLA_EDGCNTA_EN_SHIFT)      /*!< PWMA_SM1CAPTCTRLA: EDGCNTA_EN Mask      */
#define PWMA_SM1CAPTCTRLA_EDGCNTA_EN_SHIFT       7                                                   /*!< PWMA_SM1CAPTCTRLA: EDGCNTA_EN Position  */
#define PWMA_SM1CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_EDGCNTA_EN_SHIFT))&PWMA_SM1CAPTCTRLA_EDGCNTA_EN_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_CFAWM_MASK             (0x03UL << PWMA_SM1CAPTCTRLA_CFAWM_SHIFT)           /*!< PWMA_SM1CAPTCTRLA: CFAWM Mask           */
#define PWMA_SM1CAPTCTRLA_CFAWM_SHIFT            8                                                   /*!< PWMA_SM1CAPTCTRLA: CFAWM Position       */
#define PWMA_SM1CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_CFAWM_SHIFT))&PWMA_SM1CAPTCTRLA_CFAWM_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_CA0CNT_MASK            (0x07UL << PWMA_SM1CAPTCTRLA_CA0CNT_SHIFT)          /*!< PWMA_SM1CAPTCTRLA: CA0CNT Mask          */
#define PWMA_SM1CAPTCTRLA_CA0CNT_SHIFT           10                                                  /*!< PWMA_SM1CAPTCTRLA: CA0CNT Position      */
#define PWMA_SM1CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_CA0CNT_SHIFT))&PWMA_SM1CAPTCTRLA_CA0CNT_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
#define PWMA_SM1CAPTCTRLA_CA1CNT_MASK            (0x07UL << PWMA_SM1CAPTCTRLA_CA1CNT_SHIFT)          /*!< PWMA_SM1CAPTCTRLA: CA1CNT Mask          */
#define PWMA_SM1CAPTCTRLA_CA1CNT_SHIFT           13                                                  /*!< PWMA_SM1CAPTCTRLA: CA1CNT Position      */
#define PWMA_SM1CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLA_CA1CNT_SHIFT))&PWMA_SM1CAPTCTRLA_CA1CNT_MASK) /*!< PWMA_SM1CAPTCTRLA                       */
/* ------- SM1CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM1CAPTCOMPA_EDGCMPA_MASK           (0xFFUL << PWMA_SM1CAPTCOMPA_EDGCMPA_SHIFT)         /*!< PWMA_SM1CAPTCOMPA: EDGCMPA Mask         */
#define PWMA_SM1CAPTCOMPA_EDGCMPA_SHIFT          0                                                   /*!< PWMA_SM1CAPTCOMPA: EDGCMPA Position     */
#define PWMA_SM1CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCOMPA_EDGCMPA_SHIFT))&PWMA_SM1CAPTCOMPA_EDGCMPA_MASK) /*!< PWMA_SM1CAPTCOMPA                       */
#define PWMA_SM1CAPTCOMPA_EDGCNTA_MASK           (0xFFUL << PWMA_SM1CAPTCOMPA_EDGCNTA_SHIFT)         /*!< PWMA_SM1CAPTCOMPA: EDGCNTA Mask         */
#define PWMA_SM1CAPTCOMPA_EDGCNTA_SHIFT          8                                                   /*!< PWMA_SM1CAPTCOMPA: EDGCNTA Position     */
#define PWMA_SM1CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCOMPA_EDGCNTA_SHIFT))&PWMA_SM1CAPTCOMPA_EDGCNTA_MASK) /*!< PWMA_SM1CAPTCOMPA                       */
/* ------- SM1CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM1CAPTCTRLB_ARMB_MASK              (0x01UL << PWMA_SM1CAPTCTRLB_ARMB_SHIFT)            /*!< PWMA_SM1CAPTCTRLB: ARMB Mask            */
#define PWMA_SM1CAPTCTRLB_ARMB_SHIFT             0                                                   /*!< PWMA_SM1CAPTCTRLB: ARMB Position        */
#define PWMA_SM1CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_ARMB_SHIFT))&PWMA_SM1CAPTCTRLB_ARMB_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_ONESHOTB_MASK          (0x01UL << PWMA_SM1CAPTCTRLB_ONESHOTB_SHIFT)        /*!< PWMA_SM1CAPTCTRLB: ONESHOTB Mask        */
#define PWMA_SM1CAPTCTRLB_ONESHOTB_SHIFT         1                                                   /*!< PWMA_SM1CAPTCTRLB: ONESHOTB Position    */
#define PWMA_SM1CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_ONESHOTB_SHIFT))&PWMA_SM1CAPTCTRLB_ONESHOTB_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_EDGB0_MASK             (0x03UL << PWMA_SM1CAPTCTRLB_EDGB0_SHIFT)           /*!< PWMA_SM1CAPTCTRLB: EDGB0 Mask           */
#define PWMA_SM1CAPTCTRLB_EDGB0_SHIFT            2                                                   /*!< PWMA_SM1CAPTCTRLB: EDGB0 Position       */
#define PWMA_SM1CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_EDGB0_SHIFT))&PWMA_SM1CAPTCTRLB_EDGB0_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_EDGB1_MASK             (0x03UL << PWMA_SM1CAPTCTRLB_EDGB1_SHIFT)           /*!< PWMA_SM1CAPTCTRLB: EDGB1 Mask           */
#define PWMA_SM1CAPTCTRLB_EDGB1_SHIFT            4                                                   /*!< PWMA_SM1CAPTCTRLB: EDGB1 Position       */
#define PWMA_SM1CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_EDGB1_SHIFT))&PWMA_SM1CAPTCTRLB_EDGB1_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_INP_SELB_MASK          (0x01UL << PWMA_SM1CAPTCTRLB_INP_SELB_SHIFT)        /*!< PWMA_SM1CAPTCTRLB: INP_SELB Mask        */
#define PWMA_SM1CAPTCTRLB_INP_SELB_SHIFT         6                                                   /*!< PWMA_SM1CAPTCTRLB: INP_SELB Position    */
#define PWMA_SM1CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_INP_SELB_SHIFT))&PWMA_SM1CAPTCTRLB_INP_SELB_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_EDGCNTB_EN_MASK        (0x01UL << PWMA_SM1CAPTCTRLB_EDGCNTB_EN_SHIFT)      /*!< PWMA_SM1CAPTCTRLB: EDGCNTB_EN Mask      */
#define PWMA_SM1CAPTCTRLB_EDGCNTB_EN_SHIFT       7                                                   /*!< PWMA_SM1CAPTCTRLB: EDGCNTB_EN Position  */
#define PWMA_SM1CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_EDGCNTB_EN_SHIFT))&PWMA_SM1CAPTCTRLB_EDGCNTB_EN_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_CFBWM_MASK             (0x03UL << PWMA_SM1CAPTCTRLB_CFBWM_SHIFT)           /*!< PWMA_SM1CAPTCTRLB: CFBWM Mask           */
#define PWMA_SM1CAPTCTRLB_CFBWM_SHIFT            8                                                   /*!< PWMA_SM1CAPTCTRLB: CFBWM Position       */
#define PWMA_SM1CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_CFBWM_SHIFT))&PWMA_SM1CAPTCTRLB_CFBWM_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_CB0CNT_MASK            (0x07UL << PWMA_SM1CAPTCTRLB_CB0CNT_SHIFT)          /*!< PWMA_SM1CAPTCTRLB: CB0CNT Mask          */
#define PWMA_SM1CAPTCTRLB_CB0CNT_SHIFT           10                                                  /*!< PWMA_SM1CAPTCTRLB: CB0CNT Position      */
#define PWMA_SM1CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_CB0CNT_SHIFT))&PWMA_SM1CAPTCTRLB_CB0CNT_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
#define PWMA_SM1CAPTCTRLB_CB1CNT_MASK            (0x07UL << PWMA_SM1CAPTCTRLB_CB1CNT_SHIFT)          /*!< PWMA_SM1CAPTCTRLB: CB1CNT Mask          */
#define PWMA_SM1CAPTCTRLB_CB1CNT_SHIFT           13                                                  /*!< PWMA_SM1CAPTCTRLB: CB1CNT Position      */
#define PWMA_SM1CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLB_CB1CNT_SHIFT))&PWMA_SM1CAPTCTRLB_CB1CNT_MASK) /*!< PWMA_SM1CAPTCTRLB                       */
/* ------- SM1CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM1CAPTCOMPB_EDGCMPB_MASK           (0xFFUL << PWMA_SM1CAPTCOMPB_EDGCMPB_SHIFT)         /*!< PWMA_SM1CAPTCOMPB: EDGCMPB Mask         */
#define PWMA_SM1CAPTCOMPB_EDGCMPB_SHIFT          0                                                   /*!< PWMA_SM1CAPTCOMPB: EDGCMPB Position     */
#define PWMA_SM1CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_SM1CAPTCOMPB_EDGCMPB_MASK) /*!< PWMA_SM1CAPTCOMPB                       */
#define PWMA_SM1CAPTCOMPB_EDGCNTB_MASK           (0xFFUL << PWMA_SM1CAPTCOMPB_EDGCNTB_SHIFT)         /*!< PWMA_SM1CAPTCOMPB: EDGCNTB Mask         */
#define PWMA_SM1CAPTCOMPB_EDGCNTB_SHIFT          8                                                   /*!< PWMA_SM1CAPTCOMPB: EDGCNTB Position     */
#define PWMA_SM1CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_SM1CAPTCOMPB_EDGCNTB_MASK) /*!< PWMA_SM1CAPTCOMPB                       */
/* ------- SM1CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM1CAPTCTRLX_ARMX_MASK              (0x01UL << PWMA_SM1CAPTCTRLX_ARMX_SHIFT)            /*!< PWMA_SM1CAPTCTRLX: ARMX Mask            */
#define PWMA_SM1CAPTCTRLX_ARMX_SHIFT             0                                                   /*!< PWMA_SM1CAPTCTRLX: ARMX Position        */
#define PWMA_SM1CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_ARMX_SHIFT))&PWMA_SM1CAPTCTRLX_ARMX_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_ONESHOTX_MASK          (0x01UL << PWMA_SM1CAPTCTRLX_ONESHOTX_SHIFT)        /*!< PWMA_SM1CAPTCTRLX: ONESHOTX Mask        */
#define PWMA_SM1CAPTCTRLX_ONESHOTX_SHIFT         1                                                   /*!< PWMA_SM1CAPTCTRLX: ONESHOTX Position    */
#define PWMA_SM1CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_ONESHOTX_SHIFT))&PWMA_SM1CAPTCTRLX_ONESHOTX_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_EDGX0_MASK             (0x03UL << PWMA_SM1CAPTCTRLX_EDGX0_SHIFT)           /*!< PWMA_SM1CAPTCTRLX: EDGX0 Mask           */
#define PWMA_SM1CAPTCTRLX_EDGX0_SHIFT            2                                                   /*!< PWMA_SM1CAPTCTRLX: EDGX0 Position       */
#define PWMA_SM1CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_EDGX0_SHIFT))&PWMA_SM1CAPTCTRLX_EDGX0_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_EDGX1_MASK             (0x03UL << PWMA_SM1CAPTCTRLX_EDGX1_SHIFT)           /*!< PWMA_SM1CAPTCTRLX: EDGX1 Mask           */
#define PWMA_SM1CAPTCTRLX_EDGX1_SHIFT            4                                                   /*!< PWMA_SM1CAPTCTRLX: EDGX1 Position       */
#define PWMA_SM1CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_EDGX1_SHIFT))&PWMA_SM1CAPTCTRLX_EDGX1_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_INP_SELX_MASK          (0x01UL << PWMA_SM1CAPTCTRLX_INP_SELX_SHIFT)        /*!< PWMA_SM1CAPTCTRLX: INP_SELX Mask        */
#define PWMA_SM1CAPTCTRLX_INP_SELX_SHIFT         6                                                   /*!< PWMA_SM1CAPTCTRLX: INP_SELX Position    */
#define PWMA_SM1CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_INP_SELX_SHIFT))&PWMA_SM1CAPTCTRLX_INP_SELX_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_EDGCNTX_EN_MASK        (0x01UL << PWMA_SM1CAPTCTRLX_EDGCNTX_EN_SHIFT)      /*!< PWMA_SM1CAPTCTRLX: EDGCNTX_EN Mask      */
#define PWMA_SM1CAPTCTRLX_EDGCNTX_EN_SHIFT       7                                                   /*!< PWMA_SM1CAPTCTRLX: EDGCNTX_EN Position  */
#define PWMA_SM1CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_EDGCNTX_EN_SHIFT))&PWMA_SM1CAPTCTRLX_EDGCNTX_EN_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_CFXWM_MASK             (0x03UL << PWMA_SM1CAPTCTRLX_CFXWM_SHIFT)           /*!< PWMA_SM1CAPTCTRLX: CFXWM Mask           */
#define PWMA_SM1CAPTCTRLX_CFXWM_SHIFT            8                                                   /*!< PWMA_SM1CAPTCTRLX: CFXWM Position       */
#define PWMA_SM1CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_CFXWM_SHIFT))&PWMA_SM1CAPTCTRLX_CFXWM_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_CX0CNT_MASK            (0x07UL << PWMA_SM1CAPTCTRLX_CX0CNT_SHIFT)          /*!< PWMA_SM1CAPTCTRLX: CX0CNT Mask          */
#define PWMA_SM1CAPTCTRLX_CX0CNT_SHIFT           10                                                  /*!< PWMA_SM1CAPTCTRLX: CX0CNT Position      */
