podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
#define PWMA_SM1CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_CX0CNT_SHIFT))&PWMA_SM1CAPTCTRLX_CX0CNT_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
#define PWMA_SM1CAPTCTRLX_CX1CNT_MASK            (0x07UL << PWMA_SM1CAPTCTRLX_CX1CNT_SHIFT)          /*!< PWMA_SM1CAPTCTRLX: CX1CNT Mask          */
#define PWMA_SM1CAPTCTRLX_CX1CNT_SHIFT           13                                                  /*!< PWMA_SM1CAPTCTRLX: CX1CNT Position      */
#define PWMA_SM1CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCTRLX_CX1CNT_SHIFT))&PWMA_SM1CAPTCTRLX_CX1CNT_MASK) /*!< PWMA_SM1CAPTCTRLX                       */
/* ------- SM1CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM1CAPTCOMPX_EDGCMPX_MASK           (0xFFUL << PWMA_SM1CAPTCOMPX_EDGCMPX_SHIFT)         /*!< PWMA_SM1CAPTCOMPX: EDGCMPX Mask         */
#define PWMA_SM1CAPTCOMPX_EDGCMPX_SHIFT          0                                                   /*!< PWMA_SM1CAPTCOMPX: EDGCMPX Position     */
#define PWMA_SM1CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_SM1CAPTCOMPX_EDGCMPX_MASK) /*!< PWMA_SM1CAPTCOMPX                       */
#define PWMA_SM1CAPTCOMPX_EDGCNTX_MASK           (0xFFUL << PWMA_SM1CAPTCOMPX_EDGCNTX_SHIFT)         /*!< PWMA_SM1CAPTCOMPX: EDGCNTX Mask         */
#define PWMA_SM1CAPTCOMPX_EDGCNTX_SHIFT          8                                                   /*!< PWMA_SM1CAPTCOMPX: EDGCNTX Position     */
#define PWMA_SM1CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_SM1CAPTCOMPX_EDGCNTX_MASK) /*!< PWMA_SM1CAPTCOMPX                       */
/* ------- SM1CVAL0 Bit Fields                      ------ */
#define PWMA_SM1CVAL0_CAPTVAL0_MASK              (0xFFFFUL << PWMA_SM1CVAL0_CAPTVAL0_SHIFT)          /*!< PWMA_SM1CVAL0: CAPTVAL0 Mask            */
#define PWMA_SM1CVAL0_CAPTVAL0_SHIFT             0                                                   /*!< PWMA_SM1CVAL0: CAPTVAL0 Position        */
#define PWMA_SM1CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL0_CAPTVAL0_SHIFT))&PWMA_SM1CVAL0_CAPTVAL0_MASK) /*!< PWMA_SM1CVAL0                           */
/* ------- SM1CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL0CYC_CVAL0CYC_MASK           (0x0FUL << PWMA_SM1CVAL0CYC_CVAL0CYC_SHIFT)         /*!< PWMA_SM1CVAL0CYC: CVAL0CYC Mask         */
#define PWMA_SM1CVAL0CYC_CVAL0CYC_SHIFT          0                                                   /*!< PWMA_SM1CVAL0CYC: CVAL0CYC Position     */
#define PWMA_SM1CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_SM1CVAL0CYC_CVAL0CYC_MASK) /*!< PWMA_SM1CVAL0CYC                        */
/* ------- SM1CVAL1 Bit Fields                      ------ */
#define PWMA_SM1CVAL1_CAPTVAL1_MASK              (0xFFFFUL << PWMA_SM1CVAL1_CAPTVAL1_SHIFT)          /*!< PWMA_SM1CVAL1: CAPTVAL1 Mask            */
#define PWMA_SM1CVAL1_CAPTVAL1_SHIFT             0                                                   /*!< PWMA_SM1CVAL1: CAPTVAL1 Position        */
#define PWMA_SM1CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL1_CAPTVAL1_SHIFT))&PWMA_SM1CVAL1_CAPTVAL1_MASK) /*!< PWMA_SM1CVAL1                           */
/* ------- SM1CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL1CYC_CVAL1CYC_MASK           (0x0FUL << PWMA_SM1CVAL1CYC_CVAL1CYC_SHIFT)         /*!< PWMA_SM1CVAL1CYC: CVAL1CYC Mask         */
#define PWMA_SM1CVAL1CYC_CVAL1CYC_SHIFT          0                                                   /*!< PWMA_SM1CVAL1CYC: CVAL1CYC Position     */
#define PWMA_SM1CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_SM1CVAL1CYC_CVAL1CYC_MASK) /*!< PWMA_SM1CVAL1CYC                        */
/* ------- SM1CVAL2 Bit Fields                      ------ */
#define PWMA_SM1CVAL2_CAPTVAL2_MASK              (0xFFFFUL << PWMA_SM1CVAL2_CAPTVAL2_SHIFT)          /*!< PWMA_SM1CVAL2: CAPTVAL2 Mask            */
#define PWMA_SM1CVAL2_CAPTVAL2_SHIFT             0                                                   /*!< PWMA_SM1CVAL2: CAPTVAL2 Position        */
#define PWMA_SM1CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL2_CAPTVAL2_SHIFT))&PWMA_SM1CVAL2_CAPTVAL2_MASK) /*!< PWMA_SM1CVAL2                           */
/* ------- SM1CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL2CYC_CVAL2CYC_MASK           (0x0FUL << PWMA_SM1CVAL2CYC_CVAL2CYC_SHIFT)         /*!< PWMA_SM1CVAL2CYC: CVAL2CYC Mask         */
#define PWMA_SM1CVAL2CYC_CVAL2CYC_SHIFT          0                                                   /*!< PWMA_SM1CVAL2CYC: CVAL2CYC Position     */
#define PWMA_SM1CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_SM1CVAL2CYC_CVAL2CYC_MASK) /*!< PWMA_SM1CVAL2CYC                        */
/* ------- SM1CVAL3 Bit Fields                      ------ */
#define PWMA_SM1CVAL3_CAPTVAL3_MASK              (0xFFFFUL << PWMA_SM1CVAL3_CAPTVAL3_SHIFT)          /*!< PWMA_SM1CVAL3: CAPTVAL3 Mask            */
#define PWMA_SM1CVAL3_CAPTVAL3_SHIFT             0                                                   /*!< PWMA_SM1CVAL3: CAPTVAL3 Position        */
#define PWMA_SM1CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL3_CAPTVAL3_SHIFT))&PWMA_SM1CVAL3_CAPTVAL3_MASK) /*!< PWMA_SM1CVAL3                           */
/* ------- SM1CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL3CYC_CVAL3CYC_MASK           (0x0FUL << PWMA_SM1CVAL3CYC_CVAL3CYC_SHIFT)         /*!< PWMA_SM1CVAL3CYC: CVAL3CYC Mask         */
#define PWMA_SM1CVAL3CYC_CVAL3CYC_SHIFT          0                                                   /*!< PWMA_SM1CVAL3CYC: CVAL3CYC Position     */
#define PWMA_SM1CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_SM1CVAL3CYC_CVAL3CYC_MASK) /*!< PWMA_SM1CVAL3CYC                        */
/* ------- SM1CVAL4 Bit Fields                      ------ */
#define PWMA_SM1CVAL4_CAPTVAL4_MASK              (0xFFFFUL << PWMA_SM1CVAL4_CAPTVAL4_SHIFT)          /*!< PWMA_SM1CVAL4: CAPTVAL4 Mask            */
#define PWMA_SM1CVAL4_CAPTVAL4_SHIFT             0                                                   /*!< PWMA_SM1CVAL4: CAPTVAL4 Position        */
#define PWMA_SM1CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL4_CAPTVAL4_SHIFT))&PWMA_SM1CVAL4_CAPTVAL4_MASK) /*!< PWMA_SM1CVAL4                           */
/* ------- SM1CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL4CYC_CVAL4CYC_MASK           (0x0FUL << PWMA_SM1CVAL4CYC_CVAL4CYC_SHIFT)         /*!< PWMA_SM1CVAL4CYC: CVAL4CYC Mask         */
#define PWMA_SM1CVAL4CYC_CVAL4CYC_SHIFT          0                                                   /*!< PWMA_SM1CVAL4CYC: CVAL4CYC Position     */
#define PWMA_SM1CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_SM1CVAL4CYC_CVAL4CYC_MASK) /*!< PWMA_SM1CVAL4CYC                        */
/* ------- SM1CVAL5 Bit Fields                      ------ */
#define PWMA_SM1CVAL5_CAPTVAL5_MASK              (0xFFFFUL << PWMA_SM1CVAL5_CAPTVAL5_SHIFT)          /*!< PWMA_SM1CVAL5: CAPTVAL5 Mask            */
#define PWMA_SM1CVAL5_CAPTVAL5_SHIFT             0                                                   /*!< PWMA_SM1CVAL5: CAPTVAL5 Position        */
#define PWMA_SM1CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL5_CAPTVAL5_SHIFT))&PWMA_SM1CVAL5_CAPTVAL5_MASK) /*!< PWMA_SM1CVAL5                           */
/* ------- SM1CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM1CVAL5CYC_CVAL5CYC_MASK           (0x0FUL << PWMA_SM1CVAL5CYC_CVAL5CYC_SHIFT)         /*!< PWMA_SM1CVAL5CYC: CVAL5CYC Mask         */
#define PWMA_SM1CVAL5CYC_CVAL5CYC_SHIFT          0                                                   /*!< PWMA_SM1CVAL5CYC: CVAL5CYC Position     */
#define PWMA_SM1CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_SM1CVAL5CYC_CVAL5CYC_MASK) /*!< PWMA_SM1CVAL5CYC                        */
/* ------- SM2CNT Bit Fields                        ------ */
#define PWMA_SM2CNT_CNT_MASK                     (0xFFFFUL << PWMA_SM2CNT_CNT_SHIFT)                 /*!< PWMA_SM2CNT: CNT Mask                   */
#define PWMA_SM2CNT_CNT_SHIFT                    0                                                   /*!< PWMA_SM2CNT: CNT Position               */
#define PWMA_SM2CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CNT_CNT_SHIFT))&PWMA_SM2CNT_CNT_MASK) /*!< PWMA_SM2CNT                             */
/* ------- SM2INIT Bit Fields                       ------ */
#define PWMA_SM2INIT_INIT_MASK                   (0xFFFFUL << PWMA_SM2INIT_INIT_SHIFT)               /*!< PWMA_SM2INIT: INIT Mask                 */
#define PWMA_SM2INIT_INIT_SHIFT                  0                                                   /*!< PWMA_SM2INIT: INIT Position             */
#define PWMA_SM2INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INIT_INIT_SHIFT))&PWMA_SM2INIT_INIT_MASK) /*!< PWMA_SM2INIT                            */
/* ------- SM2CTRL2 Bit Fields                      ------ */
#define PWMA_SM2CTRL2_CLK_SEL_MASK               (0x03UL << PWMA_SM2CTRL2_CLK_SEL_SHIFT)             /*!< PWMA_SM2CTRL2: CLK_SEL Mask             */
#define PWMA_SM2CTRL2_CLK_SEL_SHIFT              0                                                   /*!< PWMA_SM2CTRL2: CLK_SEL Position         */
#define PWMA_SM2CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_CLK_SEL_SHIFT))&PWMA_SM2CTRL2_CLK_SEL_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_RELOAD_SEL_MASK            (0x01UL << PWMA_SM2CTRL2_RELOAD_SEL_SHIFT)          /*!< PWMA_SM2CTRL2: RELOAD_SEL Mask          */
#define PWMA_SM2CTRL2_RELOAD_SEL_SHIFT           2                                                   /*!< PWMA_SM2CTRL2: RELOAD_SEL Position      */
#define PWMA_SM2CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_RELOAD_SEL_SHIFT))&PWMA_SM2CTRL2_RELOAD_SEL_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_FORCE_SEL_MASK             (0x07UL << PWMA_SM2CTRL2_FORCE_SEL_SHIFT)           /*!< PWMA_SM2CTRL2: FORCE_SEL Mask           */
#define PWMA_SM2CTRL2_FORCE_SEL_SHIFT            3                                                   /*!< PWMA_SM2CTRL2: FORCE_SEL Position       */
#define PWMA_SM2CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_FORCE_SEL_SHIFT))&PWMA_SM2CTRL2_FORCE_SEL_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_FORCE_MASK                 (0x01UL << PWMA_SM2CTRL2_FORCE_SHIFT)               /*!< PWMA_SM2CTRL2: FORCE Mask               */
#define PWMA_SM2CTRL2_FORCE_SHIFT                6                                                   /*!< PWMA_SM2CTRL2: FORCE Position           */
#define PWMA_SM2CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_FORCE_SHIFT))&PWMA_SM2CTRL2_FORCE_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_FRCEN_MASK                 (0x01UL << PWMA_SM2CTRL2_FRCEN_SHIFT)               /*!< PWMA_SM2CTRL2: FRCEN Mask               */
#define PWMA_SM2CTRL2_FRCEN_SHIFT                7                                                   /*!< PWMA_SM2CTRL2: FRCEN Position           */
#define PWMA_SM2CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_FRCEN_SHIFT))&PWMA_SM2CTRL2_FRCEN_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_INIT_SEL_MASK              (0x03UL << PWMA_SM2CTRL2_INIT_SEL_SHIFT)            /*!< PWMA_SM2CTRL2: INIT_SEL Mask            */
#define PWMA_SM2CTRL2_INIT_SEL_SHIFT             8                                                   /*!< PWMA_SM2CTRL2: INIT_SEL Position        */
#define PWMA_SM2CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_INIT_SEL_SHIFT))&PWMA_SM2CTRL2_INIT_SEL_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_PWMX_INIT_MASK             (0x01UL << PWMA_SM2CTRL2_PWMX_INIT_SHIFT)           /*!< PWMA_SM2CTRL2: PWMX_INIT Mask           */
#define PWMA_SM2CTRL2_PWMX_INIT_SHIFT            10                                                  /*!< PWMA_SM2CTRL2: PWMX_INIT Position       */
#define PWMA_SM2CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_PWMX_INIT_SHIFT))&PWMA_SM2CTRL2_PWMX_INIT_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_PWM45_INIT_MASK            (0x01UL << PWMA_SM2CTRL2_PWM45_INIT_SHIFT)          /*!< PWMA_SM2CTRL2: PWM45_INIT Mask          */
#define PWMA_SM2CTRL2_PWM45_INIT_SHIFT           11                                                  /*!< PWMA_SM2CTRL2: PWM45_INIT Position      */
#define PWMA_SM2CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_PWM45_INIT_SHIFT))&PWMA_SM2CTRL2_PWM45_INIT_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_PWM23_INIT_MASK            (0x01UL << PWMA_SM2CTRL2_PWM23_INIT_SHIFT)          /*!< PWMA_SM2CTRL2: PWM23_INIT Mask          */
#define PWMA_SM2CTRL2_PWM23_INIT_SHIFT           12                                                  /*!< PWMA_SM2CTRL2: PWM23_INIT Position      */
#define PWMA_SM2CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_PWM23_INIT_SHIFT))&PWMA_SM2CTRL2_PWM23_INIT_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_INDEP_MASK                 (0x01UL << PWMA_SM2CTRL2_INDEP_SHIFT)               /*!< PWMA_SM2CTRL2: INDEP Mask               */
#define PWMA_SM2CTRL2_INDEP_SHIFT                13                                                  /*!< PWMA_SM2CTRL2: INDEP Position           */
#define PWMA_SM2CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_INDEP_SHIFT))&PWMA_SM2CTRL2_INDEP_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_WAITEN_MASK                (0x01UL << PWMA_SM2CTRL2_WAITEN_SHIFT)              /*!< PWMA_SM2CTRL2: WAITEN Mask              */
#define PWMA_SM2CTRL2_WAITEN_SHIFT               14                                                  /*!< PWMA_SM2CTRL2: WAITEN Position          */
#define PWMA_SM2CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_WAITEN_SHIFT))&PWMA_SM2CTRL2_WAITEN_MASK) /*!< PWMA_SM2CTRL2                           */
#define PWMA_SM2CTRL2_DBGEN_MASK                 (0x01UL << PWMA_SM2CTRL2_DBGEN_SHIFT)               /*!< PWMA_SM2CTRL2: DBGEN Mask               */
#define PWMA_SM2CTRL2_DBGEN_SHIFT                15                                                  /*!< PWMA_SM2CTRL2: DBGEN Position           */
#define PWMA_SM2CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL2_DBGEN_SHIFT))&PWMA_SM2CTRL2_DBGEN_MASK) /*!< PWMA_SM2CTRL2                           */
/* ------- SM2CTRL Bit Fields                       ------ */
#define PWMA_SM2CTRL_DBLEN_MASK                  (0x01UL << PWMA_SM2CTRL_DBLEN_SHIFT)                /*!< PWMA_SM2CTRL: DBLEN Mask                */
#define PWMA_SM2CTRL_DBLEN_SHIFT                 0                                                   /*!< PWMA_SM2CTRL: DBLEN Position            */
#define PWMA_SM2CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_DBLEN_SHIFT))&PWMA_SM2CTRL_DBLEN_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_DBLX_MASK                   (0x01UL << PWMA_SM2CTRL_DBLX_SHIFT)                 /*!< PWMA_SM2CTRL: DBLX Mask                 */
#define PWMA_SM2CTRL_DBLX_SHIFT                  1                                                   /*!< PWMA_SM2CTRL: DBLX Position             */
#define PWMA_SM2CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_DBLX_SHIFT))&PWMA_SM2CTRL_DBLX_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_LDMOD_MASK                  (0x01UL << PWMA_SM2CTRL_LDMOD_SHIFT)                /*!< PWMA_SM2CTRL: LDMOD Mask                */
#define PWMA_SM2CTRL_LDMOD_SHIFT                 2                                                   /*!< PWMA_SM2CTRL: LDMOD Position            */
#define PWMA_SM2CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_LDMOD_SHIFT))&PWMA_SM2CTRL_LDMOD_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_PRSC_MASK                   (0x07UL << PWMA_SM2CTRL_PRSC_SHIFT)                 /*!< PWMA_SM2CTRL: PRSC Mask                 */
#define PWMA_SM2CTRL_PRSC_SHIFT                  4                                                   /*!< PWMA_SM2CTRL: PRSC Position             */
#define PWMA_SM2CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_PRSC_SHIFT))&PWMA_SM2CTRL_PRSC_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_DT_MASK                     (0x03UL << PWMA_SM2CTRL_DT_SHIFT)                   /*!< PWMA_SM2CTRL: DT Mask                   */
#define PWMA_SM2CTRL_DT_SHIFT                    8                                                   /*!< PWMA_SM2CTRL: DT Position               */
#define PWMA_SM2CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_DT_SHIFT))&PWMA_SM2CTRL_DT_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_FULL_MASK                   (0x01UL << PWMA_SM2CTRL_FULL_SHIFT)                 /*!< PWMA_SM2CTRL: FULL Mask                 */
#define PWMA_SM2CTRL_FULL_SHIFT                  10                                                  /*!< PWMA_SM2CTRL: FULL Position             */
#define PWMA_SM2CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_FULL_SHIFT))&PWMA_SM2CTRL_FULL_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_HALF_MASK                   (0x01UL << PWMA_SM2CTRL_HALF_SHIFT)                 /*!< PWMA_SM2CTRL: HALF Mask                 */
#define PWMA_SM2CTRL_HALF_SHIFT                  11                                                  /*!< PWMA_SM2CTRL: HALF Position             */
#define PWMA_SM2CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_HALF_SHIFT))&PWMA_SM2CTRL_HALF_MASK) /*!< PWMA_SM2CTRL                            */
#define PWMA_SM2CTRL_LDFQ_MASK                   (0x0FUL << PWMA_SM2CTRL_LDFQ_SHIFT)                 /*!< PWMA_SM2CTRL: LDFQ Mask                 */
#define PWMA_SM2CTRL_LDFQ_SHIFT                  12                                                  /*!< PWMA_SM2CTRL: LDFQ Position             */
#define PWMA_SM2CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CTRL_LDFQ_SHIFT))&PWMA_SM2CTRL_LDFQ_MASK) /*!< PWMA_SM2CTRL                            */
/* ------- SM2VAL0 Bit Fields                       ------ */
#define PWMA_SM2VAL0_VAL0_MASK                   (0xFFFFUL << PWMA_SM2VAL0_VAL0_SHIFT)               /*!< PWMA_SM2VAL0: VAL0 Mask                 */
#define PWMA_SM2VAL0_VAL0_SHIFT                  0                                                   /*!< PWMA_SM2VAL0: VAL0 Position             */
#define PWMA_SM2VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2VAL0_VAL0_SHIFT))&PWMA_SM2VAL0_VAL0_MASK) /*!< PWMA_SM2VAL0                            */
/* ------- SM2FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM2FRACVAL1_FRACVAL1_MASK           (0x1FUL << PWMA_SM2FRACVAL1_FRACVAL1_SHIFT)         /*!< PWMA_SM2FRACVAL1: FRACVAL1 Mask         */
#define PWMA_SM2FRACVAL1_FRACVAL1_SHIFT          11                                                  /*!< PWMA_SM2FRACVAL1: FRACVAL1 Position     */
#define PWMA_SM2FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRACVAL1_FRACVAL1_SHIFT))&PWMA_SM2FRACVAL1_FRACVAL1_MASK) /*!< PWMA_SM2FRACVAL1                        */
/* ------- SM2VAL1 Bit Fields                       ------ */
#define PWMA_SM2VAL1_VAL1_MASK                   (0xFFFFUL << PWMA_SM2VAL1_VAL1_SHIFT)               /*!< PWMA_SM2VAL1: VAL1 Mask                 */
#define PWMA_SM2VAL1_VAL1_SHIFT                  0                                                   /*!< PWMA_SM2VAL1: VAL1 Position             */
#define PWMA_SM2VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2VAL1_VAL1_SHIFT))&PWMA_SM2VAL1_VAL1_MASK) /*!< PWMA_SM2VAL1                            */
/* ------- SM2FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM2FRACVAL2_FRACVAL2_MASK           (0x1FUL << PWMA_SM2FRACVAL2_FRACVAL2_SHIFT)         /*!< PWMA_SM2FRACVAL2: FRACVAL2 Mask         */
#define PWMA_SM2FRACVAL2_FRACVAL2_SHIFT          11                                                  /*!< PWMA_SM2FRACVAL2: FRACVAL2 Position     */
#define PWMA_SM2FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRACVAL2_FRACVAL2_SHIFT))&PWMA_SM2FRACVAL2_FRACVAL2_MASK) /*!< PWMA_SM2FRACVAL2                        */
/* ------- SM2VAL2 Bit Fields                       ------ */
#define PWMA_SM2VAL2_VAL2_MASK                   (0xFFFFUL << PWMA_SM2VAL2_VAL2_SHIFT)               /*!< PWMA_SM2VAL2: VAL2 Mask                 */
#define PWMA_SM2VAL2_VAL2_SHIFT                  0                                                   /*!< PWMA_SM2VAL2: VAL2 Position             */
#define PWMA_SM2VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2VAL2_VAL2_SHIFT))&PWMA_SM2VAL2_VAL2_MASK) /*!< PWMA_SM2VAL2                            */
/* ------- SM2FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM2FRACVAL3_FRACVAL3_MASK           (0x1FUL << PWMA_SM2FRACVAL3_FRACVAL3_SHIFT)         /*!< PWMA_SM2FRACVAL3: FRACVAL3 Mask         */
#define PWMA_SM2FRACVAL3_FRACVAL3_SHIFT          11                                                  /*!< PWMA_SM2FRACVAL3: FRACVAL3 Position     */
#define PWMA_SM2FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRACVAL3_FRACVAL3_SHIFT))&PWMA_SM2FRACVAL3_FRACVAL3_MASK) /*!< PWMA_SM2FRACVAL3                        */
/* ------- SM2VAL3 Bit Fields                       ------ */
#define PWMA_SM2VAL3_VAL3_MASK                   (0xFFFFUL << PWMA_SM2VAL3_VAL3_SHIFT)               /*!< PWMA_SM2VAL3: VAL3 Mask                 */
#define PWMA_SM2VAL3_VAL3_SHIFT                  0                                                   /*!< PWMA_SM2VAL3: VAL3 Position             */
#define PWMA_SM2VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2VAL3_VAL3_SHIFT))&PWMA_SM2VAL3_VAL3_MASK) /*!< PWMA_SM2VAL3                            */
/* ------- SM2FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM2FRACVAL4_FRACVAL4_MASK           (0x1FUL << PWMA_SM2FRACVAL4_FRACVAL4_SHIFT)         /*!< PWMA_SM2FRACVAL4: FRACVAL4 Mask         */
#define PWMA_SM2FRACVAL4_FRACVAL4_SHIFT          11                                                  /*!< PWMA_SM2FRACVAL4: FRACVAL4 Position     */
#define PWMA_SM2FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRACVAL4_FRACVAL4_SHIFT))&PWMA_SM2FRACVAL4_FRACVAL4_MASK) /*!< PWMA_SM2FRACVAL4                        */
/* ------- SM2VAL4 Bit Fields                       ------ */
#define PWMA_SM2VAL4_VAL4_MASK                   (0xFFFFUL << PWMA_SM2VAL4_VAL4_SHIFT)               /*!< PWMA_SM2VAL4: VAL4 Mask                 */
#define PWMA_SM2VAL4_VAL4_SHIFT                  0                                                   /*!< PWMA_SM2VAL4: VAL4 Position             */
