podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV46F15.h
/* ------- SM2CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL5CYC_CVAL5CYC_MASK           (0x0FUL << PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT)         /*!< PWMA_SM2CVAL5CYC: CVAL5CYC Mask         */
#define PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL5CYC: CVAL5CYC Position     */
#define PWMA_SM2CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_SM2CVAL5CYC_CVAL5CYC_MASK) /*!< PWMA_SM2CVAL5CYC                        */
/* ------- SM3CNT Bit Fields                        ------ */
#define PWMA_SM3CNT_CNT_MASK                     (0xFFFFUL << PWMA_SM3CNT_CNT_SHIFT)                 /*!< PWMA_SM3CNT: CNT Mask                   */
#define PWMA_SM3CNT_CNT_SHIFT                    0                                                   /*!< PWMA_SM3CNT: CNT Position               */
#define PWMA_SM3CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CNT_CNT_SHIFT))&PWMA_SM3CNT_CNT_MASK) /*!< PWMA_SM3CNT                             */
/* ------- SM3INIT Bit Fields                       ------ */
#define PWMA_SM3INIT_INIT_MASK                   (0xFFFFUL << PWMA_SM3INIT_INIT_SHIFT)               /*!< PWMA_SM3INIT: INIT Mask                 */
#define PWMA_SM3INIT_INIT_SHIFT                  0                                                   /*!< PWMA_SM3INIT: INIT Position             */
#define PWMA_SM3INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3INIT_INIT_SHIFT))&PWMA_SM3INIT_INIT_MASK) /*!< PWMA_SM3INIT                            */
/* ------- SM3CTRL2 Bit Fields                      ------ */
#define PWMA_SM3CTRL2_CLK_SEL_MASK               (0x03UL << PWMA_SM3CTRL2_CLK_SEL_SHIFT)             /*!< PWMA_SM3CTRL2: CLK_SEL Mask             */
#define PWMA_SM3CTRL2_CLK_SEL_SHIFT              0                                                   /*!< PWMA_SM3CTRL2: CLK_SEL Position         */
#define PWMA_SM3CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_CLK_SEL_SHIFT))&PWMA_SM3CTRL2_CLK_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_RELOAD_SEL_MASK            (0x01UL << PWMA_SM3CTRL2_RELOAD_SEL_SHIFT)          /*!< PWMA_SM3CTRL2: RELOAD_SEL Mask          */
#define PWMA_SM3CTRL2_RELOAD_SEL_SHIFT           2                                                   /*!< PWMA_SM3CTRL2: RELOAD_SEL Position      */
#define PWMA_SM3CTRL2_RELOAD_SEL(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_RELOAD_SEL_SHIFT))&PWMA_SM3CTRL2_RELOAD_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_FORCE_SEL_MASK             (0x07UL << PWMA_SM3CTRL2_FORCE_SEL_SHIFT)           /*!< PWMA_SM3CTRL2: FORCE_SEL Mask           */
#define PWMA_SM3CTRL2_FORCE_SEL_SHIFT            3                                                   /*!< PWMA_SM3CTRL2: FORCE_SEL Position       */
#define PWMA_SM3CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_FORCE_SEL_SHIFT))&PWMA_SM3CTRL2_FORCE_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_FORCE_MASK                 (0x01UL << PWMA_SM3CTRL2_FORCE_SHIFT)               /*!< PWMA_SM3CTRL2: FORCE Mask               */
#define PWMA_SM3CTRL2_FORCE_SHIFT                6                                                   /*!< PWMA_SM3CTRL2: FORCE Position           */
#define PWMA_SM3CTRL2_FORCE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_FORCE_SHIFT))&PWMA_SM3CTRL2_FORCE_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_FRCEN_MASK                 (0x01UL << PWMA_SM3CTRL2_FRCEN_SHIFT)               /*!< PWMA_SM3CTRL2: FRCEN Mask               */
#define PWMA_SM3CTRL2_FRCEN_SHIFT                7                                                   /*!< PWMA_SM3CTRL2: FRCEN Position           */
#define PWMA_SM3CTRL2_FRCEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_FRCEN_SHIFT))&PWMA_SM3CTRL2_FRCEN_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_INIT_SEL_MASK              (0x03UL << PWMA_SM3CTRL2_INIT_SEL_SHIFT)            /*!< PWMA_SM3CTRL2: INIT_SEL Mask            */
#define PWMA_SM3CTRL2_INIT_SEL_SHIFT             8                                                   /*!< PWMA_SM3CTRL2: INIT_SEL Position        */
#define PWMA_SM3CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_INIT_SEL_SHIFT))&PWMA_SM3CTRL2_INIT_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_PWMX_INIT_MASK             (0x01UL << PWMA_SM3CTRL2_PWMX_INIT_SHIFT)           /*!< PWMA_SM3CTRL2: PWMX_INIT Mask           */
#define PWMA_SM3CTRL2_PWMX_INIT_SHIFT            10                                                  /*!< PWMA_SM3CTRL2: PWMX_INIT Position       */
#define PWMA_SM3CTRL2_PWMX_INIT(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_PWMX_INIT_SHIFT))&PWMA_SM3CTRL2_PWMX_INIT_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_PWM45_INIT_MASK            (0x01UL << PWMA_SM3CTRL2_PWM45_INIT_SHIFT)          /*!< PWMA_SM3CTRL2: PWM45_INIT Mask          */
#define PWMA_SM3CTRL2_PWM45_INIT_SHIFT           11                                                  /*!< PWMA_SM3CTRL2: PWM45_INIT Position      */
#define PWMA_SM3CTRL2_PWM45_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_PWM45_INIT_SHIFT))&PWMA_SM3CTRL2_PWM45_INIT_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_PWM23_INIT_MASK            (0x01UL << PWMA_SM3CTRL2_PWM23_INIT_SHIFT)          /*!< PWMA_SM3CTRL2: PWM23_INIT Mask          */
#define PWMA_SM3CTRL2_PWM23_INIT_SHIFT           12                                                  /*!< PWMA_SM3CTRL2: PWM23_INIT Position      */
#define PWMA_SM3CTRL2_PWM23_INIT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_PWM23_INIT_SHIFT))&PWMA_SM3CTRL2_PWM23_INIT_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_INDEP_MASK                 (0x01UL << PWMA_SM3CTRL2_INDEP_SHIFT)               /*!< PWMA_SM3CTRL2: INDEP Mask               */
#define PWMA_SM3CTRL2_INDEP_SHIFT                13                                                  /*!< PWMA_SM3CTRL2: INDEP Position           */
#define PWMA_SM3CTRL2_INDEP(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_INDEP_SHIFT))&PWMA_SM3CTRL2_INDEP_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_WAITEN_MASK                (0x01UL << PWMA_SM3CTRL2_WAITEN_SHIFT)              /*!< PWMA_SM3CTRL2: WAITEN Mask              */
#define PWMA_SM3CTRL2_WAITEN_SHIFT               14                                                  /*!< PWMA_SM3CTRL2: WAITEN Position          */
#define PWMA_SM3CTRL2_WAITEN(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_WAITEN_SHIFT))&PWMA_SM3CTRL2_WAITEN_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_DBGEN_MASK                 (0x01UL << PWMA_SM3CTRL2_DBGEN_SHIFT)               /*!< PWMA_SM3CTRL2: DBGEN Mask               */
#define PWMA_SM3CTRL2_DBGEN_SHIFT                15                                                  /*!< PWMA_SM3CTRL2: DBGEN Position           */
#define PWMA_SM3CTRL2_DBGEN(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_DBGEN_SHIFT))&PWMA_SM3CTRL2_DBGEN_MASK) /*!< PWMA_SM3CTRL2                           */
/* ------- SM3CTRL Bit Fields                       ------ */
#define PWMA_SM3CTRL_DBLEN_MASK                  (0x01UL << PWMA_SM3CTRL_DBLEN_SHIFT)                /*!< PWMA_SM3CTRL: DBLEN Mask                */
#define PWMA_SM3CTRL_DBLEN_SHIFT                 0                                                   /*!< PWMA_SM3CTRL: DBLEN Position            */
#define PWMA_SM3CTRL_DBLEN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_DBLEN_SHIFT))&PWMA_SM3CTRL_DBLEN_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_DBLX_MASK                   (0x01UL << PWMA_SM3CTRL_DBLX_SHIFT)                 /*!< PWMA_SM3CTRL: DBLX Mask                 */
#define PWMA_SM3CTRL_DBLX_SHIFT                  1                                                   /*!< PWMA_SM3CTRL: DBLX Position             */
#define PWMA_SM3CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_DBLX_SHIFT))&PWMA_SM3CTRL_DBLX_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_LDMOD_MASK                  (0x01UL << PWMA_SM3CTRL_LDMOD_SHIFT)                /*!< PWMA_SM3CTRL: LDMOD Mask                */
#define PWMA_SM3CTRL_LDMOD_SHIFT                 2                                                   /*!< PWMA_SM3CTRL: LDMOD Position            */
#define PWMA_SM3CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_LDMOD_SHIFT))&PWMA_SM3CTRL_LDMOD_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_PRSC_MASK                   (0x07UL << PWMA_SM3CTRL_PRSC_SHIFT)                 /*!< PWMA_SM3CTRL: PRSC Mask                 */
#define PWMA_SM3CTRL_PRSC_SHIFT                  4                                                   /*!< PWMA_SM3CTRL: PRSC Position             */
#define PWMA_SM3CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_PRSC_SHIFT))&PWMA_SM3CTRL_PRSC_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_DT_MASK                     (0x03UL << PWMA_SM3CTRL_DT_SHIFT)                   /*!< PWMA_SM3CTRL: DT Mask                   */
#define PWMA_SM3CTRL_DT_SHIFT                    8                                                   /*!< PWMA_SM3CTRL: DT Position               */
#define PWMA_SM3CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_DT_SHIFT))&PWMA_SM3CTRL_DT_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_FULL_MASK                   (0x01UL << PWMA_SM3CTRL_FULL_SHIFT)                 /*!< PWMA_SM3CTRL: FULL Mask                 */
#define PWMA_SM3CTRL_FULL_SHIFT                  10                                                  /*!< PWMA_SM3CTRL: FULL Position             */
#define PWMA_SM3CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_FULL_SHIFT))&PWMA_SM3CTRL_FULL_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_HALF_MASK                   (0x01UL << PWMA_SM3CTRL_HALF_SHIFT)                 /*!< PWMA_SM3CTRL: HALF Mask                 */
#define PWMA_SM3CTRL_HALF_SHIFT                  11                                                  /*!< PWMA_SM3CTRL: HALF Position             */
#define PWMA_SM3CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_HALF_SHIFT))&PWMA_SM3CTRL_HALF_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_LDFQ_MASK                   (0x0FUL << PWMA_SM3CTRL_LDFQ_SHIFT)                 /*!< PWMA_SM3CTRL: LDFQ Mask                 */
#define PWMA_SM3CTRL_LDFQ_SHIFT                  12                                                  /*!< PWMA_SM3CTRL: LDFQ Position             */
#define PWMA_SM3CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_LDFQ_SHIFT))&PWMA_SM3CTRL_LDFQ_MASK) /*!< PWMA_SM3CTRL                            */
/* ------- SM3VAL0 Bit Fields                       ------ */
#define PWMA_SM3VAL0_VAL0_MASK                   (0xFFFFUL << PWMA_SM3VAL0_VAL0_SHIFT)               /*!< PWMA_SM3VAL0: VAL0 Mask                 */
#define PWMA_SM3VAL0_VAL0_SHIFT                  0                                                   /*!< PWMA_SM3VAL0: VAL0 Position             */
#define PWMA_SM3VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL0_VAL0_SHIFT))&PWMA_SM3VAL0_VAL0_MASK) /*!< PWMA_SM3VAL0                            */
/* ------- SM3FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL1_FRACVAL1_MASK           (0x1FUL << PWMA_SM3FRACVAL1_FRACVAL1_SHIFT)         /*!< PWMA_SM3FRACVAL1: FRACVAL1 Mask         */
#define PWMA_SM3FRACVAL1_FRACVAL1_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL1: FRACVAL1 Position     */
#define PWMA_SM3FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL1_FRACVAL1_SHIFT))&PWMA_SM3FRACVAL1_FRACVAL1_MASK) /*!< PWMA_SM3FRACVAL1                        */
/* ------- SM3VAL1 Bit Fields                       ------ */
#define PWMA_SM3VAL1_VAL1_MASK                   (0xFFFFUL << PWMA_SM3VAL1_VAL1_SHIFT)               /*!< PWMA_SM3VAL1: VAL1 Mask                 */
#define PWMA_SM3VAL1_VAL1_SHIFT                  0                                                   /*!< PWMA_SM3VAL1: VAL1 Position             */
#define PWMA_SM3VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL1_VAL1_SHIFT))&PWMA_SM3VAL1_VAL1_MASK) /*!< PWMA_SM3VAL1                            */
/* ------- SM3FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL2_FRACVAL2_MASK           (0x1FUL << PWMA_SM3FRACVAL2_FRACVAL2_SHIFT)         /*!< PWMA_SM3FRACVAL2: FRACVAL2 Mask         */
#define PWMA_SM3FRACVAL2_FRACVAL2_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL2: FRACVAL2 Position     */
#define PWMA_SM3FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL2_FRACVAL2_SHIFT))&PWMA_SM3FRACVAL2_FRACVAL2_MASK) /*!< PWMA_SM3FRACVAL2                        */
/* ------- SM3VAL2 Bit Fields                       ------ */
#define PWMA_SM3VAL2_VAL2_MASK                   (0xFFFFUL << PWMA_SM3VAL2_VAL2_SHIFT)               /*!< PWMA_SM3VAL2: VAL2 Mask                 */
#define PWMA_SM3VAL2_VAL2_SHIFT                  0                                                   /*!< PWMA_SM3VAL2: VAL2 Position             */
#define PWMA_SM3VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL2_VAL2_SHIFT))&PWMA_SM3VAL2_VAL2_MASK) /*!< PWMA_SM3VAL2                            */
/* ------- SM3FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL3_FRACVAL3_MASK           (0x1FUL << PWMA_SM3FRACVAL3_FRACVAL3_SHIFT)         /*!< PWMA_SM3FRACVAL3: FRACVAL3 Mask         */
#define PWMA_SM3FRACVAL3_FRACVAL3_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL3: FRACVAL3 Position     */
#define PWMA_SM3FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL3_FRACVAL3_SHIFT))&PWMA_SM3FRACVAL3_FRACVAL3_MASK) /*!< PWMA_SM3FRACVAL3                        */
/* ------- SM3VAL3 Bit Fields                       ------ */
#define PWMA_SM3VAL3_VAL3_MASK                   (0xFFFFUL << PWMA_SM3VAL3_VAL3_SHIFT)               /*!< PWMA_SM3VAL3: VAL3 Mask                 */
#define PWMA_SM3VAL3_VAL3_SHIFT                  0                                                   /*!< PWMA_SM3VAL3: VAL3 Position             */
#define PWMA_SM3VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL3_VAL3_SHIFT))&PWMA_SM3VAL3_VAL3_MASK) /*!< PWMA_SM3VAL3                            */
/* ------- SM3FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL4_FRACVAL4_MASK           (0x1FUL << PWMA_SM3FRACVAL4_FRACVAL4_SHIFT)         /*!< PWMA_SM3FRACVAL4: FRACVAL4 Mask         */
#define PWMA_SM3FRACVAL4_FRACVAL4_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL4: FRACVAL4 Position     */
#define PWMA_SM3FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL4_FRACVAL4_SHIFT))&PWMA_SM3FRACVAL4_FRACVAL4_MASK) /*!< PWMA_SM3FRACVAL4                        */
/* ------- SM3VAL4 Bit Fields                       ------ */
#define PWMA_SM3VAL4_VAL4_MASK                   (0xFFFFUL << PWMA_SM3VAL4_VAL4_SHIFT)               /*!< PWMA_SM3VAL4: VAL4 Mask                 */
#define PWMA_SM3VAL4_VAL4_SHIFT                  0                                                   /*!< PWMA_SM3VAL4: VAL4 Position             */
#define PWMA_SM3VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL4_VAL4_SHIFT))&PWMA_SM3VAL4_VAL4_MASK) /*!< PWMA_SM3VAL4                            */
/* ------- SM3FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL5_FRACVAL5_MASK           (0x1FUL << PWMA_SM3FRACVAL5_FRACVAL5_SHIFT)         /*!< PWMA_SM3FRACVAL5: FRACVAL5 Mask         */
#define PWMA_SM3FRACVAL5_FRACVAL5_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL5: FRACVAL5 Position     */
#define PWMA_SM3FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL5_FRACVAL5_SHIFT))&PWMA_SM3FRACVAL5_FRACVAL5_MASK) /*!< PWMA_SM3FRACVAL5                        */
/* ------- SM3VAL5 Bit Fields                       ------ */
#define PWMA_SM3VAL5_VAL5_MASK                   (0xFFFFUL << PWMA_SM3VAL5_VAL5_SHIFT)               /*!< PWMA_SM3VAL5: VAL5 Mask                 */
#define PWMA_SM3VAL5_VAL5_SHIFT                  0                                                   /*!< PWMA_SM3VAL5: VAL5 Position             */
#define PWMA_SM3VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL5_VAL5_SHIFT))&PWMA_SM3VAL5_VAL5_MASK) /*!< PWMA_SM3VAL5                            */
/* ------- SM3FRCTRL Bit Fields                     ------ */
#define PWMA_SM3FRCTRL_FRAC1_EN_MASK             (0x01UL << PWMA_SM3FRCTRL_FRAC1_EN_SHIFT)           /*!< PWMA_SM3FRCTRL: FRAC1_EN Mask           */
#define PWMA_SM3FRCTRL_FRAC1_EN_SHIFT            1                                                   /*!< PWMA_SM3FRCTRL: FRAC1_EN Position       */
#define PWMA_SM3FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRCTRL_FRAC1_EN_SHIFT))&PWMA_SM3FRCTRL_FRAC1_EN_MASK) /*!< PWMA_SM3FRCTRL                          */
#define PWMA_SM3FRCTRL_FRAC23_EN_MASK            (0x01UL << PWMA_SM3FRCTRL_FRAC23_EN_SHIFT)          /*!< PWMA_SM3FRCTRL: FRAC23_EN Mask          */
#define PWMA_SM3FRCTRL_FRAC23_EN_SHIFT           2                                                   /*!< PWMA_SM3FRCTRL: FRAC23_EN Position      */
#define PWMA_SM3FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRCTRL_FRAC23_EN_SHIFT))&PWMA_SM3FRCTRL_FRAC23_EN_MASK) /*!< PWMA_SM3FRCTRL                          */
#define PWMA_SM3FRCTRL_FRAC45_EN_MASK            (0x01UL << PWMA_SM3FRCTRL_FRAC45_EN_SHIFT)          /*!< PWMA_SM3FRCTRL: FRAC45_EN Mask          */
#define PWMA_SM3FRCTRL_FRAC45_EN_SHIFT           4                                                   /*!< PWMA_SM3FRCTRL: FRAC45_EN Position      */
#define PWMA_SM3FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRCTRL_FRAC45_EN_SHIFT))&PWMA_SM3FRCTRL_FRAC45_EN_MASK) /*!< PWMA_SM3FRCTRL                          */
#define PWMA_SM3FRCTRL_FRAC_PU_MASK              (0x01UL << PWMA_SM3FRCTRL_FRAC_PU_SHIFT)            /*!< PWMA_SM3FRCTRL: FRAC_PU Mask            */
#define PWMA_SM3FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM3FRCTRL: FRAC_PU Position        */
#define PWMA_SM3FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRCTRL_FRAC_PU_SHIFT))&PWMA_SM3FRCTRL_FRAC_PU_MASK) /*!< PWMA_SM3FRCTRL                          */
#define PWMA_SM3FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM3FRCTRL_TEST_SHIFT)               /*!< PWMA_SM3FRCTRL: TEST Mask               */
#define PWMA_SM3FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM3FRCTRL: TEST Position           */
#define PWMA_SM3FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRCTRL_TEST_SHIFT))&PWMA_SM3FRCTRL_TEST_MASK) /*!< PWMA_SM3FRCTRL                          */
/* ------- SM3OCTRL Bit Fields                      ------ */
#define PWMA_SM3OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM3OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM3OCTRL: PWMXFS Mask              */
#define PWMA_SM3OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM3OCTRL: PWMXFS Position          */
#define PWMA_SM3OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMXFS_SHIFT))&PWMA_SM3OCTRL_PWMXFS_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM3OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM3OCTRL: PWMBFS Mask              */
#define PWMA_SM3OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM3OCTRL: PWMBFS Position          */
#define PWMA_SM3OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMBFS_SHIFT))&PWMA_SM3OCTRL_PWMBFS_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM3OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM3OCTRL: PWMAFS Mask              */
#define PWMA_SM3OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM3OCTRL: PWMAFS Position          */
#define PWMA_SM3OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMAFS_SHIFT))&PWMA_SM3OCTRL_PWMAFS_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_POLX_MASK                  (0x01UL << PWMA_SM3OCTRL_POLX_SHIFT)                /*!< PWMA_SM3OCTRL: POLX Mask                */
#define PWMA_SM3OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM3OCTRL: POLX Position            */
#define PWMA_SM3OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_POLX_SHIFT))&PWMA_SM3OCTRL_POLX_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_POLB_MASK                  (0x01UL << PWMA_SM3OCTRL_POLB_SHIFT)                /*!< PWMA_SM3OCTRL: POLB Mask                */
#define PWMA_SM3OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM3OCTRL: POLB Position            */
#define PWMA_SM3OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_POLB_SHIFT))&PWMA_SM3OCTRL_POLB_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_POLA_MASK                  (0x01UL << PWMA_SM3OCTRL_POLA_SHIFT)                /*!< PWMA_SM3OCTRL: POLA Mask                */
#define PWMA_SM3OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM3OCTRL: POLA Position            */
#define PWMA_SM3OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_POLA_SHIFT))&PWMA_SM3OCTRL_POLA_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM3OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM3OCTRL: PWMX_IN Mask             */
#define PWMA_SM3OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM3OCTRL: PWMX_IN Position         */
#define PWMA_SM3OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMX_IN_SHIFT))&PWMA_SM3OCTRL_PWMX_IN_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM3OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM3OCTRL: PWMB_IN Mask             */
#define PWMA_SM3OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM3OCTRL: PWMB_IN Position         */
#define PWMA_SM3OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3OCTRL_PWMB_IN_SHIFT))&PWMA_SM3OCTRL_PWMB_IN_MASK) /*!< PWMA_SM3OCTRL                           */
#define PWMA_SM3OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM3OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM3OCTRL: PWMA_IN Mask             */
